PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_gfxss.h
/***************************************************************************//**
* \file cyip_gfxss.h
*
* \brief
* GFXSS IP definitions
*
********************************************************************************
* \copyright
* (c) (2016-2025), Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
*
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#ifndef _CYIP_GFXSS_H_
#define _CYIP_GFXSS_H_

#include "cyip_headers.h"

/*******************************************************************************
*                                    GFXSS
*******************************************************************************/

#define GFXSS_GPU_MXGPU_SECTION_SIZE            0x00000020UL
#define GFXSS_GPU_GCNANO_SECTION_SIZE           0x00000800UL
#define GFXSS_GPU_SECTION_SIZE                  0x00001000UL
#define GFXSS_DC_MXDC_SECTION_SIZE              0x00000080UL
#define GFXSS_DC_DCNANO_SECTION_SIZE            0x00000200UL
#define GFXSS_DC_SECTION_SIZE                   0x00001000UL
#define GFXSS_MIPIDSI_MXMIPIDSI_SECTION_SIZE    0x00001000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_SECTION_SIZE   0x00001000UL
#define GFXSS_MIPIDSI_SECTION_SIZE              0x00002000UL
#define GFXSS_SECTION_SIZE                      0x00004000UL

/**
  * \brief Platform IP standard configuration for GPU. (GFXSS_GPU_MXGPU)
  */
typedef struct
{
    __IOM uint32_t CTL;                           /*!< 0x00000000 IP control. */
    __IM uint32_t RESERVED[2];
    __IM uint32_t STATUS;                        /*!< 0x0000000C IP status. */
    __IOM uint32_t INTR;                          /*!< 0x00000010 Interrupt status bits. */
    __IOM uint32_t INTR_SET;                      /*!< 0x00000014 Interrupt set bits. */
    __IOM uint32_t INTR_MASK;                     /*!< 0x00000018 Interrupt mask bits. */
    __IM uint32_t INTR_MASKED;                   /*!< 0x0000001C Interrupt masked bits. */
} GFXSS_GPU_MXGPU_Type;                         /*!< Size = 32 (0x20) */

/**
  * \brief Host Interface Registers (GFXSS_GPU_GCNANO)
  */
typedef struct
{
    __IOM uint32_t AQHICLOCKCONTROL;              /*!< 0x00000000 Clock Control Register. */
    __IM uint32_t AQHIIDLE;                      /*!< 0x00000004 Idle Status Register. */
    __IOM uint32_t AQAXICONFIG;                   /*!< 0x00000008 AXI Configuration Register. */
    __IM uint32_t AQAXISTATUS;                   /*!< 0x0000000C AXI Status Register. READ ONLY. Back-to-back read is forbidden
                                                                to this register and can cause system hang. Please insert delay
                                                                (nop operation) between two consecutive reads while accessing
                                                                this register outside of VSI drivers. */
    __IM uint32_t AQINTRACKNOWLEDGE;             /*!< 0x00000010 Interrupt Acknowledge Register. Each bit represents a
                                                                corresponding event being triggered. Reading from this register
                                                                clears the outstanding interrupt. READ ONLY. When the access
                                                                comes from a debugger (HMASTER[0] == 1), the clear by read
                                                                function is disabled. Back-to-back read is forbidden to this
                                                                register and can cause system hang. Please insert delay (nop
                                                                operation) between two consecutive reads while accessing this
                                                                register outside of VSI drivers. */
    __IOM uint32_t AQINTRENBL;                    /*!< 0x00000014 Interrupt Enable Register. Each bit enables a corresponding
                                                                event. */
    __IM uint32_t RESERVED[3];
    __IM uint32_t GCCHIPREV;                     /*!< 0x00000024 Chip Revsion Register. Shows the revision for the chip in BCD.
                                                                This register has no set reset value. It varies with the
                                                                implementation. READ ONLY. */
    __IM uint32_t GCCHIPDATE;                    /*!< 0x00000028 Chip Date Register. Shows the release date for the IP in
                                                                YYYYMMDD (year/month/day) format. This register has no set reset
                                                                value. It varies with the implementation. READ ONLY. */
    __IM uint32_t RESERVED1[27];
    __IM uint32_t GCREGHICHIPPATCHREV;           /*!< 0x00000098 Chip Patch Revision Register. Patch revision level for the
                                                                chip. It varies per release. READ ONLY */
    __IM uint32_t RESERVED2[3];
    __IM uint32_t GCPRODUCTID;                   /*!< 0x000000A8 Product Identification Register. Shows Product ID. READ ONLY. */
    __IM uint32_t RESERVED3[21];
    __IOM uint32_t GCMODULEPOWERCONTROLS;         /*!< 0x00000100 Module Power Control Register. Control register for module
                                                                level power controls. */
    __IOM uint32_t GCMODULEPOWERMODULECONTROL;    /*!< 0x00000104 Module Power Module Control Register. Module level control
                                                                register. */
    __IM uint32_t GCMODULEPOWERMODULESTATUS;     /*!< 0x00000108 Module Power Module Status Register. Module level control
                                                                status. */
    __IM uint32_t RESERVED4[194];
    __IOM uint32_t AQMEMORYDEBUG;                 /*!< 0x00000414 Memory Debug Register. */
    __IM uint32_t RESERVED5[5];
    __IOM uint32_t AQREGISTERTIMINGCONTROL;       /*!< 0x0000042C Timing Control Register. */
    __IM uint32_t RESERVED6[52];
    __IOM uint32_t GCREGFETCHADDRESS;             /*!< 0x00000500 Fetch Command Buffer Base Address Register. Address of the
                                                                command buffer. The address must be 64-byte aligned. */
    __IOM uint32_t GCREGFETCHCONTROL;             /*!< 0x00000504 Fetch Control Register. Writing a non-zero value to this
                                                                register starts the fetch engine. The FE will start fetching
                                                                64-bit commands and data starting at the address specified by
                                                                the gcregFetchAddress register. Make sure this count is large
                                                                enough to fetch the END command, otherwise the FE will wait
                                                                until more data is coming. */
    __IM uint32_t GCREGCURRENTFETCHADDRESS;      /*!< 0x00000508 Current Fetch Command Address Register. Debugging register that
                                                                defines the current address the FE is fetching data from. READ
                                                                ONLY. */
    __IM uint32_t RESERVED7[189];
} GFXSS_GPU_GCNANO_Type;                        /*!< Size = 2048 (0x800) */

/**
  * \brief Graphics Processing Unit. (GFXSS_GPU)
  */
typedef struct
{
    GFXSS_GPU_MXGPU_Type MXGPU;             /*!< 0x00000000 Platform IP standard configuration for GPU. */
    __IM uint32_t RESERVED[504];
    GFXSS_GPU_GCNANO_Type GCNANO;           /*!< 0x00000800 Host Interface Registers */
} GFXSS_GPU_Type;                               /*!< Size = 4096 (0x1000) */

/**
  * \brief Platform IP standard configuration for DC. (GFXSS_DC_MXDC)
  */
typedef struct
{
    __IOM uint32_t CTL;                           /*!< 0x00000000 IP control. */
    __IOM uint32_t CLK_CTL;                       /*!< 0x00000004 Clock control. */
    __IOM uint32_t IO_CTL;                        /*!< 0x00000008 IO enable control. */
    __IM uint32_t STATUS;                        /*!< 0x0000000C IP status. */
    __IOM uint32_t INTR;                          /*!< 0x00000010 Interrupt status. */
    __IOM uint32_t INTR_SET;                      /*!< 0x00000014 Interrupt set bits. */
    __IOM uint32_t INTR_MASK;                     /*!< 0x00000018 Interrupt mask bits. */
    __IM uint32_t INTR_MASKED;                   /*!< 0x0000001C Interrupt masked bits. */
    __IOM uint32_t ADDR0_INT;                     /*!< 0x00000020 Address 0 for interrupt generation. */
    __IOM uint32_t ADDR1_INT;                     /*!< 0x00000024 Address 1 for interrupt generation. */
    __IOM uint32_t ADDR2_INT;                     /*!< 0x00000028 Address 2 for interrupt generation. */
    __IOM uint32_t ADDR3_INT;                     /*!< 0x0000002C Address 3 for interrupt generation. */
    __IM uint32_t RESERVED[4];
    __IOM uint32_t RLAD_CTL;                      /*!< 0x00000040 Control options for the RLAD decoder. */
    __IOM uint32_t RLAD_IMG;                      /*!< 0x00000044 Properties of the uncompressed image. */
    __IOM uint32_t RLAD_ENC;                      /*!< 0x00000048 Configuration of the encoder that compressed the image. */
    __IOM uint32_t RLAD_BUF0;                     /*!< 0x0000004C Properties of the compressed image data buffer. */
    __IOM uint32_t RLAD_BUF1;                     /*!< 0x00000050 Properties of the compressed image data buffer. */
    __IM uint32_t RLAD_STATUS;                   /*!< 0x00000054 RLAD decoder status. */
    __IM uint32_t RESERVED1[6];
    __IM uint32_t IPIDENTIFIER;                  /*!< 0x00000070 GFXSS IP and desig release identification (with DC, GPU and
                                                                MIPIDSI). */
    __IM uint32_t RESERVED2[3];
} GFXSS_DC_MXDC_Type;                           /*!< Size = 128 (0x80) */

