PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_gfxss.h
/**
  * \brief Host Interface Registers (GFXSS_DC_DCNANO)
  */
typedef struct
{
    __IM uint32_t GCREGDCCHIPREV;                /*!< 0x00000000 Chip Revision Register. Shows the revision for the chip in BCD.
                                                                This register has no set reset value. It varies with the
                                                                implementation. READ ONLY. */
    __IM uint32_t GCREGDCCHIPDATE;               /*!< 0x00000004 Chip Date Register. Shows the release date for the IP in
                                                                YYYYMMDD (year, month. day) format. This register has no set
                                                                reset value. It varies with the implementation. READ ONLY. */
    __IM uint32_t GCREGDCCHIPPATCHREV;           /*!< 0x00000008 Patch Revision Register. Patch revision level for the chip.
                                                                READ ONLY. */
    __IM uint32_t GCREGDCPRODUCTID;              /*!< 0x0000000C Product Identification Register. READ ONLY. */
    __IM uint32_t RESERVED[5];
    __IOM uint32_t GCREGFRAMEBUFFERCONFIG;        /*!< 0x00000024 Frame Buffer Configuration Register. Frame Buffer and Timing
                                                                control. NOTE.. This register is double buffered. */
    __IOM uint32_t GCREGFRAMEBUFFERADDRESS;       /*!< 0x00000028 Frame Buffer Base Address Register. Starting address of the
                                                                frame buffer. NOTE.. This register is double buffered. */
    __IOM uint32_t GCREGFRAMEBUFFERSTRIDE;        /*!< 0x0000002C Frame Buffer Stride Register. Stride of the frame buffer in
                                                                bytes. NOTE.. This register is double buffered. */
    __IM uint32_t RESERVED1;
    __IOM uint32_t GCREGDCTILEINCFG;              /*!< 0x00000034 Tile Input Configuration Register. Tile input configuration.
                                                                NOTE.. This register is double buffered. */
    __IOM uint32_t GCREGDCTILEUVFRAMEBUFFERADR;   /*!< 0x00000038 Frame Buffer Tiled UV Base Address Register. UV frame buffer
                                                                address when tile input. NOTE.. This register is double
                                                                buffered. */
    __IOM uint32_t GCREGDCTILEUVFRAMEBUFFERSTR;   /*!< 0x0000003C Frame Buffer Tiled UV Stride Register. UV frame buffer stride
                                                                when tile input NOTE.. This register is double buffered. */
    __IM uint32_t RESERVED2[6];
    __IOM uint32_t GCREGFRAMEBUFFERBACKGROUND;    /*!< 0x00000058 Framebuffer background color. NOTE.. This register is double
                                                                buffered. */
    __IOM uint32_t GCREGFRAMEBUFFERCOLORKEY;      /*!< 0x0000005C Framebuffer Color Key Start Address Register. Start of color
                                                                key range of framebuffer. NOTE.. This register is double
                                                                buffered. */
    __IOM uint32_t GCREGFRAMEBUFFERCOLORKEYHIGH;  /*!< 0x00000060 Framebuffer Color Key End Address Register. End of color key
                                                                range of framebuffer. NOTE.. This register is double buffered. */
    __IOM uint32_t GCREGFRAMEBUFFERCLEARVALUE;    /*!< 0x00000064 Framebuffer Clear Value Register. Clear value used when
                                                                dcregFrameBufferConfig.Clear is enabled, format is A8R8G8B8.
                                                                NOTE.. This register is double buffered. */
    __IOM uint32_t GCREGVIDEOTL;                  /*!< 0x00000068 Top left coordinate of panel pixel where the video should
                                                                start. Be aware there is no panning inside the video. NOTE..
                                                                This register is double buffered. */
    __IOM uint32_t GCREGFRAMEBUFFERSIZE;          /*!< 0x0000006C video size information. NOTE.. This register is double
                                                                buffered. */
    __IOM uint32_t GCREGVIDEOGLOBALALPHA;         /*!< 0x00000070 Global alpha for the video. NOTE.. This register is double
                                                                buffered. */
    __IOM uint32_t GCREGBLENDSTACKORDER;          /*!< 0x00000074 Set the video, overlay0, overlay1 order for blend. The 1st is
                                                                the lowest layer, the 2nd is the middle layer, the 3rd is the
                                                                highest layer. NOTE.. This register is double buffered. */
    __IOM uint32_t GCREGVIDEOALPHABLENDCONFIG;    /*!< 0x00000078 Alpha Blending Configuration Register. NOTE.. This register is
                                                                double buffered. */
    __IOM uint32_t GCREGOVERLAYCONFIG;            /*!< 0x0000007C Overlay Configuration Register. Overlay control. NOTE.. This
                                                                register is double buffered. */
    __IOM uint32_t GCREGOVERLAYADDRESS;           /*!< 0x00000080 Starting address of the overlay. NOTE.. This register is double
                                                                buffered. */
    __IOM uint32_t GCREGOVERLAYSTRIDE;            /*!< 0x00000084 Stride of the overlay in bytes. NOTE.. This register is double
                                                                buffered. */
    __IOM uint32_t GCREGDCOVERLAYTILEINCFG;       /*!< 0x00000088 Tile Input Configuration Register. Tile input configuration.
                                                                NOTE.. This register is double buffered. */
    __IOM uint32_t GCREGDCTILEUVOVERLAYADR;       /*!< 0x0000008C Starting address of the overlay UV. NOTE.. This register is
                                                                double buffered. */
    __IOM uint32_t GCREGDCTILEUVOVERLAYSTR;       /*!< 0x00000090 Stride of the overlay UV in bytes. NOTE.. This register is
                                                                double buffered. */
    __IOM uint32_t GCREGOVERLAYTL;                /*!< 0x00000094 Top left coordinate of panel pixel where the overlay should
                                                                start. Be aware there is no panning inside the overlay. NOTE..
                                                                This register is double buffered. */
    __IOM uint32_t GCREGOVERLAYSIZE;              /*!< 0x00000098 overlay size information. NOTE.. This register is double
                                                                buffered. */
    __IOM uint32_t GCREGOVERLAYCOLORKEY;          /*!< 0x0000009C Overlay Color Key Start Address Register. Start of color key
                                                                range for overlay. NOTE.. This register is double buffered. */
    __IOM uint32_t GCREGOVERLAYCOLORKEYHIGH;      /*!< 0x000000A0 Overlay Color Key End Address Register. End of color key range
                                                                for overlay. NOTE.. This register is double buffered. */
    __IOM uint32_t GCREGOVERLAYALPHABLENDCONFIG;  /*!< 0x000000A4 Alpha Blending Configuration Register. NOTE.. This register is
                                                                double buffered. */
    __IOM uint32_t GCREGOVERLAYGLOBALALPHA;       /*!< 0x000000A8 Overlay global alpha value. NOTE.. This register is double
                                                                buffered. */
    __IOM uint32_t GCREGOVERLAYCLEARVALUE;        /*!< 0x000000AC Overlay Clear Value Register. Clear value used when
                                                                dcregOverlayConfig.Clear is enabled, Format is A8R8G8B8. NOTE..
                                                                This register is double buffered. */
    __IOM uint32_t GCREGOVERLAYCONFIG1;           /*!< 0x000000B0 Overlay Configuration Register. Overlay control. NOTE.. This
                                                                register is double buffered. */
    __IOM uint32_t GCREGOVERLAYADDRESS1;          /*!< 0x000000B4 Starting address of the overlay. NOTE.. This register is double
                                                                buffered. */
    __IOM uint32_t GCREGOVERLAYSTRIDE1;           /*!< 0x000000B8 Stride of the overlay in bytes. NOTE.. This register is double
                                                                buffered. */
    __IOM uint32_t GCREGOVERLAYTL1;               /*!< 0x000000BC Top left coordinate of panel pixel where the overlay should
                                                                start. Be aware there is no panning inside the overlay. NOTE..
                                                                This register is double buffered. */
    __IOM uint32_t GCREGOVERLAYSIZE1;             /*!< 0x000000C0 overlay1 size information. NOTE.. This register is double
                                                                buffered. */
    __IOM uint32_t GCREGOVERLAYCOLORKEY1;         /*!< 0x000000C4 Overlay Color Key Start Address Register. Start of color key
                                                                range for overlay. NOTE.. This register is double buffered. */
    __IOM uint32_t GCREGOVERLAYCOLORKEYHIGH1;     /*!< 0x000000C8 Overlay Color Key End Address Register. End of color key range
                                                                for overlay. NOTE.. This register is double buffered. */
    __IOM uint32_t GCREGOVERLAYALPHABLENDCONFIG1; /*!< 0x000000CC Alpha Blending Configuration Register. NOTE.. This register is
                                                                double buffered. */
    __IOM uint32_t GCREGOVERLAYGLOBALALPHA1;      /*!< 0x000000D0 Overlay global alpha value. NOTE.. This register is double
                                                                buffered. */
    __IOM uint32_t GCREGOVERLAYCLEARVALUE1;       /*!< 0x000000D4 Overlay Clear Value Register. Clear value used when
                                                                dcregOverlayConfig.Clear is enabled, Format is A8R8G8B8. NOTE..
                                                                This register is double buffered. */
    __IM uint32_t RESERVED3[2];
    __IOM uint32_t GCREGDISPLAYDITHERTABLELOW;    /*!< 0x000000E0 Dither Threshold Table Register. */
    __IOM uint32_t GCREGDISPLAYDITHERTABLEHIGH;   /*!< 0x000000E4 Dither Threshold Table Register. */
    __IOM uint32_t GCREGPANELCONFIG;              /*!< 0x000000E8 Panel Configuration Register. */
    __IOM uint32_t GCREGPANELCONTROL;             /*!< 0x000000EC Panel control Register. */
    __IOM uint32_t GCREGPANELFUNCTION;            /*!< 0x000000F0 Panel function Register. NOTE.. This register is double
                                                                buffered. */
    __OM uint32_t GCREGPANELWORKING;             /*!< 0x000000F4 Register to trigger Display Controller. */
    __IM uint32_t GCREGPANELSTATE;               /*!< 0x000000F8 Register representing the Display Controller status. READ ONLY. */
    __IM uint32_t RESERVED4;
    __IOM uint32_t GCREGHDISPLAY;                 /*!< 0x00000100 Horizontal Display Total and Visible Pixel Count Register.
                                                                Horizontal Total and Display End counters. NOTE.. This register
                                                                is double buffered. */
    __IOM uint32_t GCREGHSYNC;                    /*!< 0x00000104 Horizontal Sync Counter Register. Horizontal Sync counters.
                                                                NOTE.. This register is double buffered. */
    __IM uint32_t RESERVED5[2];
    __IOM uint32_t GCREGVDISPLAY;                 /*!< 0x00000110 Vertical Total and Visible Pixel Count Register. Vertical Total
                                                                and Display End counters. NOTE.. This register is double
                                                                buffered. */
    __IOM uint32_t GCREGVSYNC;                    /*!< 0x00000114 Vertical Sync Counter Register. Vertical Sync counters. NOTE..
                                                                This register is double buffered. */
    __IM uint32_t GCREGDISPLAYCURRENTLOCATION;   /*!< 0x00000118 Display Current Location Register. Current x,y location of
                                                                display controller. READ ONLY. */
    __OM uint32_t GCREGGAMMAINDEX;               /*!< 0x0000011C Gamma Index Register. Index into gamma table. See
                                                                gcregGammaData for more information. */
    __OM uint32_t GCREGGAMMADATA;                /*!< 0x00000120 Gamma Data Register. Translation values for the gamma table.
                                                                When this register gets written, the data gets stored in the
                                                                gamma table at the index specified by the gcregGammaIndex
                                                                register. After the register is written, the index gets
                                                                incremented. */
    __IOM uint32_t GCREGCURSORCONFIG;             /*!< 0x00000124 Cursor Configuration Register. Configuration register for the
                                                                cursor. Double-buffered values in this register cannot be read
                                                                while a flip is in progress. NOTE.. This register is double
                                                                buffered. */
    __IOM uint32_t GCREGCURSORADDRESS;            /*!< 0x00000128 Cursor Base Address Register. Address of the cursor shape.
                                                                NOTE.. This register is double buffered. */
    __IOM uint32_t GCREGCURSORLOCATION;           /*!< 0x0000012C Cursor Location Register. Location of the cursor on the owning
                                                                display. NOTE.. This register is double buffered. */
    __IOM uint32_t GCREGCURSORBACKGROUND;         /*!< 0x00000130 Cursor Background Color Register. The background color for
                                                                Masked cursors. NOTE.. This register is double buffered. */
    __IOM uint32_t GCREGCURSORFOREGROUND;         /*!< 0x00000134 Cursor Foreground Color Register. The foreground color for
                                                                Masked cursors. NOTE.. This register is double buffered. */
    __IM uint32_t GCREGDISPLAYINTR;              /*!< 0x00000138 Display Interrupt Register. This is the interrupt register for
                                                                the Display. This register will automatically clear after a
                                                                read. The interrupt bit is set when the current frame buffer is
                                                                used up. The interrupt signal will be pulled up only when the
                                                                interrupt enable bit in register gcregDisplayIntrEnable is
                                                                enabled. READ ONLY. When the access comes from a debugger
                                                                (HMASTER[0] == 1), the clear by read function is disabled. */
    __IOM uint32_t GCREGDISPLAYINTRENABLE;        /*!< 0x0000013C Display Interrupt Enable Register. The interrupt enable
                                                                register for display_0 (and display_1 if present). NOTE..
                                                                Interrupt enable for register gcregDisplayIntr. NOTE.. This
                                                                register is double buffered. */
    __IOM uint32_t GCREGDBICONFIG;                /*!< 0x00000140 DBI Configuration Register. Configuration register for DBI
                                                                output. */
    __OM uint32_t GCREGDBIIFRESET;               /*!< 0x00000144 DBI Reset Register. Reset DBI interface to idle state. WRITE
                                                                ONLY. */
    __IOM uint32_t GCREGDBIWRCHAR1;               /*!< 0x00000148 DBI Write AC Characteristics 1 Register. DBI write AC
                                                                characteristics definition register 1 */
    __IOM uint32_t GCREGDBIWRCHAR2;               /*!< 0x0000014C DBI Write AC Characteristics 2 Register. DBI write AC
                                                                characteristics definition register 2 */
    __OM uint32_t GCREGDBICMD;                   /*!< 0x00000150 DBI Command Control Register. DBI Command in/out port. Writes
                                                                to this register will send command/data to the DBI port. WRITE
                                                                ONLY. */
    __IOM uint32_t GCREGDPICONFIG;                /*!< 0x00000154 DPI Configuration Register. The configuration register for DPI
                                                                output. NOTE.. This register is double buffered. */
    __IOM uint32_t GCREGDBITYPECCFG;              /*!< 0x00000158 DBI Type C Timing Control Register. DBI Type C write timing
                                                                definition. */
    __IM uint32_t GCREGDCSTATUS;                 /*!< 0x0000015C Display Controller Status Register. READ ONLY. */
    __IOM uint32_t GCREGSRCCONFIGENDIAN;          /*!< 0x00000160 Endian control. */
    __OM uint32_t GCREGSOFTRESET;                /*!< 0x00000164 Soft reset. WRITE ONLY. */
    __IOM uint32_t GCREGDCCONTROL;                /*!< 0x00000168 Control register. */
    __IOM uint32_t GCREGREGISTERTIMINGCONTROL;    /*!< 0x0000016C Timing control register. */
    __IOM uint32_t GCREGDEBUGCOUNTERSELECT;       /*!< 0x00000170 Debug Counter Select Register. */
    __IM uint32_t GCREGDEBUGCOUNTERVALUE;        /*!< 0x00000174 Debug Counter Value Register. Debug Counter Value as specified
                                                                in gcregDebugCounterSelect. READ ONLY */
    __IM uint32_t RESERVED6[10];
    __IOM uint32_t GCREGLAYERCLOCKGATE;           /*!< 0x000001A0 Layer clock gater Register. disable video/overlay0/overlay1
                                                                clock gater */
    __IM uint32_t GCREGDEBUGTOTVIDEOREQ;         /*!< 0x000001A4 debug registers.. count video current frame number of requested
                                                                burst. READ ONLY */
    __IM uint32_t GCREGDEBUGLSTVIDEOREQ;         /*!< 0x000001A8 debug registers.. count video last frame number of requested
                                                                burst. READ ONLY */
    __IM uint32_t GCREGDEBUGTOTVIDEORRB;         /*!< 0x000001AC debug registers.. count video current frame number of returned
                                                                burst. READ ONLY */
    __IM uint32_t GCREGDEBUGLSTVIDEORRB;         /*!< 0x000001B0 debug registers.. count video last frame number of returned
                                                                burst. READ ONLY */
    __IM uint32_t GCREGDEBUGTOTOVERLAY0REQ;      /*!< 0x000001B4 debug registers.. count overlay0 current frame number of
                                                                requested burst. READ ONLY */
    __IM uint32_t GCREGDEBUGLSTOVERLAY0REQ;      /*!< 0x000001B8 debug registers.. count overlay0 last frame number of requested
                                                                burst. READ ONLY */
    __IM uint32_t GCREGDEBUGTOTOVERLAY0RRB;      /*!< 0x000001BC debug registers.. count overlay0 current frame number of
                                                                returned burst. READ ONLY */
    __IM uint32_t GCREGDEBUGLSTOVERLAY0RRB;      /*!< 0x000001C0 debug registers.. count overlay0 last frame number of returned
                                                                burst. READ ONLY */
    __IM uint32_t GCREGDEBUGTOTOVERLAY1REQ;      /*!< 0x000001C4 debug registers.. count overlay1 current frame number of
                                                                requested burst. READ ONLY */
    __IM uint32_t GCREGDEBUGLSTOVERLAY1REQ;      /*!< 0x000001C8 debug registers.. count overlay1 last frame number of requested
                                                                burst. READ ONLY */
    __IM uint32_t GCREGDEBUGTOTOVERLAY1RRB;      /*!< 0x000001CC debug registers.. count overlay1 current frame number of
                                                                returned burst. READ ONLY */
    __IM uint32_t GCREGDEBUGLSTOVERLAY1RRB;      /*!< 0x000001D0 debug registers.. count overlay1 last frame number of returned
                                                                burst. READ ONLY */
    __IM uint32_t GCREGDEBUGTOTCURSORREQ;        /*!< 0x000001D4 debug registers.. count cursor current frame number of
                                                                requested burst. READ ONLY */
    __IM uint32_t GCREGDEBUGLSTCURSORREQ;        /*!< 0x000001D8 debug registers.. count cursor last frame number of requested
                                                                burst. READ ONLY */
    __IM uint32_t GCREGDEBUGTOTCURSORRRB;        /*!< 0x000001DC debug registers.. count cursor current frame number of returned
                                                                burst. READ ONLY */
    __IM uint32_t GCREGDEBUGLSTCURSORRRB;        /*!< 0x000001E0 debug registers.. count cursor last frame number of returned
                                                                burst. READ ONLY */
    __IM uint32_t GCREGDEBUGTOTDCREQ;            /*!< 0x000001E4 debug registers.. count DC current frame number of requested
                                                                burst. READ ONLY */
    __IM uint32_t GCREGDEBUGLSTDCREQ;            /*!< 0x000001E8 debug registers.. count DC last frame number of requested
                                                                burst. READ ONLY */
    __IM uint32_t GCREGDEBUGTOTDCRRB;            /*!< 0x000001EC debug registers.. count DC current frame number of returned
                                                                burst. READ ONLY */
    __IM uint32_t GCREGDEBUGLSTDCRRB;            /*!< 0x000001F0 debug registers.. count DC last frame number of returned burst.
                                                                READ ONLY */
    __IM uint32_t GCREGDEBUGFRAMEANDMISFLAG;     /*!< 0x000001F4 debug registers. READ ONLY */
    __IM uint32_t RESERVED7[2];
} GFXSS_DC_DCNANO_Type;                         /*!< Size = 512 (0x200) */

