PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_gfxss.h
/**
  * \brief Display Controller. (GFXSS_DC)
  */
typedef struct
{
    GFXSS_DC_MXDC_Type MXDC;                /*!< 0x00000000 Platform IP standard configuration for DC. */
    __IM uint32_t RESERVED[480];
    GFXSS_DC_DCNANO_Type DCNANO;            /*!< 0x00000800 Host Interface Registers */
    __IM uint32_t RESERVED1[384];
} GFXSS_DC_Type;                                /*!< Size = 4096 (0x1000) */

/**
  * \brief Platform IP standard configuration for MIPI-DSI. (GFXSS_MIPIDSI_MXMIPIDSI)
  */
typedef struct
{
    __IOM uint32_t CTL;                           /*!< 0x00000000 IP control. */
    __IOM uint32_t CLK_CTL;                       /*!< 0x00000004 Clock control. */
    __IM uint32_t RESERVED[2];
    __IOM uint32_t INTR;                          /*!< 0x00000010 Interrupt status bits. */
    __IOM uint32_t INTR_SET;                      /*!< 0x00000014 Interrupt set bits. */
    __IOM uint32_t INTR_MASK;                     /*!< 0x00000018 Interrupt mask bits. */
    __IM uint32_t INTR_MASKED;                   /*!< 0x0000001C Interrupt masked bits. */
    __IOM uint32_t DPI_CMD;                       /*!< 0x00000020 DPI command control. */
    __IOM uint32_t DBI_CMD;                       /*!< 0x00000024 DBI command control. */
    __IM uint32_t RESERVED1[2];
    __IOM uint32_t PHY_FREQ_RANGE;                /*!< 0x00000030 PHY frequency range selection. */
    __IOM uint32_t BIST;                          /*!< 0x00000034 BIST control. */
    __IOM uint32_t IO_CONTINUITY_TEST;            /*!< 0x00000038 IO continuity test control. */
    __IOM uint32_t PLL_TEST_CONFIG1;              /*!< 0x0000003C PLL-SoC interface configuration for Test. */
    __IOM uint32_t PLL_TEST_CONFIG2;              /*!< 0x00000040 PLL-SoC interface configuration for Test. */
    __IM uint32_t PLL_TEST_OBS1;                 /*!< 0x00000044 PLL Test Observation bits. */
    __IM uint32_t PLL_TEST_OBS2;                 /*!< 0x00000048 PLL Test Observation bits. */
    __IM uint32_t LP_INTERNAL_LOOPBACK_TEST;     /*!< 0x0000004C Low Power internal Loopback Test */
    __IM uint32_t RESERVED2[1004];
} GFXSS_MIPIDSI_MXMIPIDSI_Type;                 /*!< Size = 4096 (0x1000) */

/**
  * \brief DSI Registers (GFXSS_MIPIDSI_DWCMIPIDSI)
  */
typedef struct
{
    __IM uint32_t VERSION;                       /*!< 0x00000000 Contains the version of the DSI host controller. */
    __IOM uint32_t PWR_UP;                        /*!< 0x00000004 Controls the power up of the controller. */
    __IOM uint32_t CLKMGR_CFG;                    /*!< 0x00000008 Configures the factor for internal dividers to divide
                                                                lanebyteclk for timeout purposes. */
    __IOM uint32_t DPI_VCID;                      /*!< 0x0000000C Configures the Virtual Channel ID for DPI traffic. */
    __IOM uint32_t DPI_COLOR_CODING;              /*!< 0x00000010 Configures DPI color coding. */
    __IOM uint32_t DPI_CFG_POL;                   /*!< 0x00000014 Configures the polarity of DPI signals. */
    __IOM uint32_t DPI_LP_CMD_TIM;                /*!< 0x00000018 Configures the timing for low-power commands sent while in
                                                                video mode. */
    __IOM uint32_t DBI_VCID;                      /*!< 0x0000001C Configures Virtual Channel ID for DBI traffic. */
    __IOM uint32_t DBI_CFG;                       /*!< 0x00000020 Configures the bit width of pixels for DBI. */
    __IOM uint32_t DBI_PARTITIONING_EN;           /*!< 0x00000024 Configures whether DWC_mipi_dsi_host is to partition DBI
                                                                traffic automatically. */
    __IOM uint32_t DBI_CMDSIZE;                   /*!< 0x00000028 Configures the command size and the size for automatic
                                                                partitioning of DBI packets. */
    __IOM uint32_t PCKHDL_CFG;                    /*!< 0x0000002C Configures how EoTp, BTA, CRC and ECC are to be used, to meet
                                                                peripherals characteristics */
    __IOM uint32_t GEN_VCID;                      /*!< 0x00000030 Configures the Virtual Channel ID of READ responses to store
                                                                and return to Generic interface. */
    __IOM uint32_t MODE_CFG;                      /*!< 0x00000034 Configures the mode of operation between Video or Command Mode.
                                                                (Commands can still be sent while in video mode.) */
    __IOM uint32_t VID_MODE_CFG;                  /*!< 0x00000038 Configures several aspects of Video mode operation, the
                                                                transmission mode, switching to low-power in the middle of a
                                                                frame, enabling acknowledge and whether to send commands in
                                                                low-power. */
    __IOM uint32_t VID_PKT_SIZE;                  /*!< 0x0000003C Configures the video packet size. */
    __IOM uint32_t VID_NUM_CHUNKS;                /*!< 0x00000040 Configures the number of chunks to use. The data in each chunk
                                                                has the size provided by VID_PKT_SIZE. */
    __IOM uint32_t VID_NULL_SIZE;                 /*!< 0x00000044 Configures the size of null packets. */
    __IOM uint32_t VID_HSA_TIME;                  /*!< 0x00000048 Configures the video HSA time. */
    __IOM uint32_t VID_HBP_TIME;                  /*!< 0x0000004C Configures the video HBP time. */
    __IOM uint32_t VID_HLINE_TIME;                /*!< 0x00000050 Configures the overall time for each video line. */
    __IOM uint32_t VID_VSA_LINES;                 /*!< 0x00000054 Configures the VSA period. */
    __IOM uint32_t VID_VBP_LINES;                 /*!< 0x00000058 Configures the VBP period. */
    __IOM uint32_t VID_VFP_LINES;                 /*!< 0x0000005C Configures the VFP period. */
    __IOM uint32_t VID_VACTIVE_LINES;             /*!< 0x00000060 Configures the vertical resolution of video. */
    __IM uint32_t RESERVED;
    __IOM uint32_t CMD_MODE_CFG;                  /*!< 0x00000068 Configures several aspect of command mode operation, tearing
                                                                effect, acknowledge for each packet and the speed mode to
                                                                transmit each Data Type related to commands. */
    __IOM uint32_t GEN_HDR;                       /*!< 0x0000006C Sets the header for new packets sent using the Generic
                                                                interface. */
    __IOM uint32_t GEN_PLD_DATA;                  /*!< 0x00000070 Sets the payload for packets sent using the Generic interface
                                                                and, when read returns the contents of READ responses from the
                                                                peripheral. */
    __IM uint32_t CMD_PKT_STATUS;                /*!< 0x00000074 Contains information about the status of FIFOs related to DBI
                                                                and Generic interface. */
    __IOM uint32_t TO_CNT_CFG;                    /*!< 0x00000078 Configures counters that trigger timeout errors. These are used
                                                                to warn the system of a failure, through an interrupt, and
                                                                restart the controller in case of unexpected situations that
                                                                cause deadlock conditions. */
    __IOM uint32_t HS_RD_TO_CNT;                  /*!< 0x0000007C Configures the Peripheral Response timeout after high-speed
                                                                Read operations. */
    __IOM uint32_t LP_RD_TO_CNT;                  /*!< 0x00000080 Configures the Peripheral Response timeout after low-power Read
                                                                operations. */
    __IOM uint32_t HS_WR_TO_CNT;                  /*!< 0x00000084 Configures the Peripheral Response timeout after high-speed
                                                                Write operations. */
    __IOM uint32_t LP_WR_TO_CNT;                  /*!< 0x00000088 Configures the Peripheral Response timeout after low-power
                                                                Write operations. */
    __IOM uint32_t BTA_TO_CNT;                    /*!< 0x0000008C Configures the Peripheral Response timeout after Bus Turnaround
                                                                completion. */
    __IOM uint32_t SDF_3D;                        /*!< 0x00000090 Stores 3D control information for VSS packets in video mode. */
    __IOM uint32_t LPCLK_CTRL;                    /*!< 0x00000094 Configures the possibility for using non continuous clock in
                                                                the clock lane. */
    __IOM uint32_t PHY_TMR_LPCLK_CFG;             /*!< 0x00000098 Sets the time that DWC_mipi_dsi_host assumes in calculations
                                                                for the clock lane to switch between high-speed and low-power. */
    __IOM uint32_t PHY_TMR_CFG;                   /*!< 0x0000009C Sets the time that DWC_mipi_dsi_host assumes in calculations
                                                                for the data lanes to switch between high-speed and low-power. */
    __IOM uint32_t PHY_RSTZ;                      /*!< 0x000000A0 Controls resets and the PLL of the D-PHY. */
    __IOM uint32_t PHY_IF_CFG;                    /*!< 0x000000A4 Configures the number of active lanes and the minimum time to
                                                                remain in stop state. */
    __IOM uint32_t PHY_ULPS_CTRL;                 /*!< 0x000000A8 Configures entering and leaving ULPS in the D-PHY. */
    __IOM uint32_t PHY_TX_TRIGGERS;               /*!< 0x000000AC Configures the pins that activate triggers in the D-PHY. */
    __IM uint32_t PHY_STATUS;                    /*!< 0x000000B0 Contains information about the status of the D-PHY. */
    __IOM uint32_t PHY_TST_CTRL0;                 /*!< 0x000000B4 Controls clock and clear pins of the D-PHY vendor specific
                                                                interface. */
    __IOM uint32_t PHY_TST_CTRL1;                 /*!< 0x000000B8 Controls data and enable pins of the D-PHY vendor specific
                                                                interface. */
    __IM uint32_t INT_ST0;                       /*!< 0x000000BC Contains the status of interrupt sources from acknowledge
                                                                reports and the D-PHY. */
    __IM uint32_t INT_ST1;                       /*!< 0x000000C0 Contains the status of interrupt sources related to timeouts,
                                                                ECC, CRC, packet size, EoTp, Generic and DBI interfaces. */
    __IOM uint32_t INT_MSK0;                      /*!< 0x000000C4 Configures masks for the sources of interrupts that affect the
                                                                INT_ST0 register. Write 1 to un-mask each error report. */
    __IOM uint32_t INT_MSK1;                      /*!< 0x000000C8 Configures masks for the sources of interrupts that affect the
                                                                INT_ST1 register. */
    __IOM uint32_t PHY_CAL;                       /*!< 0x000000CC Controls the skew calibration of D-PHY. */
    __IM uint32_t RESERVED1[2];
    __IOM uint32_t INT_FORCE0;                    /*!< 0x000000D8 Forces interrupt that affect the INT_ST0 register. */
    __IOM uint32_t INT_FORCE1;                    /*!< 0x000000DC Forces interrupts that affect the INT_ST1 register. */
    __IM uint32_t RESERVED2[4];
    __IOM uint32_t DSC_PARAMETER;                 /*!< 0x000000F0 Configures Display Stream Compression. */
    __IOM uint32_t PHY_TMR_RD_CFG;                /*!< 0x000000F4 Configures times related to PHY to perform some operations in
                                                                lane byte clock cycles. */
    __IM uint32_t RESERVED3[2];
    __IOM uint32_t VID_SHADOW_CTRL;               /*!< 0x00000100 Controls dpi shadow feature */
    __IM uint32_t RESERVED4[2];
    __IM uint32_t DPI_VCID_ACT;                  /*!< 0x0000010C Holds the value that controller is using for DPI_VCID. */
    __IM uint32_t DPI_COLOR_CODING_ACT;          /*!< 0x00000110 Holds the value that controller is using for DPI_COLOR_CODING. */
    __IM uint32_t RESERVED5;
    __IM uint32_t DPI_LP_CMD_TIM_ACT;            /*!< 0x00000118 Holds the value that controller is using for DPI_LP_CMD_TIM. */
    __IM uint32_t RESERVED6[7];
    __IM uint32_t VID_MODE_CFG_ACT;              /*!< 0x00000138 Holds the value that controller is using for VID_MODE_CFG. */
    __IM uint32_t VID_PKT_SIZE_ACT;              /*!< 0x0000013C Holds the value that controller is using for VID_PKT_SIZE. */
    __IM uint32_t VID_NUM_CHUNKS_ACT;            /*!< 0x00000140 This register holds the value that controller is using for
                                                                VID_NUM_CHUNKS. */
    __IM uint32_t VID_NULL_SIZE_ACT;             /*!< 0x00000144 Holds the value that controller is using for VID_NULL_SIZE. */
    __IM uint32_t VID_HSA_TIME_ACT;              /*!< 0x00000148 Holds the value that controller is using for VID_HSA_TIME. */
    __IM uint32_t VID_HBP_TIME_ACT;              /*!< 0x0000014C Holds the value that controller is using for VID_HBP_TIME. */
    __IM uint32_t VID_HLINE_TIME_ACT;            /*!< 0x00000150 Holds the value that controller is using for VID_HLINE_TIME. */
    __IM uint32_t VID_VSA_LINES_ACT;             /*!< 0x00000154 Holds the value that controller is using for VID_VSA_LINES. */
    __IM uint32_t VID_VBP_LINES_ACT;             /*!< 0x00000158 Holds the value that controller is using for VID_VBP_LINES. */
    __IM uint32_t VID_VFP_LINES_ACT;             /*!< 0x0000015C Holds the value that controller is using for VID_VFP_LINES. */
    __IM uint32_t VID_VACTIVE_LINES_ACT;         /*!< 0x00000160 Holds the value that controller is using for VID_VACTIVE_LINES. */
    __IM uint32_t RESERVED7;
    __IM uint32_t VID_PKT_STATUS;                /*!< 0x00000168 Contains information about the status of FIFOs related to DPI
                                                                and eDPI interfaces. */
    __IM uint32_t RESERVED8[9];
    __IM uint32_t SDF_3D_ACT;                    /*!< 0x00000190 Holds the value that controller is using for SDF_3D. */
    __IM uint32_t RESERVED9[923];
} GFXSS_MIPIDSI_DWCMIPIDSI_Type;                /*!< Size = 4096 (0x1000) */

/**
  * \brief MIPI-DSI Host Controller. (GFXSS_MIPIDSI)
  */
typedef struct
{
    GFXSS_MIPIDSI_MXMIPIDSI_Type MXMIPIDSI; /*!< 0x00000000 Platform IP standard configuration for MIPI-DSI. */
    GFXSS_MIPIDSI_DWCMIPIDSI_Type DWCMIPIDSI; /*!< 0x00001000 DSI Registers */
} GFXSS_MIPIDSI_Type;                           /*!< Size = 8192 (0x2000) */

/**
  * \brief GFXSS
  */
typedef struct
{
    GFXSS_GPU_Type GFXSS_GPU;               /*!< 0x00000000 Graphics Processing Unit. */
    GFXSS_DC_Type GFXSS_DC;                 /*!< 0x00001000 Display Controller. */
    GFXSS_MIPIDSI_Type GFXSS_MIPIDSI;       /*!< 0x00002000 MIPI-DSI Host Controller. */
} GFXSS_Type;                                   /*!< Size = 16384 (0x4000) */


