PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_gfxss.h
/* GFXSS_GPU_MXGPU.CTL */
#define GFXSS_GPU_MXGPU_CTL_ENABLED_Pos         31UL
#define GFXSS_GPU_MXGPU_CTL_ENABLED_Msk         0x80000000UL
/* GFXSS_GPU_MXGPU.STATUS */
#define GFXSS_GPU_MXGPU_STATUS_CORE_RST_Pos     0UL
#define GFXSS_GPU_MXGPU_STATUS_CORE_RST_Msk     0x1UL
/* GFXSS_GPU_MXGPU.INTR */
#define GFXSS_GPU_MXGPU_INTR_CORE_Pos           0UL
#define GFXSS_GPU_MXGPU_INTR_CORE_Msk           0x1UL
/* GFXSS_GPU_MXGPU.INTR_SET */
#define GFXSS_GPU_MXGPU_INTR_SET_CORE_SET_Pos   0UL
#define GFXSS_GPU_MXGPU_INTR_SET_CORE_SET_Msk   0x1UL
/* GFXSS_GPU_MXGPU.INTR_MASK */
#define GFXSS_GPU_MXGPU_INTR_MASK_CORE_MASK_Pos 0UL
#define GFXSS_GPU_MXGPU_INTR_MASK_CORE_MASK_Msk 0x1UL
/* GFXSS_GPU_MXGPU.INTR_MASKED */
#define GFXSS_GPU_MXGPU_INTR_MASKED_CORE_MASKED_Pos 0UL
#define GFXSS_GPU_MXGPU_INTR_MASKED_CORE_MASKED_Msk 0x1UL


/* GFXSS_GPU_GCNANO.AQHICLOCKCONTROL */
#define GFXSS_GPU_GCNANO_AQHICLOCKCONTROL_AQHICLOCKCONTROL_RESERVED_1_Pos 0UL
#define GFXSS_GPU_GCNANO_AQHICLOCKCONTROL_AQHICLOCKCONTROL_RESERVED_1_Msk 0x1UL
#define GFXSS_GPU_GCNANO_AQHICLOCKCONTROL_AQHICLOCKCONTROL_CLK2D_DIS_Pos 1UL
#define GFXSS_GPU_GCNANO_AQHICLOCKCONTROL_AQHICLOCKCONTROL_CLK2D_DIS_Msk 0x2UL
#define GFXSS_GPU_GCNANO_AQHICLOCKCONTROL_AQHICLOCKCONTROL_FSCALE_VAL_Pos 2UL
#define GFXSS_GPU_GCNANO_AQHICLOCKCONTROL_AQHICLOCKCONTROL_FSCALE_VAL_Msk 0x1FCUL
#define GFXSS_GPU_GCNANO_AQHICLOCKCONTROL_AQHICLOCKCONTROL_FSCALE_CMD_LOAD_Pos 9UL
#define GFXSS_GPU_GCNANO_AQHICLOCKCONTROL_AQHICLOCKCONTROL_FSCALE_CMD_LOAD_Msk 0x200UL
#define GFXSS_GPU_GCNANO_AQHICLOCKCONTROL_AQHICLOCKCONTROL_DISABLE_RAM_CLOCK_GATING_Pos 10UL
#define GFXSS_GPU_GCNANO_AQHICLOCKCONTROL_AQHICLOCKCONTROL_DISABLE_RAM_CLOCK_GATING_Msk 0x400UL
#define GFXSS_GPU_GCNANO_AQHICLOCKCONTROL_AQHICLOCKCONTROL_DISABLE_DEBUG_REGISTERS_Pos 11UL
#define GFXSS_GPU_GCNANO_AQHICLOCKCONTROL_AQHICLOCKCONTROL_DISABLE_DEBUG_REGISTERS_Msk 0x800UL
#define GFXSS_GPU_GCNANO_AQHICLOCKCONTROL_AQHICLOCKCONTROL_SOFT_RESET_Pos 12UL
#define GFXSS_GPU_GCNANO_AQHICLOCKCONTROL_AQHICLOCKCONTROL_SOFT_RESET_Msk 0x1000UL
#define GFXSS_GPU_GCNANO_AQHICLOCKCONTROL_AQHICLOCKCONTROL_DISABLE_RAM_POWER_OPTIMIZATION_Pos 13UL
#define GFXSS_GPU_GCNANO_AQHICLOCKCONTROL_AQHICLOCKCONTROL_DISABLE_RAM_POWER_OPTIMIZATION_Msk 0x2000UL
#define GFXSS_GPU_GCNANO_AQHICLOCKCONTROL_AQHICLOCKCONTROL_RESERVED_2_Pos 14UL
#define GFXSS_GPU_GCNANO_AQHICLOCKCONTROL_AQHICLOCKCONTROL_RESERVED_2_Msk 0x4000UL
#define GFXSS_GPU_GCNANO_AQHICLOCKCONTROL_AQHICLOCKCONTROL_RESERVED_3_Pos 15UL
#define GFXSS_GPU_GCNANO_AQHICLOCKCONTROL_AQHICLOCKCONTROL_RESERVED_3_Msk 0x8000UL
#define GFXSS_GPU_GCNANO_AQHICLOCKCONTROL_AQHICLOCKCONTROL_IDLE3_D_Pos 16UL
#define GFXSS_GPU_GCNANO_AQHICLOCKCONTROL_AQHICLOCKCONTROL_IDLE3_D_Msk 0x10000UL
#define GFXSS_GPU_GCNANO_AQHICLOCKCONTROL_AQHICLOCKCONTROL_IDLE2_D_Pos 17UL
#define GFXSS_GPU_GCNANO_AQHICLOCKCONTROL_AQHICLOCKCONTROL_IDLE2_D_Msk 0x20000UL
#define GFXSS_GPU_GCNANO_AQHICLOCKCONTROL_AQHICLOCKCONTROL_IDLE_VG_Pos 18UL
#define GFXSS_GPU_GCNANO_AQHICLOCKCONTROL_AQHICLOCKCONTROL_IDLE_VG_Msk 0x40000UL
#define GFXSS_GPU_GCNANO_AQHICLOCKCONTROL_AQHICLOCKCONTROL_ISOLATE_GPU_Pos 19UL
#define GFXSS_GPU_GCNANO_AQHICLOCKCONTROL_AQHICLOCKCONTROL_ISOLATE_GPU_Msk 0x80000UL
#define GFXSS_GPU_GCNANO_AQHICLOCKCONTROL_AQHICLOCKCONTROL_RESERVED_4_Pos 20UL
#define GFXSS_GPU_GCNANO_AQHICLOCKCONTROL_AQHICLOCKCONTROL_RESERVED_4_Msk 0x1FF00000UL
#define GFXSS_GPU_GCNANO_AQHICLOCKCONTROL_AQHICLOCKCONTROL_RESERVED_5_Pos 29UL
#define GFXSS_GPU_GCNANO_AQHICLOCKCONTROL_AQHICLOCKCONTROL_RESERVED_5_Msk 0xE0000000UL
/* GFXSS_GPU_GCNANO.AQHIIDLE */
#define GFXSS_GPU_GCNANO_AQHIIDLE_AQHIIDLE_IDLE_FE_Pos 0UL
#define GFXSS_GPU_GCNANO_AQHIIDLE_AQHIIDLE_IDLE_FE_Msk 0x1UL
#define GFXSS_GPU_GCNANO_AQHIIDLE_AQHIIDLE_IDLE_DE_Pos 1UL
#define GFXSS_GPU_GCNANO_AQHIIDLE_AQHIIDLE_IDLE_DE_Msk 0x2UL
#define GFXSS_GPU_GCNANO_AQHIIDLE_AQHIIDLE_IDLE_PE_Pos 2UL
#define GFXSS_GPU_GCNANO_AQHIIDLE_AQHIIDLE_IDLE_PE_Msk 0x4UL
#define GFXSS_GPU_GCNANO_AQHIIDLE_AQHIIDLE_IDLE_SH_Pos 3UL
#define GFXSS_GPU_GCNANO_AQHIIDLE_AQHIIDLE_IDLE_SH_Msk 0x8UL
#define GFXSS_GPU_GCNANO_AQHIIDLE_AQHIIDLE_IDLE_PA_Pos 4UL
#define GFXSS_GPU_GCNANO_AQHIIDLE_AQHIIDLE_IDLE_PA_Msk 0x10UL
#define GFXSS_GPU_GCNANO_AQHIIDLE_AQHIIDLE_IDLE_SE_Pos 5UL
#define GFXSS_GPU_GCNANO_AQHIIDLE_AQHIIDLE_IDLE_SE_Msk 0x20UL
#define GFXSS_GPU_GCNANO_AQHIIDLE_AQHIIDLE_IDLE_RA_Pos 6UL
#define GFXSS_GPU_GCNANO_AQHIIDLE_AQHIIDLE_IDLE_RA_Msk 0x40UL
#define GFXSS_GPU_GCNANO_AQHIIDLE_AQHIIDLE_IDLE_TX_Pos 7UL
#define GFXSS_GPU_GCNANO_AQHIIDLE_AQHIIDLE_IDLE_TX_Msk 0x80UL
#define GFXSS_GPU_GCNANO_AQHIIDLE_AQHIIDLE_IDLE_VG_Pos 8UL
#define GFXSS_GPU_GCNANO_AQHIIDLE_AQHIIDLE_IDLE_VG_Msk 0x100UL
#define GFXSS_GPU_GCNANO_AQHIIDLE_AQHIIDLE_IDLE_IM_Pos 9UL
#define GFXSS_GPU_GCNANO_AQHIIDLE_AQHIIDLE_IDLE_IM_Msk 0x200UL
#define GFXSS_GPU_GCNANO_AQHIIDLE_AQHIIDLE_IDLE_FP_Pos 10UL
#define GFXSS_GPU_GCNANO_AQHIIDLE_AQHIIDLE_IDLE_FP_Msk 0x400UL
#define GFXSS_GPU_GCNANO_AQHIIDLE_AQHIIDLE_IDLE_TS_Pos 11UL
#define GFXSS_GPU_GCNANO_AQHIIDLE_AQHIIDLE_IDLE_TS_Msk 0x800UL
#define GFXSS_GPU_GCNANO_AQHIIDLE_AQHIIDLE_IDLE_BLT_Pos 12UL
#define GFXSS_GPU_GCNANO_AQHIIDLE_AQHIIDLE_IDLE_BLT_Msk 0x1000UL
#define GFXSS_GPU_GCNANO_AQHIIDLE_AQHIIDLE_UNUSED_Pos 13UL
#define GFXSS_GPU_GCNANO_AQHIIDLE_AQHIIDLE_UNUSED_Msk 0x7FFFE000UL
#define GFXSS_GPU_GCNANO_AQHIIDLE_AQHIIDLE_AXI_LP_Pos 31UL
#define GFXSS_GPU_GCNANO_AQHIIDLE_AQHIIDLE_AXI_LP_Msk 0x80000000UL
/* GFXSS_GPU_GCNANO.AQAXICONFIG */
#define GFXSS_GPU_GCNANO_AQAXICONFIG_AQAXICONFIG_RESERVED_1_Pos 0UL
#define GFXSS_GPU_GCNANO_AQAXICONFIG_AQAXICONFIG_RESERVED_1_Msk 0xFFUL
#define GFXSS_GPU_GCNANO_AQAXICONFIG_AQAXICONFIG_AWCACHE_Pos 8UL
#define GFXSS_GPU_GCNANO_AQAXICONFIG_AQAXICONFIG_AWCACHE_Msk 0xF00UL
#define GFXSS_GPU_GCNANO_AQAXICONFIG_AQAXICONFIG_ARCACHE_Pos 12UL
#define GFXSS_GPU_GCNANO_AQAXICONFIG_AQAXICONFIG_ARCACHE_Msk 0xF000UL
#define GFXSS_GPU_GCNANO_AQAXICONFIG_AQAXICONFIG_AXDOMAIN_SHARED_Pos 16UL
#define GFXSS_GPU_GCNANO_AQAXICONFIG_AQAXICONFIG_AXDOMAIN_SHARED_Msk 0x30000UL
#define GFXSS_GPU_GCNANO_AQAXICONFIG_AQAXICONFIG_AXDOMAIN_NON_SHARED_Pos 18UL
#define GFXSS_GPU_GCNANO_AQAXICONFIG_AQAXICONFIG_AXDOMAIN_NON_SHARED_Msk 0xC0000UL
#define GFXSS_GPU_GCNANO_AQAXICONFIG_AQAXICONFIG_AXCACHE_OVERRIDE_SHARED_Pos 20UL
#define GFXSS_GPU_GCNANO_AQAXICONFIG_AQAXICONFIG_AXCACHE_OVERRIDE_SHARED_Msk 0xF00000UL
#define GFXSS_GPU_GCNANO_AQAXICONFIG_AQAXICONFIG_RESERVED_2_Pos 24UL
#define GFXSS_GPU_GCNANO_AQAXICONFIG_AQAXICONFIG_RESERVED_2_Msk 0xFF000000UL
/* GFXSS_GPU_GCNANO.AQAXISTATUS */
#define GFXSS_GPU_GCNANO_AQAXISTATUS_AQAXISTATUS_WR_ERR_ID_Pos 0UL
#define GFXSS_GPU_GCNANO_AQAXISTATUS_AQAXISTATUS_WR_ERR_ID_Msk 0xFUL
#define GFXSS_GPU_GCNANO_AQAXISTATUS_AQAXISTATUS_RD_ERR_ID_Pos 4UL
#define GFXSS_GPU_GCNANO_AQAXISTATUS_AQAXISTATUS_RD_ERR_ID_Msk 0xF0UL
#define GFXSS_GPU_GCNANO_AQAXISTATUS_AQAXISTATUS_DET_WR_ERR_Pos 8UL
#define GFXSS_GPU_GCNANO_AQAXISTATUS_AQAXISTATUS_DET_WR_ERR_Msk 0x100UL
#define GFXSS_GPU_GCNANO_AQAXISTATUS_AQAXISTATUS_DET_RD_ERR_Pos 9UL
#define GFXSS_GPU_GCNANO_AQAXISTATUS_AQAXISTATUS_DET_RD_ERR_Msk 0x200UL
#define GFXSS_GPU_GCNANO_AQAXISTATUS_AQAXISTATUS_RESERVED_Pos 10UL
#define GFXSS_GPU_GCNANO_AQAXISTATUS_AQAXISTATUS_RESERVED_Msk 0xFFFFFC00UL
/* GFXSS_GPU_GCNANO.AQINTRACKNOWLEDGE */
#define GFXSS_GPU_GCNANO_AQINTRACKNOWLEDGE_AQINTRACKNOWLEDGE_INTR_VEC_Pos 0UL
#define GFXSS_GPU_GCNANO_AQINTRACKNOWLEDGE_AQINTRACKNOWLEDGE_INTR_VEC_Msk 0xFFFFFFFFUL
/* GFXSS_GPU_GCNANO.AQINTRENBL */
#define GFXSS_GPU_GCNANO_AQINTRENBL_AQINTRENBL_INTR_ENBL_VEC_Pos 0UL
#define GFXSS_GPU_GCNANO_AQINTRENBL_AQINTRENBL_INTR_ENBL_VEC_Msk 0xFFFFFFFFUL
/* GFXSS_GPU_GCNANO.GCCHIPREV */
#define GFXSS_GPU_GCNANO_GCCHIPREV_GCCHIPREV_REV_Pos 0UL
#define GFXSS_GPU_GCNANO_GCCHIPREV_GCCHIPREV_REV_Msk 0xFFFFFFFFUL
/* GFXSS_GPU_GCNANO.GCCHIPDATE */
#define GFXSS_GPU_GCNANO_GCCHIPDATE_GCCHIPDATE_DATE_Pos 0UL
#define GFXSS_GPU_GCNANO_GCCHIPDATE_GCCHIPDATE_DATE_Msk 0xFFFFFFFFUL
/* GFXSS_GPU_GCNANO.GCREGHICHIPPATCHREV */
#define GFXSS_GPU_GCNANO_GCREGHICHIPPATCHREV_GCREGHICHIPPATCHREV_PATCH_REV_Pos 0UL
#define GFXSS_GPU_GCNANO_GCREGHICHIPPATCHREV_GCREGHICHIPPATCHREV_PATCH_REV_Msk 0xFFUL
#define GFXSS_GPU_GCNANO_GCREGHICHIPPATCHREV_GCREGHICHIPPATCHREV_RESERVED_Pos 8UL
#define GFXSS_GPU_GCNANO_GCREGHICHIPPATCHREV_GCREGHICHIPPATCHREV_RESERVED_Msk 0xFFFFFF00UL
/* GFXSS_GPU_GCNANO.GCPRODUCTID */
#define GFXSS_GPU_GCNANO_GCPRODUCTID_GCPRODUCTID_GRADE_LEVEL_Pos 0UL
#define GFXSS_GPU_GCNANO_GCPRODUCTID_GCPRODUCTID_GRADE_LEVEL_Msk 0xFUL
#define GFXSS_GPU_GCNANO_GCPRODUCTID_GCPRODUCTID_NUM_Pos 4UL
#define GFXSS_GPU_GCNANO_GCPRODUCTID_GCPRODUCTID_NUM_Msk 0xFFFFF0UL
#define GFXSS_GPU_GCNANO_GCPRODUCTID_GCPRODUCTID_TYPE_Pos 24UL
#define GFXSS_GPU_GCNANO_GCPRODUCTID_GCPRODUCTID_TYPE_Msk 0xF000000UL
#define GFXSS_GPU_GCNANO_GCPRODUCTID_GCPRODUCTID_RESERVED_Pos 28UL
#define GFXSS_GPU_GCNANO_GCPRODUCTID_GCPRODUCTID_RESERVED_Msk 0xF0000000UL
/* GFXSS_GPU_GCNANO.GCMODULEPOWERCONTROLS */
#define GFXSS_GPU_GCNANO_GCMODULEPOWERCONTROLS_GCMODULEPOWERCONTROLS_ENABLE_MODULE_CLOCK_GATING_Pos 0UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERCONTROLS_GCMODULEPOWERCONTROLS_ENABLE_MODULE_CLOCK_GATING_Msk 0x1UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERCONTROLS_GCMODULEPOWERCONTROLS_DISABLE_STALL_MODULE_CLOCK_GATING_Pos 1UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERCONTROLS_GCMODULEPOWERCONTROLS_DISABLE_STALL_MODULE_CLOCK_GATING_Msk 0x2UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERCONTROLS_GCMODULEPOWERCONTROLS_DISABLE_STARVE_MODULE_CLOCK_GATING_Pos 2UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERCONTROLS_GCMODULEPOWERCONTROLS_DISABLE_STARVE_MODULE_CLOCK_GATING_Msk 0x4UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERCONTROLS_GCMODULEPOWERCONTROLS_RESERVED_1_Pos 3UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERCONTROLS_GCMODULEPOWERCONTROLS_RESERVED_1_Msk 0x8UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERCONTROLS_GCMODULEPOWERCONTROLS_TURN_ON_COUNTER_Pos 4UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERCONTROLS_GCMODULEPOWERCONTROLS_TURN_ON_COUNTER_Msk 0xF0UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERCONTROLS_GCMODULEPOWERCONTROLS_RESERVED_2_Pos 8UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERCONTROLS_GCMODULEPOWERCONTROLS_RESERVED_2_Msk 0xFF00UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERCONTROLS_GCMODULEPOWERCONTROLS_TURN_OFF_COUNTER_Pos 16UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERCONTROLS_GCMODULEPOWERCONTROLS_TURN_OFF_COUNTER_Msk 0xFFFF0000UL
/* GFXSS_GPU_GCNANO.GCMODULEPOWERMODULECONTROL */
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULECONTROL_GCMODULEPOWERMODULECONTROL_DISABLE_MODULE_CLOCK_GATING_FE_Pos 0UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULECONTROL_GCMODULEPOWERMODULECONTROL_DISABLE_MODULE_CLOCK_GATING_FE_Msk 0x1UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULECONTROL_GCMODULEPOWERMODULECONTROL_RESERVED_1_Pos 1UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULECONTROL_GCMODULEPOWERMODULECONTROL_RESERVED_1_Msk 0x2UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULECONTROL_GCMODULEPOWERMODULECONTROL_DISABLE_MODULE_CLOCK_GATING_PE_Pos 2UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULECONTROL_GCMODULEPOWERMODULECONTROL_DISABLE_MODULE_CLOCK_GATING_PE_Msk 0x4UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULECONTROL_GCMODULEPOWERMODULECONTROL_RESERVED_2_Pos 3UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULECONTROL_GCMODULEPOWERMODULECONTROL_RESERVED_2_Msk 0xF8UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULECONTROL_GCMODULEPOWERMODULECONTROL_DISABLE_MODULE_CLOCK_GATING_VG_Pos 8UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULECONTROL_GCMODULEPOWERMODULECONTROL_DISABLE_MODULE_CLOCK_GATING_VG_Msk 0x100UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULECONTROL_GCMODULEPOWERMODULECONTROL_DISABLE_MODULE_CLOCK_GATING_IM_Pos 9UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULECONTROL_GCMODULEPOWERMODULECONTROL_DISABLE_MODULE_CLOCK_GATING_IM_Msk 0x200UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULECONTROL_GCMODULEPOWERMODULECONTROL_RESERVED_3_Pos 10UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULECONTROL_GCMODULEPOWERMODULECONTROL_RESERVED_3_Msk 0x400UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULECONTROL_GCMODULEPOWERMODULECONTROL_DISABLE_MODULE_CLOCK_GATING_TS_Pos 11UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULECONTROL_GCMODULEPOWERMODULECONTROL_DISABLE_MODULE_CLOCK_GATING_TS_Msk 0x800UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULECONTROL_GCMODULEPOWERMODULECONTROL_DISABLE_MODULE_CLOCK_GATING_FLEXA_Pos 12UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULECONTROL_GCMODULEPOWERMODULECONTROL_DISABLE_MODULE_CLOCK_GATING_FLEXA_Msk 0x1000UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULECONTROL_GCMODULEPOWERMODULECONTROL_RESERVED_4_Pos 13UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULECONTROL_GCMODULEPOWERMODULECONTROL_RESERVED_4_Msk 0xFFFFE000UL
/* GFXSS_GPU_GCNANO.GCMODULEPOWERMODULESTATUS */
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULESTATUS_GCMODULEPOWERMODULESTATUS_MODULE_CLOCK_GATED_FE_Pos 0UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULESTATUS_GCMODULEPOWERMODULESTATUS_MODULE_CLOCK_GATED_FE_Msk 0x1UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULESTATUS_GCMODULEPOWERMODULESTATUS_RESERVED_1_Pos 1UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULESTATUS_GCMODULEPOWERMODULESTATUS_RESERVED_1_Msk 0x2UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULESTATUS_GCMODULEPOWERMODULESTATUS_MODULE_CLOCK_GATED_PE_Pos 2UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULESTATUS_GCMODULEPOWERMODULESTATUS_MODULE_CLOCK_GATED_PE_Msk 0x4UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULESTATUS_GCMODULEPOWERMODULESTATUS_RESERVED_2_Pos 3UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULESTATUS_GCMODULEPOWERMODULESTATUS_RESERVED_2_Msk 0xF8UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULESTATUS_GCMODULEPOWERMODULESTATUS_MODULE_CLOCK_GATED_VG_Pos 8UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULESTATUS_GCMODULEPOWERMODULESTATUS_MODULE_CLOCK_GATED_VG_Msk 0x100UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULESTATUS_GCMODULEPOWERMODULESTATUS_MODULE_CLOCK_GATED_IM_Pos 9UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULESTATUS_GCMODULEPOWERMODULESTATUS_MODULE_CLOCK_GATED_IM_Msk 0x200UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULESTATUS_GCMODULEPOWERMODULESTATUS_MODULE_CLOCK_GATED_TS_Pos 11UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULESTATUS_GCMODULEPOWERMODULESTATUS_MODULE_CLOCK_GATED_TS_Msk 0x800UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULESTATUS_GCMODULEPOWERMODULESTATUS_MODULE_CLOCK_GATED_FLEXA_Pos 12UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULESTATUS_GCMODULEPOWERMODULESTATUS_MODULE_CLOCK_GATED_FLEXA_Msk 0x1000UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULESTATUS_GCMODULEPOWERMODULESTATUS_RESERVED_3_Pos 13UL
#define GFXSS_GPU_GCNANO_GCMODULEPOWERMODULESTATUS_GCMODULEPOWERMODULESTATUS_RESERVED_3_Msk 0xFFFFE000UL
/* GFXSS_GPU_GCNANO.AQMEMORYDEBUG */
#define GFXSS_GPU_GCNANO_AQMEMORYDEBUG_AQMEMORYDEBUG_MAX_OUTSTANDING_READS_Pos 0UL
#define GFXSS_GPU_GCNANO_AQMEMORYDEBUG_AQMEMORYDEBUG_MAX_OUTSTANDING_READS_Msk 0xFFUL
#define GFXSS_GPU_GCNANO_AQMEMORYDEBUG_AQMEMORYDEBUG_RESERVED_1_Pos 8UL
#define GFXSS_GPU_GCNANO_AQMEMORYDEBUG_AQMEMORYDEBUG_RESERVED_1_Msk 0xFF00UL
#define GFXSS_GPU_GCNANO_AQMEMORYDEBUG_AQMEMORYDEBUG_RESERVED_2_Pos 16UL
#define GFXSS_GPU_GCNANO_AQMEMORYDEBUG_AQMEMORYDEBUG_RESERVED_2_Msk 0x10000UL
#define GFXSS_GPU_GCNANO_AQMEMORYDEBUG_AQMEMORYDEBUG_RESERVED_3_Pos 17UL
#define GFXSS_GPU_GCNANO_AQMEMORYDEBUG_AQMEMORYDEBUG_RESERVED_3_Msk 0x60000UL
#define GFXSS_GPU_GCNANO_AQMEMORYDEBUG_AQMEMORYDEBUG_RESERVED_4_Pos 19UL
#define GFXSS_GPU_GCNANO_AQMEMORYDEBUG_AQMEMORYDEBUG_RESERVED_4_Msk 0xF80000UL
#define GFXSS_GPU_GCNANO_AQMEMORYDEBUG_AQMEMORYDEBUG_RESERVED_5_Pos 24UL
#define GFXSS_GPU_GCNANO_AQMEMORYDEBUG_AQMEMORYDEBUG_RESERVED_5_Msk 0xFF000000UL
/* GFXSS_GPU_GCNANO.AQREGISTERTIMINGCONTROL */
#define GFXSS_GPU_GCNANO_AQREGISTERTIMINGCONTROL_AQREGISTERTIMINGCONTROL_FOR_RF1P_Pos 0UL
#define GFXSS_GPU_GCNANO_AQREGISTERTIMINGCONTROL_AQREGISTERTIMINGCONTROL_FOR_RF1P_Msk 0xFFUL
#define GFXSS_GPU_GCNANO_AQREGISTERTIMINGCONTROL_AQREGISTERTIMINGCONTROL_FOR_RF2P_Pos 8UL
#define GFXSS_GPU_GCNANO_AQREGISTERTIMINGCONTROL_AQREGISTERTIMINGCONTROL_FOR_RF2P_Msk 0xFF00UL
#define GFXSS_GPU_GCNANO_AQREGISTERTIMINGCONTROL_AQREGISTERTIMINGCONTROL_FAST_RTC_Pos 16UL
#define GFXSS_GPU_GCNANO_AQREGISTERTIMINGCONTROL_AQREGISTERTIMINGCONTROL_FAST_RTC_Msk 0x30000UL
#define GFXSS_GPU_GCNANO_AQREGISTERTIMINGCONTROL_AQREGISTERTIMINGCONTROL_FAST_WTC_Pos 18UL
#define GFXSS_GPU_GCNANO_AQREGISTERTIMINGCONTROL_AQREGISTERTIMINGCONTROL_FAST_WTC_Msk 0xC0000UL
#define GFXSS_GPU_GCNANO_AQREGISTERTIMINGCONTROL_AQREGISTERTIMINGCONTROL_POWER_DOWN_Pos 20UL
#define GFXSS_GPU_GCNANO_AQREGISTERTIMINGCONTROL_AQREGISTERTIMINGCONTROL_POWER_DOWN_Msk 0x100000UL
#define GFXSS_GPU_GCNANO_AQREGISTERTIMINGCONTROL_AQREGISTERTIMINGCONTROL_RESERVED_Pos 21UL
#define GFXSS_GPU_GCNANO_AQREGISTERTIMINGCONTROL_AQREGISTERTIMINGCONTROL_RESERVED_Msk 0xFFE00000UL
/* GFXSS_GPU_GCNANO.GCREGFETCHADDRESS */
#define GFXSS_GPU_GCNANO_GCREGFETCHADDRESS_GCREGFETCHADDRESS_TYPE_Pos 0UL
#define GFXSS_GPU_GCNANO_GCREGFETCHADDRESS_GCREGFETCHADDRESS_TYPE_Msk 0x3UL
#define GFXSS_GPU_GCNANO_GCREGFETCHADDRESS_GCREGFETCHADDRESS_ADDRESS_Pos 2UL
#define GFXSS_GPU_GCNANO_GCREGFETCHADDRESS_GCREGFETCHADDRESS_ADDRESS_Msk 0xFFFFFFFCUL
/* GFXSS_GPU_GCNANO.GCREGFETCHCONTROL */
#define GFXSS_GPU_GCNANO_GCREGFETCHCONTROL_GCREGFETCHCONTROL_COUNT_Pos 0UL
#define GFXSS_GPU_GCNANO_GCREGFETCHCONTROL_GCREGFETCHCONTROL_COUNT_Msk 0x1FFFFFUL
#define GFXSS_GPU_GCNANO_GCREGFETCHCONTROL_GCREGFETCHCONTROL_RESERVED_Pos 21UL
#define GFXSS_GPU_GCNANO_GCREGFETCHCONTROL_GCREGFETCHCONTROL_RESERVED_Msk 0xFFE00000UL
/* GFXSS_GPU_GCNANO.GCREGCURRENTFETCHADDRESS */
#define GFXSS_GPU_GCNANO_GCREGCURRENTFETCHADDRESS_GCREGCURRENTFETCHADDRESS_ADDRESS_Pos 0UL
#define GFXSS_GPU_GCNANO_GCREGCURRENTFETCHADDRESS_GCREGCURRENTFETCHADDRESS_ADDRESS_Msk 0xFFFFFFFFUL


