PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_gfxss.h
/* GFXSS_DC_MXDC.CTL */
#define GFXSS_DC_MXDC_CTL_ENABLED_Pos           31UL
#define GFXSS_DC_MXDC_CTL_ENABLED_Msk           0x80000000UL
/* GFXSS_DC_MXDC.CLK_CTL */
#define GFXSS_DC_MXDC_CLK_CTL_CLK_CORE_Pos      0UL
#define GFXSS_DC_MXDC_CLK_CTL_CLK_CORE_Msk      0x1UL
#define GFXSS_DC_MXDC_CLK_CTL_CLK_DIV_Pos       6UL
#define GFXSS_DC_MXDC_CLK_CTL_CLK_DIV_Msk       0xFFFFFFC0UL
/* GFXSS_DC_MXDC.IO_CTL */
#define GFXSS_DC_MXDC_IO_CTL_SPI_ENABLED_Pos    0UL
#define GFXSS_DC_MXDC_IO_CTL_SPI_ENABLED_Msk    0x1UL
#define GFXSS_DC_MXDC_IO_CTL_SPI_SDOEN_Pos      1UL
#define GFXSS_DC_MXDC_IO_CTL_SPI_SDOEN_Msk      0x2UL
#define GFXSS_DC_MXDC_IO_CTL_DPI_ENABLED_Pos    8UL
#define GFXSS_DC_MXDC_IO_CTL_DPI_ENABLED_Msk    0x100UL
#define GFXSS_DC_MXDC_IO_CTL_DBI_ENABLED_Pos    16UL
#define GFXSS_DC_MXDC_IO_CTL_DBI_ENABLED_Msk    0x10000UL
/* GFXSS_DC_MXDC.STATUS */
#define GFXSS_DC_MXDC_STATUS_CORE_RST_Pos       0UL
#define GFXSS_DC_MXDC_STATUS_CORE_RST_Msk       0x1UL
/* GFXSS_DC_MXDC.INTR */
#define GFXSS_DC_MXDC_INTR_CORE_Pos             0UL
#define GFXSS_DC_MXDC_INTR_CORE_Msk             0x1UL
#define GFXSS_DC_MXDC_INTR_ADDR0_Pos            8UL
#define GFXSS_DC_MXDC_INTR_ADDR0_Msk            0x100UL
#define GFXSS_DC_MXDC_INTR_ADDR1_Pos            9UL
#define GFXSS_DC_MXDC_INTR_ADDR1_Msk            0x200UL
#define GFXSS_DC_MXDC_INTR_ADDR2_Pos            10UL
#define GFXSS_DC_MXDC_INTR_ADDR2_Msk            0x400UL
#define GFXSS_DC_MXDC_INTR_ADDR3_Pos            11UL
#define GFXSS_DC_MXDC_INTR_ADDR3_Msk            0x800UL
#define GFXSS_DC_MXDC_INTR_RLAD_ERROR_Pos       16UL
#define GFXSS_DC_MXDC_INTR_RLAD_ERROR_Msk       0x10000UL
/* GFXSS_DC_MXDC.INTR_SET */
#define GFXSS_DC_MXDC_INTR_SET_CORE_SET_Pos     0UL
#define GFXSS_DC_MXDC_INTR_SET_CORE_SET_Msk     0x1UL
#define GFXSS_DC_MXDC_INTR_SET_ADDR0_SET_Pos    8UL
#define GFXSS_DC_MXDC_INTR_SET_ADDR0_SET_Msk    0x100UL
#define GFXSS_DC_MXDC_INTR_SET_ADDR1_SET_Pos    9UL
#define GFXSS_DC_MXDC_INTR_SET_ADDR1_SET_Msk    0x200UL
#define GFXSS_DC_MXDC_INTR_SET_ADDR2_SET_Pos    10UL
#define GFXSS_DC_MXDC_INTR_SET_ADDR2_SET_Msk    0x400UL
#define GFXSS_DC_MXDC_INTR_SET_ADDR3_SET_Pos    11UL
#define GFXSS_DC_MXDC_INTR_SET_ADDR3_SET_Msk    0x800UL
#define GFXSS_DC_MXDC_INTR_SET_RLAD_ERROR_SET_Pos 16UL
#define GFXSS_DC_MXDC_INTR_SET_RLAD_ERROR_SET_Msk 0x10000UL
/* GFXSS_DC_MXDC.INTR_MASK */
#define GFXSS_DC_MXDC_INTR_MASK_CORE_MASK_Pos   0UL
#define GFXSS_DC_MXDC_INTR_MASK_CORE_MASK_Msk   0x1UL
#define GFXSS_DC_MXDC_INTR_MASK_ADDR0_MASK_Pos  8UL
#define GFXSS_DC_MXDC_INTR_MASK_ADDR0_MASK_Msk  0x100UL
#define GFXSS_DC_MXDC_INTR_MASK_ADDR1_MASK_Pos  9UL
#define GFXSS_DC_MXDC_INTR_MASK_ADDR1_MASK_Msk  0x200UL
#define GFXSS_DC_MXDC_INTR_MASK_ADDR2_MASK_Pos  10UL
#define GFXSS_DC_MXDC_INTR_MASK_ADDR2_MASK_Msk  0x400UL
#define GFXSS_DC_MXDC_INTR_MASK_ADDR3_MASK_Pos  11UL
#define GFXSS_DC_MXDC_INTR_MASK_ADDR3_MASK_Msk  0x800UL
#define GFXSS_DC_MXDC_INTR_MASK_RLAD_ERROR_MASK_Pos 16UL
#define GFXSS_DC_MXDC_INTR_MASK_RLAD_ERROR_MASK_Msk 0x10000UL
/* GFXSS_DC_MXDC.INTR_MASKED */
#define GFXSS_DC_MXDC_INTR_MASKED_CORE_MASKED_Pos 0UL
#define GFXSS_DC_MXDC_INTR_MASKED_CORE_MASKED_Msk 0x1UL
#define GFXSS_DC_MXDC_INTR_MASKED_ADDR0_MASKED_Pos 8UL
#define GFXSS_DC_MXDC_INTR_MASKED_ADDR0_MASKED_Msk 0x100UL
#define GFXSS_DC_MXDC_INTR_MASKED_ADDR1_MASKED_Pos 9UL
#define GFXSS_DC_MXDC_INTR_MASKED_ADDR1_MASKED_Msk 0x200UL
#define GFXSS_DC_MXDC_INTR_MASKED_ADDR2_MASKED_Pos 10UL
#define GFXSS_DC_MXDC_INTR_MASKED_ADDR2_MASKED_Msk 0x400UL
#define GFXSS_DC_MXDC_INTR_MASKED_ADDR3_MASKED_Pos 11UL
#define GFXSS_DC_MXDC_INTR_MASKED_ADDR3_MASKED_Msk 0x800UL
#define GFXSS_DC_MXDC_INTR_MASKED_RLAD_ERROR_MASKED_Pos 16UL
#define GFXSS_DC_MXDC_INTR_MASKED_RLAD_ERROR_MASKED_Msk 0x10000UL
/* GFXSS_DC_MXDC.ADDR0_INT */
#define GFXSS_DC_MXDC_ADDR0_INT_ADDR0_INT_Pos   0UL
#define GFXSS_DC_MXDC_ADDR0_INT_ADDR0_INT_Msk   0xFFFFFFFFUL
/* GFXSS_DC_MXDC.ADDR1_INT */
#define GFXSS_DC_MXDC_ADDR1_INT_ADDR1_INT_Pos   0UL
#define GFXSS_DC_MXDC_ADDR1_INT_ADDR1_INT_Msk   0xFFFFFFFFUL
/* GFXSS_DC_MXDC.ADDR2_INT */
#define GFXSS_DC_MXDC_ADDR2_INT_ADDR2_INT_Pos   0UL
#define GFXSS_DC_MXDC_ADDR2_INT_ADDR2_INT_Msk   0xFFFFFFFFUL
/* GFXSS_DC_MXDC.ADDR3_INT */
#define GFXSS_DC_MXDC_ADDR3_INT_ADDR3_INT_Pos   0UL
#define GFXSS_DC_MXDC_ADDR3_INT_ADDR3_INT_Msk   0xFFFFFFFFUL
/* GFXSS_DC_MXDC.RLAD_CTL */
#define GFXSS_DC_MXDC_RLAD_CTL_RLAD_ENABLE_Pos  0UL
#define GFXSS_DC_MXDC_RLAD_CTL_RLAD_ENABLE_Msk  0x1UL
#define GFXSS_DC_MXDC_RLAD_CTL_RLAD_LAYER_Pos   8UL
#define GFXSS_DC_MXDC_RLAD_CTL_RLAD_LAYER_Msk   0x300UL
/* GFXSS_DC_MXDC.RLAD_IMG */
#define GFXSS_DC_MXDC_RLAD_IMG_RLAD_WIDTH_Pos   0UL
#define GFXSS_DC_MXDC_RLAD_IMG_RLAD_WIDTH_Msk   0xFFFUL
#define GFXSS_DC_MXDC_RLAD_IMG_RLAD_HEIGHT_Pos  14UL
#define GFXSS_DC_MXDC_RLAD_IMG_RLAD_HEIGHT_Msk  0x3FFC000UL
#define GFXSS_DC_MXDC_RLAD_IMG_RLAD_FORMAT_Pos  28UL
#define GFXSS_DC_MXDC_RLAD_IMG_RLAD_FORMAT_Msk  0xF0000000UL
/* GFXSS_DC_MXDC.RLAD_ENC */
#define GFXSS_DC_MXDC_RLAD_ENC_RLAD_MODE_Pos    0UL
#define GFXSS_DC_MXDC_RLAD_ENC_RLAD_MODE_Msk    0x3UL
#define GFXSS_DC_MXDC_RLAD_ENC_RLAD_BITS_R_Pos  16UL
#define GFXSS_DC_MXDC_RLAD_ENC_RLAD_BITS_R_Msk  0xF0000UL
#define GFXSS_DC_MXDC_RLAD_ENC_RLAD_BITS_G_Pos  20UL
#define GFXSS_DC_MXDC_RLAD_ENC_RLAD_BITS_G_Msk  0xF00000UL
#define GFXSS_DC_MXDC_RLAD_ENC_RLAD_BITS_B_Pos  24UL
#define GFXSS_DC_MXDC_RLAD_ENC_RLAD_BITS_B_Msk  0xF000000UL
#define GFXSS_DC_MXDC_RLAD_ENC_RLAD_BITS_A_Pos  28UL
#define GFXSS_DC_MXDC_RLAD_ENC_RLAD_BITS_A_Msk  0xF0000000UL
/* GFXSS_DC_MXDC.RLAD_BUF0 */
#define GFXSS_DC_MXDC_RLAD_BUF0_RLAD_ADDRESS_Pos 7UL
#define GFXSS_DC_MXDC_RLAD_BUF0_RLAD_ADDRESS_Msk 0xFFFFFF80UL
/* GFXSS_DC_MXDC.RLAD_BUF1 */
#define GFXSS_DC_MXDC_RLAD_BUF1_RLAD_SIZE_Pos   0UL
#define GFXSS_DC_MXDC_RLAD_BUF1_RLAD_SIZE_Msk   0x1FFFFFFFUL
/* GFXSS_DC_MXDC.RLAD_STATUS */
#define GFXSS_DC_MXDC_RLAD_STATUS_RLAD_FAILED_Pos 0UL
#define GFXSS_DC_MXDC_RLAD_STATUS_RLAD_FAILED_Msk 0x7UL
/* GFXSS_DC_MXDC.IPIDENTIFIER */
#define GFXSS_DC_MXDC_IPIDENTIFIER_IPPLATFORM_Pos 0UL
#define GFXSS_DC_MXDC_IPIDENTIFIER_IPPLATFORM_Msk 0x1UL
#define GFXSS_DC_MXDC_IPIDENTIFIER_IPNAME_Pos   4UL
#define GFXSS_DC_MXDC_IPIDENTIFIER_IPNAME_Msk   0x30UL
#define GFXSS_DC_MXDC_IPIDENTIFIER_IPVERMAJOR_Pos 8UL
#define GFXSS_DC_MXDC_IPIDENTIFIER_IPVERMAJOR_Msk 0xF00UL
#define GFXSS_DC_MXDC_IPIDENTIFIER_IPVERMINOR_Pos 12UL
#define GFXSS_DC_MXDC_IPIDENTIFIER_IPVERMINOR_Msk 0xF000UL
#define GFXSS_DC_MXDC_IPIDENTIFIER_IPMATURITY_Pos 16UL
#define GFXSS_DC_MXDC_IPIDENTIFIER_IPMATURITY_Msk 0x30000UL
#define GFXSS_DC_MXDC_IPIDENTIFIER_IPRELEASE_Pos 20UL
#define GFXSS_DC_MXDC_IPIDENTIFIER_IPRELEASE_Msk 0xFF00000UL
#define GFXSS_DC_MXDC_IPIDENTIFIER_IPIMPLEMENTATION_Pos 28UL
#define GFXSS_DC_MXDC_IPIDENTIFIER_IPIMPLEMENTATION_Msk 0x10000000UL


