PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_gfxss.h
/* GFXSS_DC_DCNANO.GCREGDCCHIPREV */
#define GFXSS_DC_DCNANO_GCREGDCCHIPREV_GCREGDCCHIPREV_REV_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDCCHIPREV_GCREGDCCHIPREV_REV_Msk 0xFFFFFFFFUL
/* GFXSS_DC_DCNANO.GCREGDCCHIPDATE */
#define GFXSS_DC_DCNANO_GCREGDCCHIPDATE_GCREGDCCHIPDATE_DATE_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDCCHIPDATE_GCREGDCCHIPDATE_DATE_Msk 0xFFFFFFFFUL
/* GFXSS_DC_DCNANO.GCREGDCCHIPPATCHREV */
#define GFXSS_DC_DCNANO_GCREGDCCHIPPATCHREV_GCREGDCCHIPPATCHREV_PATCH_REV_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDCCHIPPATCHREV_GCREGDCCHIPPATCHREV_PATCH_REV_Msk 0xFFFFFFFFUL
/* GFXSS_DC_DCNANO.GCREGDCPRODUCTID */
#define GFXSS_DC_DCNANO_GCREGDCPRODUCTID_GCREGDCPRODUCTID_PRODUCT_ID_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDCPRODUCTID_GCREGDCPRODUCTID_PRODUCT_ID_Msk 0xFFFFFFFFUL
/* GFXSS_DC_DCNANO.GCREGFRAMEBUFFERCONFIG */
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCONFIG_GCREGFRAMEBUFFERCONFIG_FORMAT_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCONFIG_GCREGFRAMEBUFFERCONFIG_FORMAT_Msk 0x7UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCONFIG_GCREGFRAMEBUFFERCONFIG_ENABLE_Pos 3UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCONFIG_GCREGFRAMEBUFFERCONFIG_ENABLE_Msk 0x8UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCONFIG_GCREGFRAMEBUFFERCONFIG_CLEAR_EN_Pos 5UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCONFIG_GCREGFRAMEBUFFERCONFIG_CLEAR_EN_Msk 0x20UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCONFIG_GCREGFRAMEBUFFERCONFIG_COLOR_KEY_EN_Pos 10UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCONFIG_GCREGFRAMEBUFFERCONFIG_COLOR_KEY_EN_Msk 0x400UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCONFIG_GCREGFRAMEBUFFERCONFIG_SWIZZLE_Pos 17UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCONFIG_GCREGFRAMEBUFFERCONFIG_SWIZZLE_Msk 0x60000UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCONFIG_GCREGFRAMEBUFFERCONFIG_UV_SWIZZLE_Pos 19UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCONFIG_GCREGFRAMEBUFFERCONFIG_UV_SWIZZLE_Msk 0x80000UL
/* GFXSS_DC_DCNANO.GCREGFRAMEBUFFERADDRESS */
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERADDRESS_GCREGFRAMEBUFFERADDRESS_ADDRESS_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERADDRESS_GCREGFRAMEBUFFERADDRESS_ADDRESS_Msk 0xFFFFFFFFUL
/* GFXSS_DC_DCNANO.GCREGFRAMEBUFFERSTRIDE */
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERSTRIDE_GCREGFRAMEBUFFERSTRIDE_STRIDE_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERSTRIDE_GCREGFRAMEBUFFERSTRIDE_STRIDE_Msk 0x1FFFFUL
/* GFXSS_DC_DCNANO.GCREGDCTILEINCFG */
#define GFXSS_DC_DCNANO_GCREGDCTILEINCFG_GCREGDCTILEINCFG_TILE_FORMAT_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDCTILEINCFG_GCREGDCTILEINCFG_TILE_FORMAT_Msk 0x3UL
#define GFXSS_DC_DCNANO_GCREGDCTILEINCFG_GCREGDCTILEINCFG_YUV_STANDARD_Pos 2UL
#define GFXSS_DC_DCNANO_GCREGDCTILEINCFG_GCREGDCTILEINCFG_YUV_STANDARD_Msk 0x4UL
/* GFXSS_DC_DCNANO.GCREGDCTILEUVFRAMEBUFFERADR */
#define GFXSS_DC_DCNANO_GCREGDCTILEUVFRAMEBUFFERADR_GCREGDCTILEUVFRAMEBUFFERADR_ADDRESS_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDCTILEUVFRAMEBUFFERADR_GCREGDCTILEUVFRAMEBUFFERADR_ADDRESS_Msk 0xFFFFFFFFUL
/* GFXSS_DC_DCNANO.GCREGDCTILEUVFRAMEBUFFERSTR */
#define GFXSS_DC_DCNANO_GCREGDCTILEUVFRAMEBUFFERSTR_GCREGDCTILEUVFRAMEBUFFERSTR_STRIDE_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDCTILEUVFRAMEBUFFERSTR_GCREGDCTILEUVFRAMEBUFFERSTR_STRIDE_Msk 0xFFFFUL
/* GFXSS_DC_DCNANO.GCREGFRAMEBUFFERBACKGROUND */
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERBACKGROUND_GCREGFRAMEBUFFERBACKGROUND_BLUE_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERBACKGROUND_GCREGFRAMEBUFFERBACKGROUND_BLUE_Msk 0xFFUL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERBACKGROUND_GCREGFRAMEBUFFERBACKGROUND_GREEN_Pos 8UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERBACKGROUND_GCREGFRAMEBUFFERBACKGROUND_GREEN_Msk 0xFF00UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERBACKGROUND_GCREGFRAMEBUFFERBACKGROUND_RED_Pos 16UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERBACKGROUND_GCREGFRAMEBUFFERBACKGROUND_RED_Msk 0xFF0000UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERBACKGROUND_GCREGFRAMEBUFFERBACKGROUND_ALPHA_Pos 24UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERBACKGROUND_GCREGFRAMEBUFFERBACKGROUND_ALPHA_Msk 0xFF000000UL
/* GFXSS_DC_DCNANO.GCREGFRAMEBUFFERCOLORKEY */
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCOLORKEY_GCREGFRAMEBUFFERCOLORKEY_BLUE_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCOLORKEY_GCREGFRAMEBUFFERCOLORKEY_BLUE_Msk 0xFFUL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCOLORKEY_GCREGFRAMEBUFFERCOLORKEY_GREEN_Pos 8UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCOLORKEY_GCREGFRAMEBUFFERCOLORKEY_GREEN_Msk 0xFF00UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCOLORKEY_GCREGFRAMEBUFFERCOLORKEY_RED_Pos 16UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCOLORKEY_GCREGFRAMEBUFFERCOLORKEY_RED_Msk 0xFF0000UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCOLORKEY_GCREGFRAMEBUFFERCOLORKEY_ALPHA_Pos 24UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCOLORKEY_GCREGFRAMEBUFFERCOLORKEY_ALPHA_Msk 0xFF000000UL
/* GFXSS_DC_DCNANO.GCREGFRAMEBUFFERCOLORKEYHIGH */
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCOLORKEYHIGH_GCREGFRAMEBUFFERCOLORKEYHIGH_BLUE_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCOLORKEYHIGH_GCREGFRAMEBUFFERCOLORKEYHIGH_BLUE_Msk 0xFFUL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCOLORKEYHIGH_GCREGFRAMEBUFFERCOLORKEYHIGH_GREEN_Pos 8UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCOLORKEYHIGH_GCREGFRAMEBUFFERCOLORKEYHIGH_GREEN_Msk 0xFF00UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCOLORKEYHIGH_GCREGFRAMEBUFFERCOLORKEYHIGH_RED_Pos 16UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCOLORKEYHIGH_GCREGFRAMEBUFFERCOLORKEYHIGH_RED_Msk 0xFF0000UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCOLORKEYHIGH_GCREGFRAMEBUFFERCOLORKEYHIGH_ALPHA_Pos 24UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCOLORKEYHIGH_GCREGFRAMEBUFFERCOLORKEYHIGH_ALPHA_Msk 0xFF000000UL
/* GFXSS_DC_DCNANO.GCREGFRAMEBUFFERCLEARVALUE */
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCLEARVALUE_GCREGFRAMEBUFFERCLEARVALUE_BLUE_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCLEARVALUE_GCREGFRAMEBUFFERCLEARVALUE_BLUE_Msk 0xFFUL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCLEARVALUE_GCREGFRAMEBUFFERCLEARVALUE_GREEN_Pos 8UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCLEARVALUE_GCREGFRAMEBUFFERCLEARVALUE_GREEN_Msk 0xFF00UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCLEARVALUE_GCREGFRAMEBUFFERCLEARVALUE_RED_Pos 16UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCLEARVALUE_GCREGFRAMEBUFFERCLEARVALUE_RED_Msk 0xFF0000UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCLEARVALUE_GCREGFRAMEBUFFERCLEARVALUE_ALPHA_Pos 24UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCLEARVALUE_GCREGFRAMEBUFFERCLEARVALUE_ALPHA_Msk 0xFF000000UL
/* GFXSS_DC_DCNANO.GCREGVIDEOTL */
#define GFXSS_DC_DCNANO_GCREGVIDEOTL_GCREGVIDEOTL_X_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGVIDEOTL_GCREGVIDEOTL_X_Msk 0xFFFUL
#define GFXSS_DC_DCNANO_GCREGVIDEOTL_GCREGVIDEOTL_Y_Pos 16UL
#define GFXSS_DC_DCNANO_GCREGVIDEOTL_GCREGVIDEOTL_Y_Msk 0xFFF0000UL
/* GFXSS_DC_DCNANO.GCREGFRAMEBUFFERSIZE */
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERSIZE_GCREGFRAMEBUFFERSIZE_WIDTH_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERSIZE_GCREGFRAMEBUFFERSIZE_WIDTH_Msk 0xFFFUL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERSIZE_GCREGFRAMEBUFFERSIZE_HEIGHT_Pos 16UL
#define GFXSS_DC_DCNANO_GCREGFRAMEBUFFERSIZE_GCREGFRAMEBUFFERSIZE_HEIGHT_Msk 0xFFF0000UL
/* GFXSS_DC_DCNANO.GCREGVIDEOGLOBALALPHA */
#define GFXSS_DC_DCNANO_GCREGVIDEOGLOBALALPHA_GCREGVIDEOGLOBALALPHA_SRC_ALPHA_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGVIDEOGLOBALALPHA_GCREGVIDEOGLOBALALPHA_SRC_ALPHA_Msk 0xFFUL
#define GFXSS_DC_DCNANO_GCREGVIDEOGLOBALALPHA_GCREGVIDEOGLOBALALPHA_DST_ALPHA_Pos 8UL
#define GFXSS_DC_DCNANO_GCREGVIDEOGLOBALALPHA_GCREGVIDEOGLOBALALPHA_DST_ALPHA_Msk 0xFF00UL
/* GFXSS_DC_DCNANO.GCREGBLENDSTACKORDER */
#define GFXSS_DC_DCNANO_GCREGBLENDSTACKORDER_GCREGBLENDSTACKORDER_ORDER_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGBLENDSTACKORDER_GCREGBLENDSTACKORDER_ORDER_Msk 0x7UL
/* GFXSS_DC_DCNANO.GCREGVIDEOALPHABLENDCONFIG */
#define GFXSS_DC_DCNANO_GCREGVIDEOALPHABLENDCONFIG_GCREGVIDEOALPHABLENDCONFIG_ALPHA_BLEND_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGVIDEOALPHABLENDCONFIG_GCREGVIDEOALPHABLENDCONFIG_ALPHA_BLEND_Msk 0x1UL
#define GFXSS_DC_DCNANO_GCREGVIDEOALPHABLENDCONFIG_GCREGVIDEOALPHABLENDCONFIG_SRC_ALPHA_MODE_Pos 1UL
#define GFXSS_DC_DCNANO_GCREGVIDEOALPHABLENDCONFIG_GCREGVIDEOALPHABLENDCONFIG_SRC_ALPHA_MODE_Msk 0x2UL
#define GFXSS_DC_DCNANO_GCREGVIDEOALPHABLENDCONFIG_GCREGVIDEOALPHABLENDCONFIG_SRC_GLOBAL_ALPHA_MODE_Pos 3UL
#define GFXSS_DC_DCNANO_GCREGVIDEOALPHABLENDCONFIG_GCREGVIDEOALPHABLENDCONFIG_SRC_GLOBAL_ALPHA_MODE_Msk 0x18UL
#define GFXSS_DC_DCNANO_GCREGVIDEOALPHABLENDCONFIG_GCREGVIDEOALPHABLENDCONFIG_SRC_BLENDING_MODE_Pos 6UL
#define GFXSS_DC_DCNANO_GCREGVIDEOALPHABLENDCONFIG_GCREGVIDEOALPHABLENDCONFIG_SRC_BLENDING_MODE_Msk 0xC0UL
#define GFXSS_DC_DCNANO_GCREGVIDEOALPHABLENDCONFIG_GCREGVIDEOALPHABLENDCONFIG_SRC_ALPHA_FACTOR_Pos 8UL
#define GFXSS_DC_DCNANO_GCREGVIDEOALPHABLENDCONFIG_GCREGVIDEOALPHABLENDCONFIG_SRC_ALPHA_FACTOR_Msk 0x100UL
#define GFXSS_DC_DCNANO_GCREGVIDEOALPHABLENDCONFIG_GCREGVIDEOALPHABLENDCONFIG_DST_ALPHA_MODE_Pos 9UL
#define GFXSS_DC_DCNANO_GCREGVIDEOALPHABLENDCONFIG_GCREGVIDEOALPHABLENDCONFIG_DST_ALPHA_MODE_Msk 0x200UL
#define GFXSS_DC_DCNANO_GCREGVIDEOALPHABLENDCONFIG_GCREGVIDEOALPHABLENDCONFIG_DST_GLOBAL_ALPHA_MODE_Pos 10UL
#define GFXSS_DC_DCNANO_GCREGVIDEOALPHABLENDCONFIG_GCREGVIDEOALPHABLENDCONFIG_DST_GLOBAL_ALPHA_MODE_Msk 0xC00UL
#define GFXSS_DC_DCNANO_GCREGVIDEOALPHABLENDCONFIG_GCREGVIDEOALPHABLENDCONFIG_DST_BLENDING_MODE_Pos 13UL
#define GFXSS_DC_DCNANO_GCREGVIDEOALPHABLENDCONFIG_GCREGVIDEOALPHABLENDCONFIG_DST_BLENDING_MODE_Msk 0x6000UL
#define GFXSS_DC_DCNANO_GCREGVIDEOALPHABLENDCONFIG_GCREGVIDEOALPHABLENDCONFIG_DST_ALPHA_FACTOR_Pos 15UL
#define GFXSS_DC_DCNANO_GCREGVIDEOALPHABLENDCONFIG_GCREGVIDEOALPHABLENDCONFIG_DST_ALPHA_FACTOR_Msk 0x8000UL
/* GFXSS_DC_DCNANO.GCREGOVERLAYCONFIG */
#define GFXSS_DC_DCNANO_GCREGOVERLAYCONFIG_GCREGOVERLAYCONFIG_FORMAT_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCONFIG_GCREGOVERLAYCONFIG_FORMAT_Msk 0x7UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCONFIG_GCREGOVERLAYCONFIG_ENABLE_Pos 3UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCONFIG_GCREGOVERLAYCONFIG_ENABLE_Msk 0x8UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCONFIG_GCREGOVERLAYCONFIG_CLEAR_EN_Pos 5UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCONFIG_GCREGOVERLAYCONFIG_CLEAR_EN_Msk 0x20UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCONFIG_GCREGOVERLAYCONFIG_SWIZZLE_Pos 17UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCONFIG_GCREGOVERLAYCONFIG_SWIZZLE_Msk 0x60000UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCONFIG_GCREGOVERLAYCONFIG_UV_SWIZZLE_Pos 19UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCONFIG_GCREGOVERLAYCONFIG_UV_SWIZZLE_Msk 0x80000UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCONFIG_GCREGOVERLAYCONFIG_COLOR_KEY_EN_Pos 20UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCONFIG_GCREGOVERLAYCONFIG_COLOR_KEY_EN_Msk 0x100000UL
/* GFXSS_DC_DCNANO.GCREGOVERLAYADDRESS */
#define GFXSS_DC_DCNANO_GCREGOVERLAYADDRESS_GCREGOVERLAYADDRESS_ADDRESS_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYADDRESS_GCREGOVERLAYADDRESS_ADDRESS_Msk 0xFFFFFFFFUL
/* GFXSS_DC_DCNANO.GCREGOVERLAYSTRIDE */
#define GFXSS_DC_DCNANO_GCREGOVERLAYSTRIDE_GCREGOVERLAYSTRIDE_STRIDE_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYSTRIDE_GCREGOVERLAYSTRIDE_STRIDE_Msk 0x1FFFFUL
/* GFXSS_DC_DCNANO.GCREGDCOVERLAYTILEINCFG */
#define GFXSS_DC_DCNANO_GCREGDCOVERLAYTILEINCFG_GCREGDCOVERLAYTILEINCFG_TILE_FORMAT_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDCOVERLAYTILEINCFG_GCREGDCOVERLAYTILEINCFG_TILE_FORMAT_Msk 0x3UL
#define GFXSS_DC_DCNANO_GCREGDCOVERLAYTILEINCFG_GCREGDCOVERLAYTILEINCFG_YUV_STANDARD_Pos 2UL
#define GFXSS_DC_DCNANO_GCREGDCOVERLAYTILEINCFG_GCREGDCOVERLAYTILEINCFG_YUV_STANDARD_Msk 0x4UL
/* GFXSS_DC_DCNANO.GCREGDCTILEUVOVERLAYADR */
#define GFXSS_DC_DCNANO_GCREGDCTILEUVOVERLAYADR_GCREGDCTILEUVOVERLAYADR_ADDRESS_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDCTILEUVOVERLAYADR_GCREGDCTILEUVOVERLAYADR_ADDRESS_Msk 0xFFFFFFFFUL
/* GFXSS_DC_DCNANO.GCREGDCTILEUVOVERLAYSTR */
#define GFXSS_DC_DCNANO_GCREGDCTILEUVOVERLAYSTR_GCREGDCTILEUVOVERLAYSTR_STRIDE_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDCTILEUVOVERLAYSTR_GCREGDCTILEUVOVERLAYSTR_STRIDE_Msk 0xFFFFUL
/* GFXSS_DC_DCNANO.GCREGOVERLAYTL */
#define GFXSS_DC_DCNANO_GCREGOVERLAYTL_GCREGOVERLAYTL_X_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYTL_GCREGOVERLAYTL_X_Msk 0xFFFUL
#define GFXSS_DC_DCNANO_GCREGOVERLAYTL_GCREGOVERLAYTL_Y_Pos 16UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYTL_GCREGOVERLAYTL_Y_Msk 0xFFF0000UL
/* GFXSS_DC_DCNANO.GCREGOVERLAYSIZE */
#define GFXSS_DC_DCNANO_GCREGOVERLAYSIZE_GCREGOVERLAYSIZE_WIDTH_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYSIZE_GCREGOVERLAYSIZE_WIDTH_Msk 0xFFFUL
#define GFXSS_DC_DCNANO_GCREGOVERLAYSIZE_GCREGOVERLAYSIZE_HEIGHT_Pos 16UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYSIZE_GCREGOVERLAYSIZE_HEIGHT_Msk 0xFFF0000UL
/* GFXSS_DC_DCNANO.GCREGOVERLAYCOLORKEY */
#define GFXSS_DC_DCNANO_GCREGOVERLAYCOLORKEY_GCREGOVERLAYCOLORKEY_BLUE_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCOLORKEY_GCREGOVERLAYCOLORKEY_BLUE_Msk 0xFFUL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCOLORKEY_GCREGOVERLAYCOLORKEY_GREEN_Pos 8UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCOLORKEY_GCREGOVERLAYCOLORKEY_GREEN_Msk 0xFF00UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCOLORKEY_GCREGOVERLAYCOLORKEY_RED_Pos 16UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCOLORKEY_GCREGOVERLAYCOLORKEY_RED_Msk 0xFF0000UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCOLORKEY_GCREGOVERLAYCOLORKEY_ALPHA_Pos 24UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCOLORKEY_GCREGOVERLAYCOLORKEY_ALPHA_Msk 0xFF000000UL
/* GFXSS_DC_DCNANO.GCREGOVERLAYCOLORKEYHIGH */
#define GFXSS_DC_DCNANO_GCREGOVERLAYCOLORKEYHIGH_GCREGOVERLAYCOLORKEYHIGH_BLUE_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCOLORKEYHIGH_GCREGOVERLAYCOLORKEYHIGH_BLUE_Msk 0xFFUL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCOLORKEYHIGH_GCREGOVERLAYCOLORKEYHIGH_GREEN_Pos 8UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCOLORKEYHIGH_GCREGOVERLAYCOLORKEYHIGH_GREEN_Msk 0xFF00UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCOLORKEYHIGH_GCREGOVERLAYCOLORKEYHIGH_RED_Pos 16UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCOLORKEYHIGH_GCREGOVERLAYCOLORKEYHIGH_RED_Msk 0xFF0000UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCOLORKEYHIGH_GCREGOVERLAYCOLORKEYHIGH_ALPHA_Pos 24UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCOLORKEYHIGH_GCREGOVERLAYCOLORKEYHIGH_ALPHA_Msk 0xFF000000UL
/* GFXSS_DC_DCNANO.GCREGOVERLAYALPHABLENDCONFIG */
#define GFXSS_DC_DCNANO_GCREGOVERLAYALPHABLENDCONFIG_GCREGOVERLAYALPHABLENDCONFIG_ALPHA_BLEND_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYALPHABLENDCONFIG_GCREGOVERLAYALPHABLENDCONFIG_ALPHA_BLEND_Msk 0x1UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYALPHABLENDCONFIG_GCREGOVERLAYALPHABLENDCONFIG_SRC_ALPHA_MODE_Pos 1UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYALPHABLENDCONFIG_GCREGOVERLAYALPHABLENDCONFIG_SRC_ALPHA_MODE_Msk 0x2UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYALPHABLENDCONFIG_GCREGOVERLAYALPHABLENDCONFIG_SRC_GLOBAL_ALPHA_MODE_Pos 3UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYALPHABLENDCONFIG_GCREGOVERLAYALPHABLENDCONFIG_SRC_GLOBAL_ALPHA_MODE_Msk 0x18UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYALPHABLENDCONFIG_GCREGOVERLAYALPHABLENDCONFIG_SRC_BLENDING_MODE_Pos 6UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYALPHABLENDCONFIG_GCREGOVERLAYALPHABLENDCONFIG_SRC_BLENDING_MODE_Msk 0xC0UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYALPHABLENDCONFIG_GCREGOVERLAYALPHABLENDCONFIG_SRC_ALPHA_FACTOR_Pos 8UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYALPHABLENDCONFIG_GCREGOVERLAYALPHABLENDCONFIG_SRC_ALPHA_FACTOR_Msk 0x100UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYALPHABLENDCONFIG_GCREGOVERLAYALPHABLENDCONFIG_DST_ALPHA_MODE_Pos 9UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYALPHABLENDCONFIG_GCREGOVERLAYALPHABLENDCONFIG_DST_ALPHA_MODE_Msk 0x200UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYALPHABLENDCONFIG_GCREGOVERLAYALPHABLENDCONFIG_DST_GLOBAL_ALPHA_MODE_Pos 10UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYALPHABLENDCONFIG_GCREGOVERLAYALPHABLENDCONFIG_DST_GLOBAL_ALPHA_MODE_Msk 0xC00UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYALPHABLENDCONFIG_GCREGOVERLAYALPHABLENDCONFIG_DST_BLENDING_MODE_Pos 13UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYALPHABLENDCONFIG_GCREGOVERLAYALPHABLENDCONFIG_DST_BLENDING_MODE_Msk 0x6000UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYALPHABLENDCONFIG_GCREGOVERLAYALPHABLENDCONFIG_DST_ALPHA_FACTOR_Pos 15UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYALPHABLENDCONFIG_GCREGOVERLAYALPHABLENDCONFIG_DST_ALPHA_FACTOR_Msk 0x8000UL
/* GFXSS_DC_DCNANO.GCREGOVERLAYGLOBALALPHA */
#define GFXSS_DC_DCNANO_GCREGOVERLAYGLOBALALPHA_GCREGOVERLAYGLOBALALPHA_SRC_ALPHA_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYGLOBALALPHA_GCREGOVERLAYGLOBALALPHA_SRC_ALPHA_Msk 0xFFUL
#define GFXSS_DC_DCNANO_GCREGOVERLAYGLOBALALPHA_GCREGOVERLAYGLOBALALPHA_DST_ALPHA_Pos 8UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYGLOBALALPHA_GCREGOVERLAYGLOBALALPHA_DST_ALPHA_Msk 0xFF00UL
/* GFXSS_DC_DCNANO.GCREGOVERLAYCLEARVALUE */
#define GFXSS_DC_DCNANO_GCREGOVERLAYCLEARVALUE_GCREGOVERLAYCLEARVALUE_BLUE_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCLEARVALUE_GCREGOVERLAYCLEARVALUE_BLUE_Msk 0xFFUL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCLEARVALUE_GCREGOVERLAYCLEARVALUE_GREEN_Pos 8UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCLEARVALUE_GCREGOVERLAYCLEARVALUE_GREEN_Msk 0xFF00UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCLEARVALUE_GCREGOVERLAYCLEARVALUE_RED_Pos 16UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCLEARVALUE_GCREGOVERLAYCLEARVALUE_RED_Msk 0xFF0000UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCLEARVALUE_GCREGOVERLAYCLEARVALUE_ALPHA_Pos 24UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCLEARVALUE_GCREGOVERLAYCLEARVALUE_ALPHA_Msk 0xFF000000UL
/* GFXSS_DC_DCNANO.GCREGOVERLAYCONFIG1 */
#define GFXSS_DC_DCNANO_GCREGOVERLAYCONFIG1_GCREGOVERLAYCONFIG1_FORMAT_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCONFIG1_GCREGOVERLAYCONFIG1_FORMAT_Msk 0x7UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCONFIG1_GCREGOVERLAYCONFIG1_ENABLE_Pos 3UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCONFIG1_GCREGOVERLAYCONFIG1_ENABLE_Msk 0x8UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCONFIG1_GCREGOVERLAYCONFIG1_CLEAR_EN_Pos 5UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCONFIG1_GCREGOVERLAYCONFIG1_CLEAR_EN_Msk 0x20UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCONFIG1_GCREGOVERLAYCONFIG1_SWIZZLE_Pos 17UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCONFIG1_GCREGOVERLAYCONFIG1_SWIZZLE_Msk 0x60000UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCONFIG1_GCREGOVERLAYCONFIG1_COLOR_KEY_EN_Pos 20UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCONFIG1_GCREGOVERLAYCONFIG1_COLOR_KEY_EN_Msk 0x100000UL
/* GFXSS_DC_DCNANO.GCREGOVERLAYADDRESS1 */
#define GFXSS_DC_DCNANO_GCREGOVERLAYADDRESS1_GCREGOVERLAYADDRESS1_ADDRESS_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYADDRESS1_GCREGOVERLAYADDRESS1_ADDRESS_Msk 0xFFFFFFFFUL
/* GFXSS_DC_DCNANO.GCREGOVERLAYSTRIDE1 */
#define GFXSS_DC_DCNANO_GCREGOVERLAYSTRIDE1_GCREGOVERLAYSTRIDE1_STRIDE_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYSTRIDE1_GCREGOVERLAYSTRIDE1_STRIDE_Msk 0x1FFFFUL
/* GFXSS_DC_DCNANO.GCREGOVERLAYTL1 */
#define GFXSS_DC_DCNANO_GCREGOVERLAYTL1_GCREGOVERLAYTL1_X_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYTL1_GCREGOVERLAYTL1_X_Msk 0xFFFUL
#define GFXSS_DC_DCNANO_GCREGOVERLAYTL1_GCREGOVERLAYTL1_Y_Pos 16UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYTL1_GCREGOVERLAYTL1_Y_Msk 0xFFF0000UL
/* GFXSS_DC_DCNANO.GCREGOVERLAYSIZE1 */
#define GFXSS_DC_DCNANO_GCREGOVERLAYSIZE1_GCREGOVERLAYSIZE1_WIDTH_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYSIZE1_GCREGOVERLAYSIZE1_WIDTH_Msk 0xFFFUL
#define GFXSS_DC_DCNANO_GCREGOVERLAYSIZE1_GCREGOVERLAYSIZE1_HEIGHT_Pos 16UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYSIZE1_GCREGOVERLAYSIZE1_HEIGHT_Msk 0xFFF0000UL
/* GFXSS_DC_DCNANO.GCREGOVERLAYCOLORKEY1 */
#define GFXSS_DC_DCNANO_GCREGOVERLAYCOLORKEY1_GCREGOVERLAYCOLORKEY1_BLUE_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCOLORKEY1_GCREGOVERLAYCOLORKEY1_BLUE_Msk 0xFFUL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCOLORKEY1_GCREGOVERLAYCOLORKEY1_GREEN_Pos 8UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCOLORKEY1_GCREGOVERLAYCOLORKEY1_GREEN_Msk 0xFF00UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCOLORKEY1_GCREGOVERLAYCOLORKEY1_RED_Pos 16UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCOLORKEY1_GCREGOVERLAYCOLORKEY1_RED_Msk 0xFF0000UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCOLORKEY1_GCREGOVERLAYCOLORKEY1_ALPHA_Pos 24UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCOLORKEY1_GCREGOVERLAYCOLORKEY1_ALPHA_Msk 0xFF000000UL
/* GFXSS_DC_DCNANO.GCREGOVERLAYCOLORKEYHIGH1 */
#define GFXSS_DC_DCNANO_GCREGOVERLAYCOLORKEYHIGH1_GCREGOVERLAYCOLORKEYHIGH1_BLUE_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCOLORKEYHIGH1_GCREGOVERLAYCOLORKEYHIGH1_BLUE_Msk 0xFFUL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCOLORKEYHIGH1_GCREGOVERLAYCOLORKEYHIGH1_GREEN_Pos 8UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCOLORKEYHIGH1_GCREGOVERLAYCOLORKEYHIGH1_GREEN_Msk 0xFF00UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCOLORKEYHIGH1_GCREGOVERLAYCOLORKEYHIGH1_RED_Pos 16UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCOLORKEYHIGH1_GCREGOVERLAYCOLORKEYHIGH1_RED_Msk 0xFF0000UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCOLORKEYHIGH1_GCREGOVERLAYCOLORKEYHIGH1_ALPHA_Pos 24UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCOLORKEYHIGH1_GCREGOVERLAYCOLORKEYHIGH1_ALPHA_Msk 0xFF000000UL
/* GFXSS_DC_DCNANO.GCREGOVERLAYALPHABLENDCONFIG1 */
#define GFXSS_DC_DCNANO_GCREGOVERLAYALPHABLENDCONFIG1_GCREGOVERLAYALPHABLENDCONFIG1_ALPHA_BLEND_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYALPHABLENDCONFIG1_GCREGOVERLAYALPHABLENDCONFIG1_ALPHA_BLEND_Msk 0x1UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYALPHABLENDCONFIG1_GCREGOVERLAYALPHABLENDCONFIG1_SRC_ALPHA_MODE_Pos 1UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYALPHABLENDCONFIG1_GCREGOVERLAYALPHABLENDCONFIG1_SRC_ALPHA_MODE_Msk 0x2UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYALPHABLENDCONFIG1_GCREGOVERLAYALPHABLENDCONFIG1_SRC_GLOBAL_ALPHA_MODE_Pos 3UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYALPHABLENDCONFIG1_GCREGOVERLAYALPHABLENDCONFIG1_SRC_GLOBAL_ALPHA_MODE_Msk 0x18UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYALPHABLENDCONFIG1_GCREGOVERLAYALPHABLENDCONFIG1_SRC_BLENDING_MODE_Pos 6UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYALPHABLENDCONFIG1_GCREGOVERLAYALPHABLENDCONFIG1_SRC_BLENDING_MODE_Msk 0xC0UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYALPHABLENDCONFIG1_GCREGOVERLAYALPHABLENDCONFIG1_SRC_ALPHA_FACTOR_Pos 8UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYALPHABLENDCONFIG1_GCREGOVERLAYALPHABLENDCONFIG1_SRC_ALPHA_FACTOR_Msk 0x100UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYALPHABLENDCONFIG1_GCREGOVERLAYALPHABLENDCONFIG1_DST_ALPHA_MODE_Pos 9UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYALPHABLENDCONFIG1_GCREGOVERLAYALPHABLENDCONFIG1_DST_ALPHA_MODE_Msk 0x200UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYALPHABLENDCONFIG1_GCREGOVERLAYALPHABLENDCONFIG1_DST_GLOBAL_ALPHA_MODE_Pos 10UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYALPHABLENDCONFIG1_GCREGOVERLAYALPHABLENDCONFIG1_DST_GLOBAL_ALPHA_MODE_Msk 0xC00UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYALPHABLENDCONFIG1_GCREGOVERLAYALPHABLENDCONFIG1_DST_BLENDING_MODE_Pos 13UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYALPHABLENDCONFIG1_GCREGOVERLAYALPHABLENDCONFIG1_DST_BLENDING_MODE_Msk 0x6000UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYALPHABLENDCONFIG1_GCREGOVERLAYALPHABLENDCONFIG1_DST_ALPHA_FACTOR_Pos 15UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYALPHABLENDCONFIG1_GCREGOVERLAYALPHABLENDCONFIG1_DST_ALPHA_FACTOR_Msk 0x8000UL
/* GFXSS_DC_DCNANO.GCREGOVERLAYGLOBALALPHA1 */
#define GFXSS_DC_DCNANO_GCREGOVERLAYGLOBALALPHA1_GCREGOVERLAYGLOBALALPHA1_SRC_ALPHA_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYGLOBALALPHA1_GCREGOVERLAYGLOBALALPHA1_SRC_ALPHA_Msk 0xFFUL
#define GFXSS_DC_DCNANO_GCREGOVERLAYGLOBALALPHA1_GCREGOVERLAYGLOBALALPHA1_DST_ALPHA_Pos 8UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYGLOBALALPHA1_GCREGOVERLAYGLOBALALPHA1_DST_ALPHA_Msk 0xFF00UL
/* GFXSS_DC_DCNANO.GCREGOVERLAYCLEARVALUE1 */
#define GFXSS_DC_DCNANO_GCREGOVERLAYCLEARVALUE1_GCREGOVERLAYCLEARVALUE1_BLUE_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCLEARVALUE1_GCREGOVERLAYCLEARVALUE1_BLUE_Msk 0xFFUL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCLEARVALUE1_GCREGOVERLAYCLEARVALUE1_GREEN_Pos 8UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCLEARVALUE1_GCREGOVERLAYCLEARVALUE1_GREEN_Msk 0xFF00UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCLEARVALUE1_GCREGOVERLAYCLEARVALUE1_RED_Pos 16UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCLEARVALUE1_GCREGOVERLAYCLEARVALUE1_RED_Msk 0xFF0000UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCLEARVALUE1_GCREGOVERLAYCLEARVALUE1_ALPHA_Pos 24UL
#define GFXSS_DC_DCNANO_GCREGOVERLAYCLEARVALUE1_GCREGOVERLAYCLEARVALUE1_ALPHA_Msk 0xFF000000UL
/* GFXSS_DC_DCNANO.GCREGDISPLAYDITHERTABLELOW */
