PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_gfxss.h
#define GFXSS_DC_DCNANO_GCREGDISPLAYDITHERTABLELOW_GCREGDISPLAYDITHERTABLELOW_Y0_X0_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYDITHERTABLELOW_GCREGDISPLAYDITHERTABLELOW_Y0_X0_Msk 0xFUL
#define GFXSS_DC_DCNANO_GCREGDISPLAYDITHERTABLELOW_GCREGDISPLAYDITHERTABLELOW_Y0_X1_Pos 4UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYDITHERTABLELOW_GCREGDISPLAYDITHERTABLELOW_Y0_X1_Msk 0xF0UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYDITHERTABLELOW_GCREGDISPLAYDITHERTABLELOW_Y0_X2_Pos 8UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYDITHERTABLELOW_GCREGDISPLAYDITHERTABLELOW_Y0_X2_Msk 0xF00UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYDITHERTABLELOW_GCREGDISPLAYDITHERTABLELOW_Y0_X3_Pos 12UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYDITHERTABLELOW_GCREGDISPLAYDITHERTABLELOW_Y0_X3_Msk 0xF000UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYDITHERTABLELOW_GCREGDISPLAYDITHERTABLELOW_Y1_X0_Pos 16UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYDITHERTABLELOW_GCREGDISPLAYDITHERTABLELOW_Y1_X0_Msk 0xF0000UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYDITHERTABLELOW_GCREGDISPLAYDITHERTABLELOW_Y1_X1_Pos 20UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYDITHERTABLELOW_GCREGDISPLAYDITHERTABLELOW_Y1_X1_Msk 0xF00000UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYDITHERTABLELOW_GCREGDISPLAYDITHERTABLELOW_Y1_X2_Pos 24UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYDITHERTABLELOW_GCREGDISPLAYDITHERTABLELOW_Y1_X2_Msk 0xF000000UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYDITHERTABLELOW_GCREGDISPLAYDITHERTABLELOW_Y1_X3_Pos 28UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYDITHERTABLELOW_GCREGDISPLAYDITHERTABLELOW_Y1_X3_Msk 0xF0000000UL
/* GFXSS_DC_DCNANO.GCREGDISPLAYDITHERTABLEHIGH */
#define GFXSS_DC_DCNANO_GCREGDISPLAYDITHERTABLEHIGH_GCREGDISPLAYDITHERTABLEHIGH_Y2_X0_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYDITHERTABLEHIGH_GCREGDISPLAYDITHERTABLEHIGH_Y2_X0_Msk 0xFUL
#define GFXSS_DC_DCNANO_GCREGDISPLAYDITHERTABLEHIGH_GCREGDISPLAYDITHERTABLEHIGH_Y2_X1_Pos 4UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYDITHERTABLEHIGH_GCREGDISPLAYDITHERTABLEHIGH_Y2_X1_Msk 0xF0UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYDITHERTABLEHIGH_GCREGDISPLAYDITHERTABLEHIGH_Y2_X2_Pos 8UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYDITHERTABLEHIGH_GCREGDISPLAYDITHERTABLEHIGH_Y2_X2_Msk 0xF00UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYDITHERTABLEHIGH_GCREGDISPLAYDITHERTABLEHIGH_Y2_X3_Pos 12UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYDITHERTABLEHIGH_GCREGDISPLAYDITHERTABLEHIGH_Y2_X3_Msk 0xF000UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYDITHERTABLEHIGH_GCREGDISPLAYDITHERTABLEHIGH_Y3_X0_Pos 16UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYDITHERTABLEHIGH_GCREGDISPLAYDITHERTABLEHIGH_Y3_X0_Msk 0xF0000UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYDITHERTABLEHIGH_GCREGDISPLAYDITHERTABLEHIGH_Y3_X1_Pos 20UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYDITHERTABLEHIGH_GCREGDISPLAYDITHERTABLEHIGH_Y3_X1_Msk 0xF00000UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYDITHERTABLEHIGH_GCREGDISPLAYDITHERTABLEHIGH_Y3_X2_Pos 24UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYDITHERTABLEHIGH_GCREGDISPLAYDITHERTABLEHIGH_Y3_X2_Msk 0xF000000UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYDITHERTABLEHIGH_GCREGDISPLAYDITHERTABLEHIGH_Y3_X3_Pos 28UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYDITHERTABLEHIGH_GCREGDISPLAYDITHERTABLEHIGH_Y3_X3_Msk 0xF0000000UL
/* GFXSS_DC_DCNANO.GCREGPANELCONFIG */
#define GFXSS_DC_DCNANO_GCREGPANELCONFIG_GCREGPANELCONFIG_DE_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGPANELCONFIG_GCREGPANELCONFIG_DE_Msk 0x1UL
#define GFXSS_DC_DCNANO_GCREGPANELCONFIG_GCREGPANELCONFIG_DE_POLARITY_Pos 1UL
#define GFXSS_DC_DCNANO_GCREGPANELCONFIG_GCREGPANELCONFIG_DE_POLARITY_Msk 0x2UL
#define GFXSS_DC_DCNANO_GCREGPANELCONFIG_GCREGPANELCONFIG_DATA_POLARITY_Pos 5UL
#define GFXSS_DC_DCNANO_GCREGPANELCONFIG_GCREGPANELCONFIG_DATA_POLARITY_Msk 0x20UL
#define GFXSS_DC_DCNANO_GCREGPANELCONFIG_GCREGPANELCONFIG_CLOCK_Pos 8UL
#define GFXSS_DC_DCNANO_GCREGPANELCONFIG_GCREGPANELCONFIG_CLOCK_Msk 0x100UL
#define GFXSS_DC_DCNANO_GCREGPANELCONFIG_GCREGPANELCONFIG_CLOCK_POLARITY_Pos 9UL
#define GFXSS_DC_DCNANO_GCREGPANELCONFIG_GCREGPANELCONFIG_CLOCK_POLARITY_Msk 0x200UL
/* GFXSS_DC_DCNANO.GCREGPANELCONTROL */
#define GFXSS_DC_DCNANO_GCREGPANELCONTROL_GCREGPANELCONTROL_VALID_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGPANELCONTROL_GCREGPANELCONTROL_VALID_Msk 0x1UL
#define GFXSS_DC_DCNANO_GCREGPANELCONTROL_GCREGPANELCONTROL_BACK_PRESSURE_DISABLE_Pos 1UL
#define GFXSS_DC_DCNANO_GCREGPANELCONTROL_GCREGPANELCONTROL_BACK_PRESSURE_DISABLE_Msk 0x2UL
/* GFXSS_DC_DCNANO.GCREGPANELFUNCTION */
#define GFXSS_DC_DCNANO_GCREGPANELFUNCTION_GCREGPANELFUNCTION_OUTPUT_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGPANELFUNCTION_GCREGPANELFUNCTION_OUTPUT_Msk 0x1UL
#define GFXSS_DC_DCNANO_GCREGPANELFUNCTION_GCREGPANELFUNCTION_GAMMA_Pos 1UL
#define GFXSS_DC_DCNANO_GCREGPANELFUNCTION_GCREGPANELFUNCTION_GAMMA_Msk 0x2UL
#define GFXSS_DC_DCNANO_GCREGPANELFUNCTION_GCREGPANELFUNCTION_DITHER_Pos 2UL
#define GFXSS_DC_DCNANO_GCREGPANELFUNCTION_GCREGPANELFUNCTION_DITHER_Msk 0x4UL
/* GFXSS_DC_DCNANO.GCREGPANELWORKING */
#define GFXSS_DC_DCNANO_GCREGPANELWORKING_GCREGPANELWORKING_WORKING_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGPANELWORKING_GCREGPANELWORKING_WORKING_Msk 0x1UL
/* GFXSS_DC_DCNANO.GCREGPANELSTATE */
#define GFXSS_DC_DCNANO_GCREGPANELSTATE_GCREGPANELSTATE_VIDEO_UNDER_FLOW_Pos 1UL
#define GFXSS_DC_DCNANO_GCREGPANELSTATE_GCREGPANELSTATE_VIDEO_UNDER_FLOW_Msk 0x2UL
#define GFXSS_DC_DCNANO_GCREGPANELSTATE_GCREGPANELSTATE_OVERLAY_UNDER_FLOW_Pos 2UL
#define GFXSS_DC_DCNANO_GCREGPANELSTATE_GCREGPANELSTATE_OVERLAY_UNDER_FLOW_Msk 0x4UL
#define GFXSS_DC_DCNANO_GCREGPANELSTATE_GCREGPANELSTATE_OVERLAY_UNDER_FLOW1_Pos 3UL
#define GFXSS_DC_DCNANO_GCREGPANELSTATE_GCREGPANELSTATE_OVERLAY_UNDER_FLOW1_Msk 0x8UL
/* GFXSS_DC_DCNANO.GCREGHDISPLAY */
#define GFXSS_DC_DCNANO_GCREGHDISPLAY_GCREGHDISPLAY_DISPLAY_END_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGHDISPLAY_GCREGHDISPLAY_DISPLAY_END_Msk 0x1FFFUL
#define GFXSS_DC_DCNANO_GCREGHDISPLAY_GCREGHDISPLAY_TOTAL_Pos 16UL
#define GFXSS_DC_DCNANO_GCREGHDISPLAY_GCREGHDISPLAY_TOTAL_Msk 0x1FFF0000UL
/* GFXSS_DC_DCNANO.GCREGHSYNC */
#define GFXSS_DC_DCNANO_GCREGHSYNC_GCREGHSYNC_START_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGHSYNC_GCREGHSYNC_START_Msk 0x1FFFUL
#define GFXSS_DC_DCNANO_GCREGHSYNC_GCREGHSYNC_END_Pos 16UL
#define GFXSS_DC_DCNANO_GCREGHSYNC_GCREGHSYNC_END_Msk 0x1FFF0000UL
#define GFXSS_DC_DCNANO_GCREGHSYNC_GCREGHSYNC_PULSE_Pos 30UL
#define GFXSS_DC_DCNANO_GCREGHSYNC_GCREGHSYNC_PULSE_Msk 0x40000000UL
#define GFXSS_DC_DCNANO_GCREGHSYNC_GCREGHSYNC_POLARITY_Pos 31UL
#define GFXSS_DC_DCNANO_GCREGHSYNC_GCREGHSYNC_POLARITY_Msk 0x80000000UL
/* GFXSS_DC_DCNANO.GCREGVDISPLAY */
#define GFXSS_DC_DCNANO_GCREGVDISPLAY_GCREGVDISPLAY_DISPLAY_END_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGVDISPLAY_GCREGVDISPLAY_DISPLAY_END_Msk 0xFFFUL
#define GFXSS_DC_DCNANO_GCREGVDISPLAY_GCREGVDISPLAY_TOTAL_Pos 16UL
#define GFXSS_DC_DCNANO_GCREGVDISPLAY_GCREGVDISPLAY_TOTAL_Msk 0xFFF0000UL
/* GFXSS_DC_DCNANO.GCREGVSYNC */
#define GFXSS_DC_DCNANO_GCREGVSYNC_GCREGVSYNC_START_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGVSYNC_GCREGVSYNC_START_Msk 0xFFFUL
#define GFXSS_DC_DCNANO_GCREGVSYNC_GCREGVSYNC_END_Pos 16UL
#define GFXSS_DC_DCNANO_GCREGVSYNC_GCREGVSYNC_END_Msk 0xFFF0000UL
#define GFXSS_DC_DCNANO_GCREGVSYNC_GCREGVSYNC_PULSE_Pos 30UL
#define GFXSS_DC_DCNANO_GCREGVSYNC_GCREGVSYNC_PULSE_Msk 0x40000000UL
#define GFXSS_DC_DCNANO_GCREGVSYNC_GCREGVSYNC_POLARITY_Pos 31UL
#define GFXSS_DC_DCNANO_GCREGVSYNC_GCREGVSYNC_POLARITY_Msk 0x80000000UL
/* GFXSS_DC_DCNANO.GCREGDISPLAYCURRENTLOCATION */
#define GFXSS_DC_DCNANO_GCREGDISPLAYCURRENTLOCATION_GCREGDISPLAYCURRENTLOCATION_X_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYCURRENTLOCATION_GCREGDISPLAYCURRENTLOCATION_X_Msk 0xFFFFUL
#define GFXSS_DC_DCNANO_GCREGDISPLAYCURRENTLOCATION_GCREGDISPLAYCURRENTLOCATION_Y_Pos 16UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYCURRENTLOCATION_GCREGDISPLAYCURRENTLOCATION_Y_Msk 0xFFFF0000UL
/* GFXSS_DC_DCNANO.GCREGGAMMAINDEX */
#define GFXSS_DC_DCNANO_GCREGGAMMAINDEX_GCREGGAMMAINDEX_INDEX_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGGAMMAINDEX_GCREGGAMMAINDEX_INDEX_Msk 0xFFUL
/* GFXSS_DC_DCNANO.GCREGGAMMADATA */
#define GFXSS_DC_DCNANO_GCREGGAMMADATA_GCREGGAMMADATA_BLUE_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGGAMMADATA_GCREGGAMMADATA_BLUE_Msk 0xFFUL
#define GFXSS_DC_DCNANO_GCREGGAMMADATA_GCREGGAMMADATA_GREEN_Pos 8UL
#define GFXSS_DC_DCNANO_GCREGGAMMADATA_GCREGGAMMADATA_GREEN_Msk 0xFF00UL
#define GFXSS_DC_DCNANO_GCREGGAMMADATA_GCREGGAMMADATA_RED_Pos 16UL
#define GFXSS_DC_DCNANO_GCREGGAMMADATA_GCREGGAMMADATA_RED_Msk 0xFF0000UL
/* GFXSS_DC_DCNANO.GCREGCURSORCONFIG */
#define GFXSS_DC_DCNANO_GCREGCURSORCONFIG_GCREGCURSORCONFIG_FORMAT_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGCURSORCONFIG_GCREGCURSORCONFIG_FORMAT_Msk 0x3UL
#define GFXSS_DC_DCNANO_GCREGCURSORCONFIG_GCREGCURSORCONFIG_HOT_SPOT_Y_Pos 8UL
#define GFXSS_DC_DCNANO_GCREGCURSORCONFIG_GCREGCURSORCONFIG_HOT_SPOT_Y_Msk 0x1F00UL
#define GFXSS_DC_DCNANO_GCREGCURSORCONFIG_GCREGCURSORCONFIG_HOT_SPOT_X_Pos 16UL
#define GFXSS_DC_DCNANO_GCREGCURSORCONFIG_GCREGCURSORCONFIG_HOT_SPOT_X_Msk 0x1F0000UL
/* GFXSS_DC_DCNANO.GCREGCURSORADDRESS */
#define GFXSS_DC_DCNANO_GCREGCURSORADDRESS_GCREGCURSORADDRESS_ADDRESS_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGCURSORADDRESS_GCREGCURSORADDRESS_ADDRESS_Msk 0xFFFFFFFFUL
/* GFXSS_DC_DCNANO.GCREGCURSORLOCATION */
#define GFXSS_DC_DCNANO_GCREGCURSORLOCATION_GCREGCURSORLOCATION_X_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGCURSORLOCATION_GCREGCURSORLOCATION_X_Msk 0x1FFFUL
#define GFXSS_DC_DCNANO_GCREGCURSORLOCATION_GCREGCURSORLOCATION_Y_Pos 16UL
#define GFXSS_DC_DCNANO_GCREGCURSORLOCATION_GCREGCURSORLOCATION_Y_Msk 0xFFF0000UL
/* GFXSS_DC_DCNANO.GCREGCURSORBACKGROUND */
#define GFXSS_DC_DCNANO_GCREGCURSORBACKGROUND_GCREGCURSORBACKGROUND_BLUE_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGCURSORBACKGROUND_GCREGCURSORBACKGROUND_BLUE_Msk 0xFFUL
#define GFXSS_DC_DCNANO_GCREGCURSORBACKGROUND_GCREGCURSORBACKGROUND_GREEN_Pos 8UL
#define GFXSS_DC_DCNANO_GCREGCURSORBACKGROUND_GCREGCURSORBACKGROUND_GREEN_Msk 0xFF00UL
#define GFXSS_DC_DCNANO_GCREGCURSORBACKGROUND_GCREGCURSORBACKGROUND_RED_Pos 16UL
#define GFXSS_DC_DCNANO_GCREGCURSORBACKGROUND_GCREGCURSORBACKGROUND_RED_Msk 0xFF0000UL
/* GFXSS_DC_DCNANO.GCREGCURSORFOREGROUND */
#define GFXSS_DC_DCNANO_GCREGCURSORFOREGROUND_GCREGCURSORFOREGROUND_BLUE_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGCURSORFOREGROUND_GCREGCURSORFOREGROUND_BLUE_Msk 0xFFUL
#define GFXSS_DC_DCNANO_GCREGCURSORFOREGROUND_GCREGCURSORFOREGROUND_GREEN_Pos 8UL
#define GFXSS_DC_DCNANO_GCREGCURSORFOREGROUND_GCREGCURSORFOREGROUND_GREEN_Msk 0xFF00UL
#define GFXSS_DC_DCNANO_GCREGCURSORFOREGROUND_GCREGCURSORFOREGROUND_RED_Pos 16UL
#define GFXSS_DC_DCNANO_GCREGCURSORFOREGROUND_GCREGCURSORFOREGROUND_RED_Msk 0xFF0000UL
/* GFXSS_DC_DCNANO.GCREGDISPLAYINTR */
#define GFXSS_DC_DCNANO_GCREGDISPLAYINTR_GCREGDISPLAYINTR_DISP0_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYINTR_GCREGDISPLAYINTR_DISP0_Msk 0x1UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYINTR_GCREGDISPLAYINTR_DISP0_DBI_CFG_ERROR_Pos 12UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYINTR_GCREGDISPLAYINTR_DISP0_DBI_CFG_ERROR_Msk 0x1000UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYINTR_GCREGDISPLAYINTR_PANEL_UNDERFLOW_Pos 29UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYINTR_GCREGDISPLAYINTR_PANEL_UNDERFLOW_Msk 0x20000000UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYINTR_GCREGDISPLAYINTR_SOFT_RESET_DONE_Pos 30UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYINTR_GCREGDISPLAYINTR_SOFT_RESET_DONE_Msk 0x40000000UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYINTR_GCREGDISPLAYINTR_BUS_ERROR_Pos 31UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYINTR_GCREGDISPLAYINTR_BUS_ERROR_Msk 0x80000000UL
/* GFXSS_DC_DCNANO.GCREGDISPLAYINTRENABLE */
#define GFXSS_DC_DCNANO_GCREGDISPLAYINTRENABLE_GCREGDISPLAYINTRENABLE_DISP0_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYINTRENABLE_GCREGDISPLAYINTRENABLE_DISP0_Msk 0x1UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYINTRENABLE_GCREGDISPLAYINTRENABLE_DISP0_DBI_CFG_ERROR_Pos 12UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYINTRENABLE_GCREGDISPLAYINTRENABLE_DISP0_DBI_CFG_ERROR_Msk 0x1000UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYINTRENABLE_GCREGDISPLAYINTRENABLE_PANEL_UNDERFLOW_Pos 29UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYINTRENABLE_GCREGDISPLAYINTRENABLE_PANEL_UNDERFLOW_Msk 0x20000000UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYINTRENABLE_GCREGDISPLAYINTRENABLE_SOFT_RESET_DONE_Pos 30UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYINTRENABLE_GCREGDISPLAYINTRENABLE_SOFT_RESET_DONE_Msk 0x40000000UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYINTRENABLE_GCREGDISPLAYINTRENABLE_BUS_ERROR_Pos 31UL
#define GFXSS_DC_DCNANO_GCREGDISPLAYINTRENABLE_GCREGDISPLAYINTRENABLE_BUS_ERROR_Msk 0x80000000UL
/* GFXSS_DC_DCNANO.GCREGDBICONFIG */
#define GFXSS_DC_DCNANO_GCREGDBICONFIG_GCREGDBICONFIG_DBI_TYPE_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDBICONFIG_GCREGDBICONFIG_DBI_TYPE_Msk 0x3UL
#define GFXSS_DC_DCNANO_GCREGDBICONFIG_GCREGDBICONFIG_DBI_DATA_FORMAT_Pos 2UL
#define GFXSS_DC_DCNANO_GCREGDBICONFIG_GCREGDBICONFIG_DBI_DATA_FORMAT_Msk 0x3CUL
#define GFXSS_DC_DCNANO_GCREGDBICONFIG_GCREGDBICONFIG_BUS_OUTPUT_SEL_Pos 6UL
#define GFXSS_DC_DCNANO_GCREGDBICONFIG_GCREGDBICONFIG_BUS_OUTPUT_SEL_Msk 0x40UL
#define GFXSS_DC_DCNANO_GCREGDBICONFIG_GCREGDBICONFIG_DBI_AC_TIME_UNIT_Pos 8UL
#define GFXSS_DC_DCNANO_GCREGDBICONFIG_GCREGDBICONFIG_DBI_AC_TIME_UNIT_Msk 0xF00UL
#define GFXSS_DC_DCNANO_GCREGDBICONFIG_GCREGDBICONFIG_DBI_TYPEC_OPT_Pos 12UL
#define GFXSS_DC_DCNANO_GCREGDBICONFIG_GCREGDBICONFIG_DBI_TYPEC_OPT_Msk 0x3000UL
/* GFXSS_DC_DCNANO.GCREGDBIIFRESET */
#define GFXSS_DC_DCNANO_GCREGDBIIFRESET_GCREGDBIIFRESET_DBI_IF_LEVEL_RESET_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDBIIFRESET_GCREGDBIIFRESET_DBI_IF_LEVEL_RESET_Msk 0x1UL
/* GFXSS_DC_DCNANO.GCREGDBIWRCHAR1 */
#define GFXSS_DC_DCNANO_GCREGDBIWRCHAR1_GCREGDBIWRCHAR1_DBI_WR_PERIOD_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDBIWRCHAR1_GCREGDBIWRCHAR1_DBI_WR_PERIOD_Msk 0xFFUL
#define GFXSS_DC_DCNANO_GCREGDBIWRCHAR1_GCREGDBIWRCHAR1_DBI_WR_EOR_WR_ASSERT_Pos 8UL
#define GFXSS_DC_DCNANO_GCREGDBIWRCHAR1_GCREGDBIWRCHAR1_DBI_WR_EOR_WR_ASSERT_Msk 0xF00UL
#define GFXSS_DC_DCNANO_GCREGDBIWRCHAR1_GCREGDBIWRCHAR1_DBI_WR_CS_ASSERT_Pos 12UL
#define GFXSS_DC_DCNANO_GCREGDBIWRCHAR1_GCREGDBIWRCHAR1_DBI_WR_CS_ASSERT_Msk 0xF000UL
/* GFXSS_DC_DCNANO.GCREGDBIWRCHAR2 */
#define GFXSS_DC_DCNANO_GCREGDBIWRCHAR2_GCREGDBIWRCHAR2_DBI_WR_EOR_WR_DE_ASRT_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDBIWRCHAR2_GCREGDBIWRCHAR2_DBI_WR_EOR_WR_DE_ASRT_Msk 0xFFUL
#define GFXSS_DC_DCNANO_GCREGDBIWRCHAR2_GCREGDBIWRCHAR2_DBI_WR_CS_DE_ASRT_Pos 8UL
#define GFXSS_DC_DCNANO_GCREGDBIWRCHAR2_GCREGDBIWRCHAR2_DBI_WR_CS_DE_ASRT_Msk 0xFF00UL
/* GFXSS_DC_DCNANO.GCREGDBICMD */
#define GFXSS_DC_DCNANO_GCREGDBICMD_GCREGDBICMD_DBI_COMMAND_WORD_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDBICMD_GCREGDBICMD_DBI_COMMAND_WORD_Msk 0xFFFFUL
#define GFXSS_DC_DCNANO_GCREGDBICMD_GCREGDBICMD_DBI_COMMANDFLAG_Pos 30UL
#define GFXSS_DC_DCNANO_GCREGDBICMD_GCREGDBICMD_DBI_COMMANDFLAG_Msk 0xC0000000UL
/* GFXSS_DC_DCNANO.GCREGDPICONFIG */
#define GFXSS_DC_DCNANO_GCREGDPICONFIG_GCREGDPICONFIG_DPI_DATA_FORMAT_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDPICONFIG_GCREGDPICONFIG_DPI_DATA_FORMAT_Msk 0x7UL
/* GFXSS_DC_DCNANO.GCREGDBITYPECCFG */
#define GFXSS_DC_DCNANO_GCREGDBITYPECCFG_GCREGDBITYPECCFG_TAS_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDBITYPECCFG_GCREGDBITYPECCFG_TAS_Msk 0xFUL
#define GFXSS_DC_DCNANO_GCREGDBITYPECCFG_GCREGDBITYPECCFG_SCL_TWRL_Pos 4UL
#define GFXSS_DC_DCNANO_GCREGDBITYPECCFG_GCREGDBITYPECCFG_SCL_TWRL_Msk 0xFF0UL
#define GFXSS_DC_DCNANO_GCREGDBITYPECCFG_GCREGDBITYPECCFG_SCL_TWRH_Pos 12UL
#define GFXSS_DC_DCNANO_GCREGDBITYPECCFG_GCREGDBITYPECCFG_SCL_TWRH_Msk 0xFF000UL
/* GFXSS_DC_DCNANO.GCREGDCSTATUS */
#define GFXSS_DC_DCNANO_GCREGDCSTATUS_GCREGDCSTATUS_DBI_TYPEC_FIFO_FULL_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDCSTATUS_GCREGDCSTATUS_DBI_TYPEC_FIFO_FULL_Msk 0x1UL
/* GFXSS_DC_DCNANO.GCREGSRCCONFIGENDIAN */
#define GFXSS_DC_DCNANO_GCREGSRCCONFIGENDIAN_GCREGSRCCONFIGENDIAN_CONTROL_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGSRCCONFIGENDIAN_GCREGSRCCONFIGENDIAN_CONTROL_Msk 0x3UL
/* GFXSS_DC_DCNANO.GCREGSOFTRESET */
#define GFXSS_DC_DCNANO_GCREGSOFTRESET_GCREGSOFTRESET_RESET_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGSOFTRESET_GCREGSOFTRESET_RESET_Msk 0x1UL
/* GFXSS_DC_DCNANO.GCREGDCCONTROL */
#define GFXSS_DC_DCNANO_GCREGDCCONTROL_GCREGDCCONTROL_DEBUG_REGISTER_Pos 3UL
#define GFXSS_DC_DCNANO_GCREGDCCONTROL_GCREGDCCONTROL_DEBUG_REGISTER_Msk 0x8UL
#define GFXSS_DC_DCNANO_GCREGDCCONTROL_GCREGDCCONTROL_RAM_CLOCK_GATING_Pos 4UL
#define GFXSS_DC_DCNANO_GCREGDCCONTROL_GCREGDCCONTROL_RAM_CLOCK_GATING_Msk 0x10UL
/* GFXSS_DC_DCNANO.GCREGREGISTERTIMINGCONTROL */
#define GFXSS_DC_DCNANO_GCREGREGISTERTIMINGCONTROL_GCREGREGISTERTIMINGCONTROL_FOR_PF1P_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGREGISTERTIMINGCONTROL_GCREGREGISTERTIMINGCONTROL_FOR_PF1P_Msk 0xFFUL
#define GFXSS_DC_DCNANO_GCREGREGISTERTIMINGCONTROL_GCREGREGISTERTIMINGCONTROL_FOR_RF2P_Pos 8UL
#define GFXSS_DC_DCNANO_GCREGREGISTERTIMINGCONTROL_GCREGREGISTERTIMINGCONTROL_FOR_RF2P_Msk 0xFF00UL
#define GFXSS_DC_DCNANO_GCREGREGISTERTIMINGCONTROL_GCREGREGISTERTIMINGCONTROL_FAST_RTC_Pos 16UL
#define GFXSS_DC_DCNANO_GCREGREGISTERTIMINGCONTROL_GCREGREGISTERTIMINGCONTROL_FAST_RTC_Msk 0x30000UL
#define GFXSS_DC_DCNANO_GCREGREGISTERTIMINGCONTROL_GCREGREGISTERTIMINGCONTROL_FAST_WTC_Pos 18UL
#define GFXSS_DC_DCNANO_GCREGREGISTERTIMINGCONTROL_GCREGREGISTERTIMINGCONTROL_FAST_WTC_Msk 0xC0000UL
#define GFXSS_DC_DCNANO_GCREGREGISTERTIMINGCONTROL_GCREGREGISTERTIMINGCONTROL_POWER_DOWN_Pos 20UL
#define GFXSS_DC_DCNANO_GCREGREGISTERTIMINGCONTROL_GCREGREGISTERTIMINGCONTROL_POWER_DOWN_Msk 0x100000UL
#define GFXSS_DC_DCNANO_GCREGREGISTERTIMINGCONTROL_GCREGREGISTERTIMINGCONTROL_DEEP_SLEEP_Pos 21UL
#define GFXSS_DC_DCNANO_GCREGREGISTERTIMINGCONTROL_GCREGREGISTERTIMINGCONTROL_DEEP_SLEEP_Msk 0x200000UL
#define GFXSS_DC_DCNANO_GCREGREGISTERTIMINGCONTROL_GCREGREGISTERTIMINGCONTROL_LIGHT_SLEEP_Pos 22UL
#define GFXSS_DC_DCNANO_GCREGREGISTERTIMINGCONTROL_GCREGREGISTERTIMINGCONTROL_LIGHT_SLEEP_Msk 0x400000UL
/* GFXSS_DC_DCNANO.GCREGDEBUGCOUNTERSELECT */
#define GFXSS_DC_DCNANO_GCREGDEBUGCOUNTERSELECT_GCREGDEBUGCOUNTERSELECT_SELECT_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDEBUGCOUNTERSELECT_GCREGDEBUGCOUNTERSELECT_SELECT_Msk 0xFFUL
/* GFXSS_DC_DCNANO.GCREGDEBUGCOUNTERVALUE */
#define GFXSS_DC_DCNANO_GCREGDEBUGCOUNTERVALUE_GCREGDEBUGCOUNTERVALUE_VALUE_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDEBUGCOUNTERVALUE_GCREGDEBUGCOUNTERVALUE_VALUE_Msk 0xFFFFFFFFUL
/* GFXSS_DC_DCNANO.GCREGLAYERCLOCKGATE */
#define GFXSS_DC_DCNANO_GCREGLAYERCLOCKGATE_GCREGLAYERCLOCKGATE_DISABLE_VIDEO_CLK_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGLAYERCLOCKGATE_GCREGLAYERCLOCKGATE_DISABLE_VIDEO_CLK_Msk 0x1UL
#define GFXSS_DC_DCNANO_GCREGLAYERCLOCKGATE_GCREGLAYERCLOCKGATE_DISABLE_OVERLAY0_CLK_Pos 1UL
#define GFXSS_DC_DCNANO_GCREGLAYERCLOCKGATE_GCREGLAYERCLOCKGATE_DISABLE_OVERLAY0_CLK_Msk 0x2UL
#define GFXSS_DC_DCNANO_GCREGLAYERCLOCKGATE_GCREGLAYERCLOCKGATE_DISABLE_OVERLAY1_CLK_Pos 2UL
#define GFXSS_DC_DCNANO_GCREGLAYERCLOCKGATE_GCREGLAYERCLOCKGATE_DISABLE_OVERLAY1_CLK_Msk 0x4UL
/* GFXSS_DC_DCNANO.GCREGDEBUGTOTVIDEOREQ */
#define GFXSS_DC_DCNANO_GCREGDEBUGTOTVIDEOREQ_GCREGDEBUGTOTVIDEOREQ_NUM_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDEBUGTOTVIDEOREQ_GCREGDEBUGTOTVIDEOREQ_NUM_Msk 0xFFFFFFFFUL
/* GFXSS_DC_DCNANO.GCREGDEBUGLSTVIDEOREQ */
#define GFXSS_DC_DCNANO_GCREGDEBUGLSTVIDEOREQ_GCREGDEBUGLSTVIDEOREQ_NUM_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDEBUGLSTVIDEOREQ_GCREGDEBUGLSTVIDEOREQ_NUM_Msk 0xFFFFFFFFUL
/* GFXSS_DC_DCNANO.GCREGDEBUGTOTVIDEORRB */
#define GFXSS_DC_DCNANO_GCREGDEBUGTOTVIDEORRB_GCREGDEBUGTOTVIDEORRB_NUM_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDEBUGTOTVIDEORRB_GCREGDEBUGTOTVIDEORRB_NUM_Msk 0xFFFFFFFFUL
/* GFXSS_DC_DCNANO.GCREGDEBUGLSTVIDEORRB */
#define GFXSS_DC_DCNANO_GCREGDEBUGLSTVIDEORRB_GCREGDEBUGLSTVIDEORRB_NUM_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDEBUGLSTVIDEORRB_GCREGDEBUGLSTVIDEORRB_NUM_Msk 0xFFFFFFFFUL
/* GFXSS_DC_DCNANO.GCREGDEBUGTOTOVERLAY0REQ */
#define GFXSS_DC_DCNANO_GCREGDEBUGTOTOVERLAY0REQ_GCREGDEBUGTOTOVERLAY0REQ_NUM_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDEBUGTOTOVERLAY0REQ_GCREGDEBUGTOTOVERLAY0REQ_NUM_Msk 0xFFFFFFFFUL
/* GFXSS_DC_DCNANO.GCREGDEBUGLSTOVERLAY0REQ */
#define GFXSS_DC_DCNANO_GCREGDEBUGLSTOVERLAY0REQ_GCREGDEBUGLSTOVERLAY0REQ_NUM_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDEBUGLSTOVERLAY0REQ_GCREGDEBUGLSTOVERLAY0REQ_NUM_Msk 0xFFFFFFFFUL
/* GFXSS_DC_DCNANO.GCREGDEBUGTOTOVERLAY0RRB */
#define GFXSS_DC_DCNANO_GCREGDEBUGTOTOVERLAY0RRB_GCREGDEBUGTOTOVERLAY0RRB_NUM_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDEBUGTOTOVERLAY0RRB_GCREGDEBUGTOTOVERLAY0RRB_NUM_Msk 0xFFFFFFFFUL
/* GFXSS_DC_DCNANO.GCREGDEBUGLSTOVERLAY0RRB */
#define GFXSS_DC_DCNANO_GCREGDEBUGLSTOVERLAY0RRB_GCREGDEBUGLSTOVERLAY0RRB_NUM_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDEBUGLSTOVERLAY0RRB_GCREGDEBUGLSTOVERLAY0RRB_NUM_Msk 0xFFFFFFFFUL
/* GFXSS_DC_DCNANO.GCREGDEBUGTOTOVERLAY1REQ */
#define GFXSS_DC_DCNANO_GCREGDEBUGTOTOVERLAY1REQ_GCREGDEBUGTOTOVERLAY1REQ_NUM_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDEBUGTOTOVERLAY1REQ_GCREGDEBUGTOTOVERLAY1REQ_NUM_Msk 0xFFFFFFFFUL
/* GFXSS_DC_DCNANO.GCREGDEBUGLSTOVERLAY1REQ */
#define GFXSS_DC_DCNANO_GCREGDEBUGLSTOVERLAY1REQ_GCREGDEBUGLSTOVERLAY1REQ_NUM_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDEBUGLSTOVERLAY1REQ_GCREGDEBUGLSTOVERLAY1REQ_NUM_Msk 0xFFFFFFFFUL
/* GFXSS_DC_DCNANO.GCREGDEBUGTOTOVERLAY1RRB */
#define GFXSS_DC_DCNANO_GCREGDEBUGTOTOVERLAY1RRB_GCREGDEBUGTOTOVERLAY1RRB_NUM_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDEBUGTOTOVERLAY1RRB_GCREGDEBUGTOTOVERLAY1RRB_NUM_Msk 0xFFFFFFFFUL
/* GFXSS_DC_DCNANO.GCREGDEBUGLSTOVERLAY1RRB */
#define GFXSS_DC_DCNANO_GCREGDEBUGLSTOVERLAY1RRB_GCREGDEBUGLSTOVERLAY1RRB_NUM_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDEBUGLSTOVERLAY1RRB_GCREGDEBUGLSTOVERLAY1RRB_NUM_Msk 0xFFFFFFFFUL
/* GFXSS_DC_DCNANO.GCREGDEBUGTOTCURSORREQ */
#define GFXSS_DC_DCNANO_GCREGDEBUGTOTCURSORREQ_GCREGDEBUGTOTCURSORREQ_NUM_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDEBUGTOTCURSORREQ_GCREGDEBUGTOTCURSORREQ_NUM_Msk 0xFFFFFFFFUL
/* GFXSS_DC_DCNANO.GCREGDEBUGLSTCURSORREQ */
#define GFXSS_DC_DCNANO_GCREGDEBUGLSTCURSORREQ_GCREGDEBUGLSTCURSORREQ_NUM_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDEBUGLSTCURSORREQ_GCREGDEBUGLSTCURSORREQ_NUM_Msk 0xFFFFFFFFUL
/* GFXSS_DC_DCNANO.GCREGDEBUGTOTCURSORRRB */
#define GFXSS_DC_DCNANO_GCREGDEBUGTOTCURSORRRB_GCREGDEBUGTOTCURSORRRB_NUM_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDEBUGTOTCURSORRRB_GCREGDEBUGTOTCURSORRRB_NUM_Msk 0xFFFFFFFFUL
/* GFXSS_DC_DCNANO.GCREGDEBUGLSTCURSORRRB */
#define GFXSS_DC_DCNANO_GCREGDEBUGLSTCURSORRRB_GCREGDEBUGLSTCURSORRRB_NUM_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDEBUGLSTCURSORRRB_GCREGDEBUGLSTCURSORRRB_NUM_Msk 0xFFFFFFFFUL
/* GFXSS_DC_DCNANO.GCREGDEBUGTOTDCREQ */
#define GFXSS_DC_DCNANO_GCREGDEBUGTOTDCREQ_GCREGDEBUGTOTDCREQ_NUM_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDEBUGTOTDCREQ_GCREGDEBUGTOTDCREQ_NUM_Msk 0xFFFFFFFFUL
/* GFXSS_DC_DCNANO.GCREGDEBUGLSTDCREQ */
#define GFXSS_DC_DCNANO_GCREGDEBUGLSTDCREQ_GCREGDEBUGLSTDCREQ_NUM_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDEBUGLSTDCREQ_GCREGDEBUGLSTDCREQ_NUM_Msk 0xFFFFFFFFUL
/* GFXSS_DC_DCNANO.GCREGDEBUGTOTDCRRB */
#define GFXSS_DC_DCNANO_GCREGDEBUGTOTDCRRB_GCREGDEBUGTOTDCRRB_NUM_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDEBUGTOTDCRRB_GCREGDEBUGTOTDCRRB_NUM_Msk 0xFFFFFFFFUL
/* GFXSS_DC_DCNANO.GCREGDEBUGLSTDCRRB */
#define GFXSS_DC_DCNANO_GCREGDEBUGLSTDCRRB_GCREGDEBUGLSTDCRRB_NUM_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDEBUGLSTDCRRB_GCREGDEBUGLSTDCRRB_NUM_Msk 0xFFFFFFFFUL
/* GFXSS_DC_DCNANO.GCREGDEBUGFRAMEANDMISFLAG */
#define GFXSS_DC_DCNANO_GCREGDEBUGFRAMEANDMISFLAG_GCREGDEBUGFRAMEANDMISFLAG_CURRENT_MISMATCH_FLAG_TOTAL_Pos 0UL
#define GFXSS_DC_DCNANO_GCREGDEBUGFRAMEANDMISFLAG_GCREGDEBUGFRAMEANDMISFLAG_CURRENT_MISMATCH_FLAG_TOTAL_Msk 0x1UL
#define GFXSS_DC_DCNANO_GCREGDEBUGFRAMEANDMISFLAG_GCREGDEBUGFRAMEANDMISFLAG_CURRENT_MISMATCH_FLAG_Pos 1UL
#define GFXSS_DC_DCNANO_GCREGDEBUGFRAMEANDMISFLAG_GCREGDEBUGFRAMEANDMISFLAG_CURRENT_MISMATCH_FLAG_Msk 0x1EUL
#define GFXSS_DC_DCNANO_GCREGDEBUGFRAMEANDMISFLAG_GCREGDEBUGFRAMEANDMISFLAG_CURRENT_FRAME_CNT_Pos 5UL
#define GFXSS_DC_DCNANO_GCREGDEBUGFRAMEANDMISFLAG_GCREGDEBUGFRAMEANDMISFLAG_CURRENT_FRAME_CNT_Msk 0xFFE0UL
#define GFXSS_DC_DCNANO_GCREGDEBUGFRAMEANDMISFLAG_GCREGDEBUGFRAMEANDMISFLAG_LAST_MISMATCH_FLAG_TOTAL_Pos 16UL
