PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_gfxss.h
#define GFXSS_DC_DCNANO_GCREGDEBUGFRAMEANDMISFLAG_GCREGDEBUGFRAMEANDMISFLAG_LAST_MISMATCH_FLAG_TOTAL_Msk 0x10000UL
#define GFXSS_DC_DCNANO_GCREGDEBUGFRAMEANDMISFLAG_GCREGDEBUGFRAMEANDMISFLAG_LAST_MISMATCH_FLAG_Pos 17UL
#define GFXSS_DC_DCNANO_GCREGDEBUGFRAMEANDMISFLAG_GCREGDEBUGFRAMEANDMISFLAG_LAST_MISMATCH_FLAG_Msk 0x1E0000UL
#define GFXSS_DC_DCNANO_GCREGDEBUGFRAMEANDMISFLAG_GCREGDEBUGFRAMEANDMISFLAG_LAST_FRAME_CNT_Pos 21UL
#define GFXSS_DC_DCNANO_GCREGDEBUGFRAMEANDMISFLAG_GCREGDEBUGFRAMEANDMISFLAG_LAST_FRAME_CNT_Msk 0xFFE00000UL


/* GFXSS_MIPIDSI_MXMIPIDSI.CTL */
#define GFXSS_MIPIDSI_MXMIPIDSI_CTL_ENABLED_Pos 31UL
#define GFXSS_MIPIDSI_MXMIPIDSI_CTL_ENABLED_Msk 0x80000000UL
/* GFXSS_MIPIDSI_MXMIPIDSI.CLK_CTL */
#define GFXSS_MIPIDSI_MXMIPIDSI_CLK_CTL_CLK_CFG_Pos 0UL
#define GFXSS_MIPIDSI_MXMIPIDSI_CLK_CTL_CLK_CFG_Msk 0x1UL
/* GFXSS_MIPIDSI_MXMIPIDSI.INTR */
#define GFXSS_MIPIDSI_MXMIPIDSI_INTR_CORE_Pos   0UL
#define GFXSS_MIPIDSI_MXMIPIDSI_INTR_CORE_Msk   0x1UL
#define GFXSS_MIPIDSI_MXMIPIDSI_INTR_DBI_TE_Pos 8UL
#define GFXSS_MIPIDSI_MXMIPIDSI_INTR_DBI_TE_Msk 0x100UL
#define GFXSS_MIPIDSI_MXMIPIDSI_INTR_DPI_HALT_Pos 16UL
#define GFXSS_MIPIDSI_MXMIPIDSI_INTR_DPI_HALT_Msk 0x10000UL
/* GFXSS_MIPIDSI_MXMIPIDSI.INTR_SET */
#define GFXSS_MIPIDSI_MXMIPIDSI_INTR_SET_CORE_SET_Pos 0UL
#define GFXSS_MIPIDSI_MXMIPIDSI_INTR_SET_CORE_SET_Msk 0x1UL
#define GFXSS_MIPIDSI_MXMIPIDSI_INTR_SET_DBI_TE_SET_Pos 8UL
#define GFXSS_MIPIDSI_MXMIPIDSI_INTR_SET_DBI_TE_SET_Msk 0x100UL
#define GFXSS_MIPIDSI_MXMIPIDSI_INTR_SET_DPI_HALT_SET_Pos 16UL
#define GFXSS_MIPIDSI_MXMIPIDSI_INTR_SET_DPI_HALT_SET_Msk 0x10000UL
/* GFXSS_MIPIDSI_MXMIPIDSI.INTR_MASK */
#define GFXSS_MIPIDSI_MXMIPIDSI_INTR_MASK_CORE_MASK_Pos 0UL
#define GFXSS_MIPIDSI_MXMIPIDSI_INTR_MASK_CORE_MASK_Msk 0x1UL
#define GFXSS_MIPIDSI_MXMIPIDSI_INTR_MASK_DBI_TE_MASK_Pos 8UL
#define GFXSS_MIPIDSI_MXMIPIDSI_INTR_MASK_DBI_TE_MASK_Msk 0x100UL
#define GFXSS_MIPIDSI_MXMIPIDSI_INTR_MASK_DPI_HALT_MASK_Pos 16UL
#define GFXSS_MIPIDSI_MXMIPIDSI_INTR_MASK_DPI_HALT_MASK_Msk 0x10000UL
/* GFXSS_MIPIDSI_MXMIPIDSI.INTR_MASKED */
#define GFXSS_MIPIDSI_MXMIPIDSI_INTR_MASKED_CORE_MASKED_Pos 0UL
#define GFXSS_MIPIDSI_MXMIPIDSI_INTR_MASKED_CORE_MASKED_Msk 0x1UL
#define GFXSS_MIPIDSI_MXMIPIDSI_INTR_MASKED_DBI_TE_MASKED_Pos 8UL
#define GFXSS_MIPIDSI_MXMIPIDSI_INTR_MASKED_DBI_TE_MASKED_Msk 0x100UL
#define GFXSS_MIPIDSI_MXMIPIDSI_INTR_MASKED_DPI_HALT_MASKED_Pos 16UL
#define GFXSS_MIPIDSI_MXMIPIDSI_INTR_MASKED_DPI_HALT_MASKED_Msk 0x10000UL
/* GFXSS_MIPIDSI_MXMIPIDSI.DPI_CMD */
#define GFXSS_MIPIDSI_MXMIPIDSI_DPI_CMD_DPI_SHUTDOWN_Pos 0UL
#define GFXSS_MIPIDSI_MXMIPIDSI_DPI_CMD_DPI_SHUTDOWN_Msk 0x1UL
#define GFXSS_MIPIDSI_MXMIPIDSI_DPI_CMD_DPI_COLORMODE_Pos 8UL
#define GFXSS_MIPIDSI_MXMIPIDSI_DPI_CMD_DPI_COLORMODE_Msk 0x100UL
/* GFXSS_MIPIDSI_MXMIPIDSI.DBI_CMD */
#define GFXSS_MIPIDSI_MXMIPIDSI_DBI_CMD_DBI_RESET_Pos 0UL
#define GFXSS_MIPIDSI_MXMIPIDSI_DBI_CMD_DBI_RESET_Msk 0x1UL
/* GFXSS_MIPIDSI_MXMIPIDSI.PHY_FREQ_RANGE */
#define GFXSS_MIPIDSI_MXMIPIDSI_PHY_FREQ_RANGE_CFG_CLK_FREQ_RANGE_Pos 0UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PHY_FREQ_RANGE_CFG_CLK_FREQ_RANGE_Msk 0xFFUL
#define GFXSS_MIPIDSI_MXMIPIDSI_PHY_FREQ_RANGE_HS_FREQ_RANGE_Pos 8UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PHY_FREQ_RANGE_HS_FREQ_RANGE_Msk 0x7F00UL
/* GFXSS_MIPIDSI_MXMIPIDSI.BIST */
#define GFXSS_MIPIDSI_MXMIPIDSI_BIST_ON_Pos     0UL
#define GFXSS_MIPIDSI_MXMIPIDSI_BIST_ON_Msk     0x1UL
#define GFXSS_MIPIDSI_MXMIPIDSI_BIST_DONE_Pos   1UL
#define GFXSS_MIPIDSI_MXMIPIDSI_BIST_DONE_Msk   0x2UL
#define GFXSS_MIPIDSI_MXMIPIDSI_BIST_OK_Pos     2UL
#define GFXSS_MIPIDSI_MXMIPIDSI_BIST_OK_Msk     0x4UL
/* GFXSS_MIPIDSI_MXMIPIDSI.IO_CONTINUITY_TEST */
#define GFXSS_MIPIDSI_MXMIPIDSI_IO_CONTINUITY_TEST_EN_Pos 0UL
#define GFXSS_MIPIDSI_MXMIPIDSI_IO_CONTINUITY_TEST_EN_Msk 0x1UL
#define GFXSS_MIPIDSI_MXMIPIDSI_IO_CONTINUITY_TEST_DATA_Pos 1UL
#define GFXSS_MIPIDSI_MXMIPIDSI_IO_CONTINUITY_TEST_DATA_Msk 0xFEUL
/* GFXSS_MIPIDSI_MXMIPIDSI.PLL_TEST_CONFIG1 */
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_CONFIG1_VCO_CNTRL_Pos 0UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_CONFIG1_VCO_CNTRL_Msk 0x3FUL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_CONFIG1_PROP_CNTRL_Pos 6UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_CONFIG1_PROP_CNTRL_Msk 0xFC0UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_CONFIG1_INT_CNTRL_Pos 12UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_CONFIG1_INT_CNTRL_Msk 0x3F000UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_CONFIG1_GMP_CNTRL_Pos 18UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_CONFIG1_GMP_CNTRL_Msk 0xC0000UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_CONFIG1_CPBIAS_CNTRL_Pos 20UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_CONFIG1_CPBIAS_CNTRL_Msk 0x7F00000UL
/* GFXSS_MIPIDSI_MXMIPIDSI.PLL_TEST_CONFIG2 */
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_CONFIG2_GP_CLK_EN_Pos 0UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_CONFIG2_GP_CLK_EN_Msk 0x1UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_CONFIG2_LOCK_PLL_Pos 1UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_CONFIG2_LOCK_PLL_Msk 0x2UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_CONFIG2_PLL_N_Pos 2UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_CONFIG2_PLL_N_Msk 0x3CUL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_CONFIG2_PLL_M_Pos 6UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_CONFIG2_PLL_M_Msk 0xFFC0UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_CONFIG2_CLKSEL_Pos 16UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_CONFIG2_CLKSEL_Msk 0x30000UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_CONFIG2_UPDATEPLL_Pos 18UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_CONFIG2_UPDATEPLL_Msk 0x40000UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_CONFIG2_FORCE_LOCK_Pos 19UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_CONFIG2_FORCE_LOCK_Msk 0x80000UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_CONFIG2_PLL_SHADOW_CONTROL_Pos 20UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_CONFIG2_PLL_SHADOW_CONTROL_Msk 0x100000UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_CONFIG2_SHADOW_CLEAR_Pos 21UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_CONFIG2_SHADOW_CLEAR_Msk 0x200000UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_CONFIG2_TEST_STOP_CLK_EN_Pos 22UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_CONFIG2_TEST_STOP_CLK_EN_Msk 0x400000UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_CONFIG2_WAKEUPPLL_Pos 23UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_CONFIG2_WAKEUPPLL_Msk 0x800000UL
/* GFXSS_MIPIDSI_MXMIPIDSI.PLL_TEST_OBS1 */
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_OBS1_VCO_CNTRL_OBS_Pos 0UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_OBS1_VCO_CNTRL_OBS_Msk 0x3FUL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_OBS1_PROP_CNTRL_OBS_Pos 6UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_OBS1_PROP_CNTRL_OBS_Msk 0xFC0UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_OBS1_INT_CNTRL_OBS_Pos 12UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_OBS1_INT_CNTRL_OBS_Msk 0x3F000UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_OBS1_GMP_CNTRL_OBS_Pos 18UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_OBS1_GMP_CNTRL_OBS_Msk 0xC0000UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_OBS1_CPBIAS_CNTRL_OBS_Pos 20UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_OBS1_CPBIAS_CNTRL_OBS_Msk 0x7F00000UL
/* GFXSS_MIPIDSI_MXMIPIDSI.PLL_TEST_OBS2 */
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_OBS2_PLL_N_OBS_Pos 0UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_OBS2_PLL_N_OBS_Msk 0xFUL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_OBS2_PLL_M_OBS_Pos 4UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_OBS2_PLL_M_OBS_Msk 0x3FF0UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_OBS2_PLL_SHADOW_CONTROL_OBS_Pos 14UL
#define GFXSS_MIPIDSI_MXMIPIDSI_PLL_TEST_OBS2_PLL_SHADOW_CONTROL_OBS_Msk 0x4000UL
/* GFXSS_MIPIDSI_MXMIPIDSI.LP_INTERNAL_LOOPBACK_TEST */
#define GFXSS_MIPIDSI_MXMIPIDSI_LP_INTERNAL_LOOPBACK_TEST_RXDATAESC_VALID_Pos 0UL
#define GFXSS_MIPIDSI_MXMIPIDSI_LP_INTERNAL_LOOPBACK_TEST_RXDATAESC_VALID_Msk 0x1UL
#define GFXSS_MIPIDSI_MXMIPIDSI_LP_INTERNAL_LOOPBACK_TEST_RXDATAESC_Pos 1UL
#define GFXSS_MIPIDSI_MXMIPIDSI_LP_INTERNAL_LOOPBACK_TEST_RXDATAESC_Msk 0x1FEUL
#define GFXSS_MIPIDSI_MXMIPIDSI_LP_INTERNAL_LOOPBACK_TEST_RXTRIGGERESC_Pos 9UL
#define GFXSS_MIPIDSI_MXMIPIDSI_LP_INTERNAL_LOOPBACK_TEST_RXTRIGGERESC_Msk 0x1E00UL


