PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_gfxss.h
/* GFXSS_MIPIDSI_DWCMIPIDSI.VERSION */
#define GFXSS_MIPIDSI_DWCMIPIDSI_VERSION_VERSION_VERSION_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VERSION_VERSION_VERSION_Msk 0xFFFFFFFFUL
/* GFXSS_MIPIDSI_DWCMIPIDSI.PWR_UP */
#define GFXSS_MIPIDSI_DWCMIPIDSI_PWR_UP_PWR_UP_SHUTDOWNZ_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PWR_UP_PWR_UP_SHUTDOWNZ_Msk 0x1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PWR_UP_PWR_UP_RESERVED_31_1_Pos 1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PWR_UP_PWR_UP_RESERVED_31_1_Msk 0xFFFFFFFEUL
/* GFXSS_MIPIDSI_DWCMIPIDSI.CLKMGR_CFG */
#define GFXSS_MIPIDSI_DWCMIPIDSI_CLKMGR_CFG_CLKMGR_CFG_TX_ESC_CLK_DIVISION_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CLKMGR_CFG_CLKMGR_CFG_TX_ESC_CLK_DIVISION_Msk 0xFFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CLKMGR_CFG_CLKMGR_CFG_TO_CLK_DIVISION_Pos 8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CLKMGR_CFG_CLKMGR_CFG_TO_CLK_DIVISION_Msk 0xFF00UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CLKMGR_CFG_CLKMGR_CFG_RESERVED_31_16_Pos 16UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CLKMGR_CFG_CLKMGR_CFG_RESERVED_31_16_Msk 0xFFFF0000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.DPI_VCID */
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_VCID_DPI_VCID_DPI_VCID_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_VCID_DPI_VCID_DPI_VCID_Msk 0x3UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_VCID_DPI_VCID_RESERVED_31_2_Pos 2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_VCID_DPI_VCID_RESERVED_31_2_Msk 0xFFFFFFFCUL
/* GFXSS_MIPIDSI_DWCMIPIDSI.DPI_COLOR_CODING */
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_COLOR_CODING_DPI_COLOR_CODING_DPI_COLOR_CODING_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_COLOR_CODING_DPI_COLOR_CODING_DPI_COLOR_CODING_Msk 0xFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_COLOR_CODING_DPI_COLOR_CODING_RESERVED_7_4_Pos 4UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_COLOR_CODING_DPI_COLOR_CODING_RESERVED_7_4_Msk 0xF0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_COLOR_CODING_DPI_COLOR_CODING_LOOSELY18_EN_Pos 8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_COLOR_CODING_DPI_COLOR_CODING_LOOSELY18_EN_Msk 0x100UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_COLOR_CODING_DPI_COLOR_CODING_RESERVED_31_9_Pos 9UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_COLOR_CODING_DPI_COLOR_CODING_RESERVED_31_9_Msk 0xFFFFFE00UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.DPI_CFG_POL */
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_CFG_POL_DPI_CFG_POL_DATAEN_ACTIVE_LOW_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_CFG_POL_DPI_CFG_POL_DATAEN_ACTIVE_LOW_Msk 0x1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_CFG_POL_DPI_CFG_POL_VSYNC_ACTIVE_LOW_Pos 1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_CFG_POL_DPI_CFG_POL_VSYNC_ACTIVE_LOW_Msk 0x2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_CFG_POL_DPI_CFG_POL_HSYNC_ACTIVE_LOW_Pos 2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_CFG_POL_DPI_CFG_POL_HSYNC_ACTIVE_LOW_Msk 0x4UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_CFG_POL_DPI_CFG_POL_SHUTD_ACTIVE_LOW_Pos 3UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_CFG_POL_DPI_CFG_POL_SHUTD_ACTIVE_LOW_Msk 0x8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_CFG_POL_DPI_CFG_POL_COLORM_ACTIVE_LOW_Pos 4UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_CFG_POL_DPI_CFG_POL_COLORM_ACTIVE_LOW_Msk 0x10UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_CFG_POL_DPI_CFG_POL_RESERVED_31_5_Pos 5UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_CFG_POL_DPI_CFG_POL_RESERVED_31_5_Msk 0xFFFFFFE0UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.DPI_LP_CMD_TIM */
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_LP_CMD_TIM_DPI_LP_CMD_TIM_INVACT_LPCMD_TIME_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_LP_CMD_TIM_DPI_LP_CMD_TIM_INVACT_LPCMD_TIME_Msk 0xFFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_LP_CMD_TIM_DPI_LP_CMD_TIM_RESERVED_15_8_Pos 8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_LP_CMD_TIM_DPI_LP_CMD_TIM_RESERVED_15_8_Msk 0xFF00UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_LP_CMD_TIM_DPI_LP_CMD_TIM_OUTVACT_LPCMD_TIME_Pos 16UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_LP_CMD_TIM_DPI_LP_CMD_TIM_OUTVACT_LPCMD_TIME_Msk 0xFF0000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_LP_CMD_TIM_DPI_LP_CMD_TIM_RESERVED_31_24_Pos 24UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_LP_CMD_TIM_DPI_LP_CMD_TIM_RESERVED_31_24_Msk 0xFF000000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.DBI_VCID */
#define GFXSS_MIPIDSI_DWCMIPIDSI_DBI_VCID_DBI_VCID_DBI_VCID_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DBI_VCID_DBI_VCID_DBI_VCID_Msk 0x3UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DBI_VCID_DBI_VCID_RESERVED_31_2_Pos 2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DBI_VCID_DBI_VCID_RESERVED_31_2_Msk 0xFFFFFFFCUL
/* GFXSS_MIPIDSI_DWCMIPIDSI.DBI_CFG */
#define GFXSS_MIPIDSI_DWCMIPIDSI_DBI_CFG_DBI_CFG_IN_DBI_CONF_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DBI_CFG_DBI_CFG_IN_DBI_CONF_Msk 0xFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DBI_CFG_DBI_CFG_RESERVED_7_4_Pos 4UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DBI_CFG_DBI_CFG_RESERVED_7_4_Msk 0xF0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DBI_CFG_DBI_CFG_OUT_DBI_CONF_Pos 8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DBI_CFG_DBI_CFG_OUT_DBI_CONF_Msk 0xF00UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DBI_CFG_DBI_CFG_RESERVED_15_12_Pos 12UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DBI_CFG_DBI_CFG_RESERVED_15_12_Msk 0xF000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DBI_CFG_DBI_CFG_LUT_SIZE_CONF_Pos 16UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DBI_CFG_DBI_CFG_LUT_SIZE_CONF_Msk 0x30000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DBI_CFG_DBI_CFG_RESERVED_31_18_Pos 18UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DBI_CFG_DBI_CFG_RESERVED_31_18_Msk 0xFFFC0000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.DBI_PARTITIONING_EN */
#define GFXSS_MIPIDSI_DWCMIPIDSI_DBI_PARTITIONING_EN_DBI_PARTITIONING_EN_PARTITIONING_EN_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DBI_PARTITIONING_EN_DBI_PARTITIONING_EN_PARTITIONING_EN_Msk 0x1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DBI_PARTITIONING_EN_DBI_PARTITIONING_EN_RESERVED_31_1_Pos 1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DBI_PARTITIONING_EN_DBI_PARTITIONING_EN_RESERVED_31_1_Msk 0xFFFFFFFEUL
/* GFXSS_MIPIDSI_DWCMIPIDSI.DBI_CMDSIZE */
#define GFXSS_MIPIDSI_DWCMIPIDSI_DBI_CMDSIZE_DBI_CMDSIZE_WR_CMD_SIZE_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DBI_CMDSIZE_DBI_CMDSIZE_WR_CMD_SIZE_Msk 0xFFFFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DBI_CMDSIZE_DBI_CMDSIZE_ALLOWED_CMD_SIZE_Pos 16UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DBI_CMDSIZE_DBI_CMDSIZE_ALLOWED_CMD_SIZE_Msk 0xFFFF0000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.PCKHDL_CFG */
#define GFXSS_MIPIDSI_DWCMIPIDSI_PCKHDL_CFG_PCKHDL_CFG_EOTP_TX_EN_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PCKHDL_CFG_PCKHDL_CFG_EOTP_TX_EN_Msk 0x1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PCKHDL_CFG_PCKHDL_CFG_EOTP_RX_EN_Pos 1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PCKHDL_CFG_PCKHDL_CFG_EOTP_RX_EN_Msk 0x2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PCKHDL_CFG_PCKHDL_CFG_BTA_EN_Pos 2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PCKHDL_CFG_PCKHDL_CFG_BTA_EN_Msk 0x4UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PCKHDL_CFG_PCKHDL_CFG_ECC_RX_EN_Pos 3UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PCKHDL_CFG_PCKHDL_CFG_ECC_RX_EN_Msk 0x8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PCKHDL_CFG_PCKHDL_CFG_CRC_RX_EN_Pos 4UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PCKHDL_CFG_PCKHDL_CFG_CRC_RX_EN_Msk 0x10UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PCKHDL_CFG_PCKHDL_CFG_EOTP_TX_LP_EN_Pos 5UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PCKHDL_CFG_PCKHDL_CFG_EOTP_TX_LP_EN_Msk 0x20UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PCKHDL_CFG_PCKHDL_CFG_RESERVED_31_6_Pos 6UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PCKHDL_CFG_PCKHDL_CFG_RESERVED_31_6_Msk 0xFFFFFFC0UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.GEN_VCID */
#define GFXSS_MIPIDSI_DWCMIPIDSI_GEN_VCID_GEN_VCID_GEN_VCID_RX_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_GEN_VCID_GEN_VCID_GEN_VCID_RX_Msk 0x3UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_GEN_VCID_GEN_VCID_RESERVED_7_2_Pos 2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_GEN_VCID_GEN_VCID_RESERVED_7_2_Msk 0xFCUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_GEN_VCID_GEN_VCID_GEN_VCID_TEAR_AUTO_Pos 8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_GEN_VCID_GEN_VCID_GEN_VCID_TEAR_AUTO_Msk 0x300UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_GEN_VCID_GEN_VCID_RESERVED_15_10_Pos 10UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_GEN_VCID_GEN_VCID_RESERVED_15_10_Msk 0xFC00UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_GEN_VCID_GEN_VCID_GEN_VCID_TX_AUTO_Pos 16UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_GEN_VCID_GEN_VCID_GEN_VCID_TX_AUTO_Msk 0x30000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_GEN_VCID_GEN_VCID_RESERVED_31_18_Pos 18UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_GEN_VCID_GEN_VCID_RESERVED_31_18_Msk 0xFFFC0000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.MODE_CFG */
#define GFXSS_MIPIDSI_DWCMIPIDSI_MODE_CFG_MODE_CFG_CMD_VIDEO_MODE_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_MODE_CFG_MODE_CFG_CMD_VIDEO_MODE_Msk 0x1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_MODE_CFG_MODE_CFG_RESERVED_31_1_Pos 1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_MODE_CFG_MODE_CFG_RESERVED_31_1_Msk 0xFFFFFFFEUL
/* GFXSS_MIPIDSI_DWCMIPIDSI.VID_MODE_CFG */
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_VID_MODE_CFG_VID_MODE_TYPE_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_VID_MODE_CFG_VID_MODE_TYPE_Msk 0x3UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_VID_MODE_CFG_RESERVED_7_2_Pos 2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_VID_MODE_CFG_RESERVED_7_2_Msk 0xFCUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_VID_MODE_CFG_LP_VSA_EN_Pos 8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_VID_MODE_CFG_LP_VSA_EN_Msk 0x100UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_VID_MODE_CFG_LP_VBP_EN_Pos 9UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_VID_MODE_CFG_LP_VBP_EN_Msk 0x200UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_VID_MODE_CFG_LP_VFP_EN_Pos 10UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_VID_MODE_CFG_LP_VFP_EN_Msk 0x400UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_VID_MODE_CFG_LP_VACT_EN_Pos 11UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_VID_MODE_CFG_LP_VACT_EN_Msk 0x800UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_VID_MODE_CFG_LP_HBP_EN_Pos 12UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_VID_MODE_CFG_LP_HBP_EN_Msk 0x1000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_VID_MODE_CFG_LP_HFP_EN_Pos 13UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_VID_MODE_CFG_LP_HFP_EN_Msk 0x2000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_VID_MODE_CFG_FRAME_BTA_ACK_EN_Pos 14UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_VID_MODE_CFG_FRAME_BTA_ACK_EN_Msk 0x4000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_VID_MODE_CFG_LP_CMD_EN_Pos 15UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_VID_MODE_CFG_LP_CMD_EN_Msk 0x8000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_VID_MODE_CFG_VPG_EN_Pos 16UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_VID_MODE_CFG_VPG_EN_Msk 0x10000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_VID_MODE_CFG_RESERVED_19_17_Pos 17UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_VID_MODE_CFG_RESERVED_19_17_Msk 0xE0000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_VID_MODE_CFG_VPG_MODE_Pos 20UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_VID_MODE_CFG_VPG_MODE_Msk 0x100000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_VID_MODE_CFG_RESERVED_23_21_Pos 21UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_VID_MODE_CFG_RESERVED_23_21_Msk 0xE00000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_VID_MODE_CFG_VPG_ORIENTATION_Pos 24UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_VID_MODE_CFG_VPG_ORIENTATION_Msk 0x1000000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_VID_MODE_CFG_RESERVED_31_25_Pos 25UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_VID_MODE_CFG_RESERVED_31_25_Msk 0xFE000000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.VID_PKT_SIZE */
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_SIZE_VID_PKT_SIZE_VID_PKT_SIZE_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_SIZE_VID_PKT_SIZE_VID_PKT_SIZE_Msk 0x3FFFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_SIZE_VID_PKT_SIZE_RESERVED_31_14_Pos 14UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_SIZE_VID_PKT_SIZE_RESERVED_31_14_Msk 0xFFFFC000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.VID_NUM_CHUNKS */
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_NUM_CHUNKS_VID_NUM_CHUNKS_VID_NUM_CHUNKS_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_NUM_CHUNKS_VID_NUM_CHUNKS_VID_NUM_CHUNKS_Msk 0x1FFFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_NUM_CHUNKS_VID_NUM_CHUNKS_RESERVED_31_13_Pos 13UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_NUM_CHUNKS_VID_NUM_CHUNKS_RESERVED_31_13_Msk 0xFFFFE000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.VID_NULL_SIZE */
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_NULL_SIZE_VID_NULL_SIZE_VID_NULL_SIZE_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_NULL_SIZE_VID_NULL_SIZE_VID_NULL_SIZE_Msk 0x1FFFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_NULL_SIZE_VID_NULL_SIZE_RESERVED_31_13_Pos 13UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_NULL_SIZE_VID_NULL_SIZE_RESERVED_31_13_Msk 0xFFFFE000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.VID_HSA_TIME */
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_HSA_TIME_VID_HSA_TIME_VID_HSA_TIME_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_HSA_TIME_VID_HSA_TIME_VID_HSA_TIME_Msk 0xFFFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_HSA_TIME_VID_HSA_TIME_RESERVED_31_12_Pos 12UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_HSA_TIME_VID_HSA_TIME_RESERVED_31_12_Msk 0xFFFFF000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.VID_HBP_TIME */
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_HBP_TIME_VID_HBP_TIME_VID_HBP_TIME_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_HBP_TIME_VID_HBP_TIME_VID_HBP_TIME_Msk 0xFFFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_HBP_TIME_VID_HBP_TIME_RESERVED_31_12_Pos 12UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_HBP_TIME_VID_HBP_TIME_RESERVED_31_12_Msk 0xFFFFF000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.VID_HLINE_TIME */
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_HLINE_TIME_VID_HLINE_TIME_VID_HLINE_TIME_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_HLINE_TIME_VID_HLINE_TIME_VID_HLINE_TIME_Msk 0x7FFFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_HLINE_TIME_VID_HLINE_TIME_RESERVED_31_15_Pos 15UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_HLINE_TIME_VID_HLINE_TIME_RESERVED_31_15_Msk 0xFFFF8000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.VID_VSA_LINES */
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_VSA_LINES_VID_VSA_LINES_VSA_LINES_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_VSA_LINES_VID_VSA_LINES_VSA_LINES_Msk 0x3FFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_VSA_LINES_VID_VSA_LINES_RESERVED_31_10_Pos 10UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_VSA_LINES_VID_VSA_LINES_RESERVED_31_10_Msk 0xFFFFFC00UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.VID_VBP_LINES */
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_VBP_LINES_VID_VBP_LINES_VBP_LINES_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_VBP_LINES_VID_VBP_LINES_VBP_LINES_Msk 0x3FFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_VBP_LINES_VID_VBP_LINES_RESERVED_31_10_Pos 10UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_VBP_LINES_VID_VBP_LINES_RESERVED_31_10_Msk 0xFFFFFC00UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.VID_VFP_LINES */
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_VFP_LINES_VID_VFP_LINES_VFP_LINES_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_VFP_LINES_VID_VFP_LINES_VFP_LINES_Msk 0x3FFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_VFP_LINES_VID_VFP_LINES_RESERVED_31_10_Pos 10UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_VFP_LINES_VID_VFP_LINES_RESERVED_31_10_Msk 0xFFFFFC00UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.VID_VACTIVE_LINES */
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_VACTIVE_LINES_VID_VACTIVE_LINES_V_ACTIVE_LINES_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_VACTIVE_LINES_VID_VACTIVE_LINES_V_ACTIVE_LINES_Msk 0x3FFFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_VACTIVE_LINES_VID_VACTIVE_LINES_RESERVED_31_14_Pos 14UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_VACTIVE_LINES_VID_VACTIVE_LINES_RESERVED_31_14_Msk 0xFFFFC000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.CMD_MODE_CFG */
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_MODE_CFG_CMD_MODE_CFG_TEAR_FX_EN_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_MODE_CFG_CMD_MODE_CFG_TEAR_FX_EN_Msk 0x1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_MODE_CFG_CMD_MODE_CFG_ACK_RQST_EN_Pos 1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_MODE_CFG_CMD_MODE_CFG_ACK_RQST_EN_Msk 0x2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_MODE_CFG_CMD_MODE_CFG_RESERVED_7_2_Pos 2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_MODE_CFG_CMD_MODE_CFG_RESERVED_7_2_Msk 0xFCUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_MODE_CFG_CMD_MODE_CFG_GEN_SW_0P_TX_Pos 8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_MODE_CFG_CMD_MODE_CFG_GEN_SW_0P_TX_Msk 0x100UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_MODE_CFG_CMD_MODE_CFG_GEN_SW_1P_TX_Pos 9UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_MODE_CFG_CMD_MODE_CFG_GEN_SW_1P_TX_Msk 0x200UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_MODE_CFG_CMD_MODE_CFG_GEN_SW_2P_TX_Pos 10UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_MODE_CFG_CMD_MODE_CFG_GEN_SW_2P_TX_Msk 0x400UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_MODE_CFG_CMD_MODE_CFG_GEN_SR_0P_TX_Pos 11UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_MODE_CFG_CMD_MODE_CFG_GEN_SR_0P_TX_Msk 0x800UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_MODE_CFG_CMD_MODE_CFG_GEN_SR_1P_TX_Pos 12UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_MODE_CFG_CMD_MODE_CFG_GEN_SR_1P_TX_Msk 0x1000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_MODE_CFG_CMD_MODE_CFG_GEN_SR_2P_TX_Pos 13UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_MODE_CFG_CMD_MODE_CFG_GEN_SR_2P_TX_Msk 0x2000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_MODE_CFG_CMD_MODE_CFG_GEN_LW_TX_Pos 14UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_MODE_CFG_CMD_MODE_CFG_GEN_LW_TX_Msk 0x4000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_MODE_CFG_CMD_MODE_CFG_RESERVED_15_Pos 15UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_MODE_CFG_CMD_MODE_CFG_RESERVED_15_Msk 0x8000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_MODE_CFG_CMD_MODE_CFG_DCS_SW_0P_TX_Pos 16UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_MODE_CFG_CMD_MODE_CFG_DCS_SW_0P_TX_Msk 0x10000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_MODE_CFG_CMD_MODE_CFG_DCS_SW_1P_TX_Pos 17UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_MODE_CFG_CMD_MODE_CFG_DCS_SW_1P_TX_Msk 0x20000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_MODE_CFG_CMD_MODE_CFG_DCS_SR_0P_TX_Pos 18UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_MODE_CFG_CMD_MODE_CFG_DCS_SR_0P_TX_Msk 0x40000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_MODE_CFG_CMD_MODE_CFG_DCS_LW_TX_Pos 19UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_MODE_CFG_CMD_MODE_CFG_DCS_LW_TX_Msk 0x80000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_MODE_CFG_CMD_MODE_CFG_RESERVED_23_20_Pos 20UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_MODE_CFG_CMD_MODE_CFG_RESERVED_23_20_Msk 0xF00000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_MODE_CFG_CMD_MODE_CFG_MAX_RD_PKT_SIZE_Pos 24UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_MODE_CFG_CMD_MODE_CFG_MAX_RD_PKT_SIZE_Msk 0x1000000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_MODE_CFG_CMD_MODE_CFG_RESERVED_31_25_Pos 25UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_MODE_CFG_CMD_MODE_CFG_RESERVED_31_25_Msk 0xFE000000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.GEN_HDR */
#define GFXSS_MIPIDSI_DWCMIPIDSI_GEN_HDR_GEN_HDR_GEN_DT_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_GEN_HDR_GEN_HDR_GEN_DT_Msk 0x3FUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_GEN_HDR_GEN_HDR_GEN_VC_Pos 6UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_GEN_HDR_GEN_HDR_GEN_VC_Msk 0xC0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_GEN_HDR_GEN_HDR_GEN_WC_LSBYTE_Pos 8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_GEN_HDR_GEN_HDR_GEN_WC_LSBYTE_Msk 0xFF00UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_GEN_HDR_GEN_HDR_GEN_WC_MSBYTE_Pos 16UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_GEN_HDR_GEN_HDR_GEN_WC_MSBYTE_Msk 0xFF0000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_GEN_HDR_GEN_HDR_RESERVED_31_24_Pos 24UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_GEN_HDR_GEN_HDR_RESERVED_31_24_Msk 0xFF000000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.GEN_PLD_DATA */
#define GFXSS_MIPIDSI_DWCMIPIDSI_GEN_PLD_DATA_GEN_PLD_DATA_GEN_PLD_B1_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_GEN_PLD_DATA_GEN_PLD_DATA_GEN_PLD_B1_Msk 0xFFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_GEN_PLD_DATA_GEN_PLD_DATA_GEN_PLD_B2_Pos 8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_GEN_PLD_DATA_GEN_PLD_DATA_GEN_PLD_B2_Msk 0xFF00UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_GEN_PLD_DATA_GEN_PLD_DATA_GEN_PLD_B3_Pos 16UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_GEN_PLD_DATA_GEN_PLD_DATA_GEN_PLD_B3_Msk 0xFF0000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_GEN_PLD_DATA_GEN_PLD_DATA_GEN_PLD_B4_Pos 24UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_GEN_PLD_DATA_GEN_PLD_DATA_GEN_PLD_B4_Msk 0xFF000000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.CMD_PKT_STATUS */
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_GEN_CMD_EMPTY_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_GEN_CMD_EMPTY_Msk 0x1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_GEN_CMD_FULL_Pos 1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_GEN_CMD_FULL_Msk 0x2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_GEN_PLD_W_EMPTY_Pos 2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_GEN_PLD_W_EMPTY_Msk 0x4UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_GEN_PLD_W_FULL_Pos 3UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_GEN_PLD_W_FULL_Msk 0x8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_GEN_PLD_R_EMPTY_Pos 4UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_GEN_PLD_R_EMPTY_Msk 0x10UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_GEN_PLD_R_FULL_Pos 5UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_GEN_PLD_R_FULL_Msk 0x20UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_GEN_RD_CMD_BUSY_Pos 6UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_GEN_RD_CMD_BUSY_Msk 0x40UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_RESERVED_7_Pos 7UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_RESERVED_7_Msk 0x80UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_DBI_CMD_EMPY_Pos 8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_DBI_CMD_EMPY_Msk 0x100UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_DBI_CMD_FULL_Pos 9UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_DBI_CMD_FULL_Msk 0x200UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_DBI_PLD_W_EMPTY_Pos 10UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_DBI_PLD_W_EMPTY_Msk 0x400UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_DBI_PLD_W_FULL_Pos 11UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_DBI_PLD_W_FULL_Msk 0x800UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_DBI_PLD_R_EMPTY_Pos 12UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_DBI_PLD_R_EMPTY_Msk 0x1000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_DBI_PLD_R_FULL_Pos 13UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_DBI_PLD_R_FULL_Msk 0x2000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_DBI_RD_CMD_BUSY_Pos 14UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_DBI_RD_CMD_BUSY_Msk 0x4000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_RESERVED_15_Pos 15UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_RESERVED_15_Msk 0x8000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_GEN_BUFF_CMD_EMPTY_Pos 16UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_GEN_BUFF_CMD_EMPTY_Msk 0x10000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_GEN_BUFF_CMD_FULL_Pos 17UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_GEN_BUFF_CMD_FULL_Msk 0x20000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_GEN_BUFF_PLD_EMPTY_Pos 18UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_GEN_BUFF_PLD_EMPTY_Msk 0x40000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_GEN_BUFF_PLD_FULL_Pos 19UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_GEN_BUFF_PLD_FULL_Msk 0x80000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_RESERVED_23_20_Pos 20UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_RESERVED_23_20_Msk 0xF00000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_DBI_BUFF_CMD_EMPTY_Pos 24UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_DBI_BUFF_CMD_EMPTY_Msk 0x1000000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_DBI_BUFF_CMD_FULL_Pos 25UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_DBI_BUFF_CMD_FULL_Msk 0x2000000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_DBI_BUFF_PLD_EMPTY_Pos 26UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_DBI_BUFF_PLD_EMPTY_Msk 0x4000000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_DBI_BUFF_PLD_FULL_Pos 27UL
