PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_gfxss.h
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_DBI_BUFF_PLD_FULL_Msk 0x8000000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_RESERVED_31_28_Pos 28UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_RESERVED_31_28_Msk 0xF0000000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.TO_CNT_CFG */
#define GFXSS_MIPIDSI_DWCMIPIDSI_TO_CNT_CFG_TO_CNT_CFG_LPRX_TO_CNT_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_TO_CNT_CFG_TO_CNT_CFG_LPRX_TO_CNT_Msk 0xFFFFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_TO_CNT_CFG_TO_CNT_CFG_HSTX_TO_CNT_Pos 16UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_TO_CNT_CFG_TO_CNT_CFG_HSTX_TO_CNT_Msk 0xFFFF0000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.HS_RD_TO_CNT */
#define GFXSS_MIPIDSI_DWCMIPIDSI_HS_RD_TO_CNT_HS_RD_TO_CNT_HS_RD_TO_CNT_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_HS_RD_TO_CNT_HS_RD_TO_CNT_HS_RD_TO_CNT_Msk 0xFFFFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_HS_RD_TO_CNT_HS_RD_TO_CNT_RESERVED_31_16_Pos 16UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_HS_RD_TO_CNT_HS_RD_TO_CNT_RESERVED_31_16_Msk 0xFFFF0000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.LP_RD_TO_CNT */
#define GFXSS_MIPIDSI_DWCMIPIDSI_LP_RD_TO_CNT_LP_RD_TO_CNT_LP_RD_TO_CNT_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_LP_RD_TO_CNT_LP_RD_TO_CNT_LP_RD_TO_CNT_Msk 0xFFFFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_LP_RD_TO_CNT_LP_RD_TO_CNT_RESERVED_31_16_Pos 16UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_LP_RD_TO_CNT_LP_RD_TO_CNT_RESERVED_31_16_Msk 0xFFFF0000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.HS_WR_TO_CNT */
#define GFXSS_MIPIDSI_DWCMIPIDSI_HS_WR_TO_CNT_HS_WR_TO_CNT_HS_WR_TO_CNT_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_HS_WR_TO_CNT_HS_WR_TO_CNT_HS_WR_TO_CNT_Msk 0xFFFFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_HS_WR_TO_CNT_HS_WR_TO_CNT_RESERVED_23_16_Pos 16UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_HS_WR_TO_CNT_HS_WR_TO_CNT_RESERVED_23_16_Msk 0xFF0000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_HS_WR_TO_CNT_HS_WR_TO_CNT_RESERVED_24_Pos 24UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_HS_WR_TO_CNT_HS_WR_TO_CNT_RESERVED_24_Msk 0x1000000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_HS_WR_TO_CNT_HS_WR_TO_CNT_RESERVED_31_25_Pos 25UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_HS_WR_TO_CNT_HS_WR_TO_CNT_RESERVED_31_25_Msk 0xFE000000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.LP_WR_TO_CNT */
#define GFXSS_MIPIDSI_DWCMIPIDSI_LP_WR_TO_CNT_LP_WR_TO_CNT_LP_WR_TO_CNT_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_LP_WR_TO_CNT_LP_WR_TO_CNT_LP_WR_TO_CNT_Msk 0xFFFFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_LP_WR_TO_CNT_LP_WR_TO_CNT_RESERVED_31_16_Pos 16UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_LP_WR_TO_CNT_LP_WR_TO_CNT_RESERVED_31_16_Msk 0xFFFF0000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.BTA_TO_CNT */
#define GFXSS_MIPIDSI_DWCMIPIDSI_BTA_TO_CNT_BTA_TO_CNT_BTA_TO_CNT_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_BTA_TO_CNT_BTA_TO_CNT_BTA_TO_CNT_Msk 0xFFFFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_BTA_TO_CNT_BTA_TO_CNT_RESERVED_31_16_Pos 16UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_BTA_TO_CNT_BTA_TO_CNT_RESERVED_31_16_Msk 0xFFFF0000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.SDF_3D */
#define GFXSS_MIPIDSI_DWCMIPIDSI_SDF_3D_SDF_3D_MODE_3D_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_SDF_3D_SDF_3D_MODE_3D_Msk 0x3UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_SDF_3D_SDF_3D_FORMAT_3D_Pos 2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_SDF_3D_SDF_3D_FORMAT_3D_Msk 0xCUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_SDF_3D_SDF_3D_SECOND_VSYNC_Pos 4UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_SDF_3D_SDF_3D_SECOND_VSYNC_Msk 0x10UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_SDF_3D_SDF_3D_RIGHT_FIRST_Pos 5UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_SDF_3D_SDF_3D_RIGHT_FIRST_Msk 0x20UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_SDF_3D_SDF_3D_RESERVED_15_6_Pos 6UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_SDF_3D_SDF_3D_RESERVED_15_6_Msk 0xFFC0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_SDF_3D_SDF_3D_SEND_3D_CFG_Pos 16UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_SDF_3D_SDF_3D_SEND_3D_CFG_Msk 0x10000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_SDF_3D_SDF_3D_RESERVED_31_17_Pos 17UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_SDF_3D_SDF_3D_RESERVED_31_17_Msk 0xFFFE0000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.LPCLK_CTRL */
#define GFXSS_MIPIDSI_DWCMIPIDSI_LPCLK_CTRL_LPCLK_CTRL_PHY_TXREQUESTCLKHS_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_LPCLK_CTRL_LPCLK_CTRL_PHY_TXREQUESTCLKHS_Msk 0x1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_LPCLK_CTRL_LPCLK_CTRL_AUTO_CLKLANE_CTRL_Pos 1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_LPCLK_CTRL_LPCLK_CTRL_AUTO_CLKLANE_CTRL_Msk 0x2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_LPCLK_CTRL_LPCLK_CTRL_RESERVED_31_2_Pos 2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_LPCLK_CTRL_LPCLK_CTRL_RESERVED_31_2_Msk 0xFFFFFFFCUL
/* GFXSS_MIPIDSI_DWCMIPIDSI.PHY_TMR_LPCLK_CFG */
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TMR_LPCLK_CFG_PHY_TMR_LPCLK_CFG_PHY_CLKLP2HS_TIME_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TMR_LPCLK_CFG_PHY_TMR_LPCLK_CFG_PHY_CLKLP2HS_TIME_Msk 0x3FFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TMR_LPCLK_CFG_PHY_TMR_LPCLK_CFG_RESERVED_15_10_Pos 10UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TMR_LPCLK_CFG_PHY_TMR_LPCLK_CFG_RESERVED_15_10_Msk 0xFC00UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TMR_LPCLK_CFG_PHY_TMR_LPCLK_CFG_PHY_CLKHS2LP_TIME_Pos 16UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TMR_LPCLK_CFG_PHY_TMR_LPCLK_CFG_PHY_CLKHS2LP_TIME_Msk 0x3FF0000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TMR_LPCLK_CFG_PHY_TMR_LPCLK_CFG_RESERVED_31_26_Pos 26UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TMR_LPCLK_CFG_PHY_TMR_LPCLK_CFG_RESERVED_31_26_Msk 0xFC000000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.PHY_TMR_CFG */
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TMR_CFG_PHY_TMR_CFG_PHY_LP2HS_TIME_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TMR_CFG_PHY_TMR_CFG_PHY_LP2HS_TIME_Msk 0x3FFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TMR_CFG_PHY_TMR_CFG_RESERVED_15_10_Pos 10UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TMR_CFG_PHY_TMR_CFG_RESERVED_15_10_Msk 0xFC00UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TMR_CFG_PHY_TMR_CFG_PHY_HS2LP_TIME_Pos 16UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TMR_CFG_PHY_TMR_CFG_PHY_HS2LP_TIME_Msk 0x3FF0000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TMR_CFG_PHY_TMR_CFG_RESERVED_31_26_Pos 26UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TMR_CFG_PHY_TMR_CFG_RESERVED_31_26_Msk 0xFC000000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.PHY_RSTZ */
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_RSTZ_PHY_RSTZ_PHY_SHUTDOWNZ_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_RSTZ_PHY_RSTZ_PHY_SHUTDOWNZ_Msk 0x1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_RSTZ_PHY_RSTZ_PHY_RSTZ_Pos 1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_RSTZ_PHY_RSTZ_PHY_RSTZ_Msk 0x2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_RSTZ_PHY_RSTZ_PHY_ENABLECLK_Pos 2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_RSTZ_PHY_RSTZ_PHY_ENABLECLK_Msk 0x4UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_RSTZ_PHY_RSTZ_PHY_FORCEPLL_Pos 3UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_RSTZ_PHY_RSTZ_PHY_FORCEPLL_Msk 0x8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_RSTZ_PHY_RSTZ_RESERVED_31_4_Pos 4UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_RSTZ_PHY_RSTZ_RESERVED_31_4_Msk 0xFFFFFFF0UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.PHY_IF_CFG */
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_IF_CFG_PHY_IF_CFG_N_LANES_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_IF_CFG_PHY_IF_CFG_N_LANES_Msk 0x3UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_IF_CFG_PHY_IF_CFG_RESERVED_7_2_Pos 2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_IF_CFG_PHY_IF_CFG_RESERVED_7_2_Msk 0xFCUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_IF_CFG_PHY_IF_CFG_PHY_STOP_WAIT_TIME_Pos 8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_IF_CFG_PHY_IF_CFG_PHY_STOP_WAIT_TIME_Msk 0xFF00UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_IF_CFG_PHY_IF_CFG_RESERVED_31_16_Pos 16UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_IF_CFG_PHY_IF_CFG_RESERVED_31_16_Msk 0xFFFF0000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.PHY_ULPS_CTRL */
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_ULPS_CTRL_PHY_ULPS_CTRL_PHY_TXREQULPSCLK_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_ULPS_CTRL_PHY_ULPS_CTRL_PHY_TXREQULPSCLK_Msk 0x1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_ULPS_CTRL_PHY_ULPS_CTRL_PHY_TXEXITULPSCLK_Pos 1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_ULPS_CTRL_PHY_ULPS_CTRL_PHY_TXEXITULPSCLK_Msk 0x2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_ULPS_CTRL_PHY_ULPS_CTRL_PHY_TXREQULPSLAN_Pos 2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_ULPS_CTRL_PHY_ULPS_CTRL_PHY_TXREQULPSLAN_Msk 0x4UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_ULPS_CTRL_PHY_ULPS_CTRL_PHY_TXEXITULPSLAN_Pos 3UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_ULPS_CTRL_PHY_ULPS_CTRL_PHY_TXEXITULPSLAN_Msk 0x8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_ULPS_CTRL_PHY_ULPS_CTRL_RESERVED_31_4_Pos 4UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_ULPS_CTRL_PHY_ULPS_CTRL_RESERVED_31_4_Msk 0xFFFFFFF0UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.PHY_TX_TRIGGERS */
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TX_TRIGGERS_PHY_TX_TRIGGERS_PHY_TX_TRIGGERS_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TX_TRIGGERS_PHY_TX_TRIGGERS_PHY_TX_TRIGGERS_Msk 0xFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TX_TRIGGERS_PHY_TX_TRIGGERS_RESERVED_31_4_Pos 4UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TX_TRIGGERS_PHY_TX_TRIGGERS_RESERVED_31_4_Msk 0xFFFFFFF0UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.PHY_STATUS */
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_STATUS_PHY_STATUS_PHY_LOCK_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_STATUS_PHY_STATUS_PHY_LOCK_Msk 0x1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_STATUS_PHY_STATUS_PHY_DIRECTION_Pos 1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_STATUS_PHY_STATUS_PHY_DIRECTION_Msk 0x2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_STATUS_PHY_STATUS_PHY_STOPSTATECLKLANE_Pos 2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_STATUS_PHY_STATUS_PHY_STOPSTATECLKLANE_Msk 0x4UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_STATUS_PHY_STATUS_PHY_ULPSACTIVENOTCLK_Pos 3UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_STATUS_PHY_STATUS_PHY_ULPSACTIVENOTCLK_Msk 0x8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_STATUS_PHY_STATUS_PHY_STOPSTATE0LANE_Pos 4UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_STATUS_PHY_STATUS_PHY_STOPSTATE0LANE_Msk 0x10UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_STATUS_PHY_STATUS_PHY_ULPSACTIVENOT0LANE_Pos 5UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_STATUS_PHY_STATUS_PHY_ULPSACTIVENOT0LANE_Msk 0x20UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_STATUS_PHY_STATUS_PHY_RXULPSESC0LANE_Pos 6UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_STATUS_PHY_STATUS_PHY_RXULPSESC0LANE_Msk 0x40UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_STATUS_PHY_STATUS_PHY_STOPSTATE1LANE_Pos 7UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_STATUS_PHY_STATUS_PHY_STOPSTATE1LANE_Msk 0x80UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_STATUS_PHY_STATUS_PHY_ULPSACTIVENOT1LANE_Pos 8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_STATUS_PHY_STATUS_PHY_ULPSACTIVENOT1LANE_Msk 0x100UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_STATUS_PHY_STATUS_RESERVED_9_Pos 9UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_STATUS_PHY_STATUS_RESERVED_9_Msk 0x200UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_STATUS_PHY_STATUS_RESERVED_10_Pos 10UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_STATUS_PHY_STATUS_RESERVED_10_Msk 0x400UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_STATUS_PHY_STATUS_RESERVED_11_Pos 11UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_STATUS_PHY_STATUS_RESERVED_11_Msk 0x800UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_STATUS_PHY_STATUS_RESERVED_12_Pos 12UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_STATUS_PHY_STATUS_RESERVED_12_Msk 0x1000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_STATUS_PHY_STATUS_RESERVED_31_13_Pos 13UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_STATUS_PHY_STATUS_RESERVED_31_13_Msk 0xFFFFE000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.PHY_TST_CTRL0 */
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TST_CTRL0_PHY_TST_CTRL0_PHY_TESTCLR_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TST_CTRL0_PHY_TST_CTRL0_PHY_TESTCLR_Msk 0x1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TST_CTRL0_PHY_TST_CTRL0_PHY_TESTCLK_Pos 1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TST_CTRL0_PHY_TST_CTRL0_PHY_TESTCLK_Msk 0x2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TST_CTRL0_PHY_TST_CTRL0_RESERVED_31_2_Pos 2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TST_CTRL0_PHY_TST_CTRL0_RESERVED_31_2_Msk 0xFFFFFFFCUL
/* GFXSS_MIPIDSI_DWCMIPIDSI.PHY_TST_CTRL1 */
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TST_CTRL1_PHY_TST_CTRL1_PHY_TESTDIN_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TST_CTRL1_PHY_TST_CTRL1_PHY_TESTDIN_Msk 0xFFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TST_CTRL1_PHY_TST_CTRL1_PHT_TESTDOUT_Pos 8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TST_CTRL1_PHY_TST_CTRL1_PHT_TESTDOUT_Msk 0xFF00UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TST_CTRL1_PHY_TST_CTRL1_PHY_TESTEN_Pos 16UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TST_CTRL1_PHY_TST_CTRL1_PHY_TESTEN_Msk 0x10000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TST_CTRL1_PHY_TST_CTRL1_PHY_TESTSEL_Pos 17UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TST_CTRL1_PHY_TST_CTRL1_PHY_TESTSEL_Msk 0x20000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TST_CTRL1_PHY_TST_CTRL1_RESERVED_31_18_Pos 18UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TST_CTRL1_PHY_TST_CTRL1_RESERVED_31_18_Msk 0xFFFC0000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.INT_ST0 */
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_ACK_WITH_ERR_0_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_ACK_WITH_ERR_0_Msk 0x1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_ACK_WITH_ERR_1_Pos 1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_ACK_WITH_ERR_1_Msk 0x2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_ACK_WITH_ERR_2_Pos 2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_ACK_WITH_ERR_2_Msk 0x4UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_ACK_WITH_ERR_3_Pos 3UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_ACK_WITH_ERR_3_Msk 0x8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_ACK_WITH_ERR_4_Pos 4UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_ACK_WITH_ERR_4_Msk 0x10UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_ACK_WITH_ERR_5_Pos 5UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_ACK_WITH_ERR_5_Msk 0x20UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_ACK_WITH_ERR_6_Pos 6UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_ACK_WITH_ERR_6_Msk 0x40UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_ACK_WITH_ERR_7_Pos 7UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_ACK_WITH_ERR_7_Msk 0x80UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_ACK_WITH_ERR_8_Pos 8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_ACK_WITH_ERR_8_Msk 0x100UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_ACK_WITH_ERR_9_Pos 9UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_ACK_WITH_ERR_9_Msk 0x200UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_ACK_WITH_ERR_10_Pos 10UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_ACK_WITH_ERR_10_Msk 0x400UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_ACK_WITH_ERR_11_Pos 11UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_ACK_WITH_ERR_11_Msk 0x800UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_ACK_WITH_ERR_12_Pos 12UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_ACK_WITH_ERR_12_Msk 0x1000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_ACK_WITH_ERR_13_Pos 13UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_ACK_WITH_ERR_13_Msk 0x2000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_ACK_WITH_ERR_14_Pos 14UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_ACK_WITH_ERR_14_Msk 0x4000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_ACK_WITH_ERR_15_Pos 15UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_ACK_WITH_ERR_15_Msk 0x8000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_DPHY_ERRORS_0_Pos 16UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_DPHY_ERRORS_0_Msk 0x10000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_DPHY_ERRORS_1_Pos 17UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_DPHY_ERRORS_1_Msk 0x20000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_DPHY_ERRORS_2_Pos 18UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_DPHY_ERRORS_2_Msk 0x40000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_DPHY_ERRORS_3_Pos 19UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_DPHY_ERRORS_3_Msk 0x80000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_DPHY_ERRORS_4_Pos 20UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_DPHY_ERRORS_4_Msk 0x100000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_RESERVED_31_21_Pos 21UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST0_INT_ST0_RESERVED_31_21_Msk 0xFFE00000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.INT_ST1 */
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_TO_HS_TX_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_TO_HS_TX_Msk 0x1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_TO_LP_RX_Pos 1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_TO_LP_RX_Msk 0x2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_ECC_SINGLE_ERR_Pos 2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_ECC_SINGLE_ERR_Msk 0x4UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_ECC_MULTPL_ERR_Pos 3UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_ECC_MULTPL_ERR_Msk 0x8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_CRC_ERR_Pos 4UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_CRC_ERR_Msk 0x10UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_PKT_SIZE_ERR_Pos 5UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_PKT_SIZE_ERR_Msk 0x20UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_EOPT_ERR_Pos 6UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_EOPT_ERR_Msk 0x40UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_DPI_PLD_WR_ERR_Pos 7UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_DPI_PLD_WR_ERR_Msk 0x80UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_GEN_CMD_WR_ERR_Pos 8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_GEN_CMD_WR_ERR_Msk 0x100UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_GEN_PLD_WR_ERR_Pos 9UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_GEN_PLD_WR_ERR_Msk 0x200UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_GEN_PLD_SEND_ERR_Pos 10UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_GEN_PLD_SEND_ERR_Msk 0x400UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_GEN_PLD_RD_ERR_Pos 11UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_GEN_PLD_RD_ERR_Msk 0x800UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_GEN_PLD_RECEV_ERR_Pos 12UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_GEN_PLD_RECEV_ERR_Msk 0x1000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_DBI_CMD_WR_ERR_Pos 13UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_DBI_CMD_WR_ERR_Msk 0x2000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_DBI_PLD_WR_ERR_Pos 14UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_DBI_PLD_WR_ERR_Msk 0x4000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_DBI_PLD_RD_ERR_Pos 15UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_DBI_PLD_RD_ERR_Msk 0x8000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_DBI_PLD_RECV_ERR_Pos 16UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_DBI_PLD_RECV_ERR_Msk 0x10000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_DBI_ILEGAL_COMM_ERR_Pos 17UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_DBI_ILEGAL_COMM_ERR_Msk 0x20000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_RESERVED_18_Pos 18UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_RESERVED_18_Msk 0x40000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_DPI_BUFF_PLD_UNDER_Pos 19UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_DPI_BUFF_PLD_UNDER_Msk 0x80000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_RESERVED_20_Pos 20UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_RESERVED_20_Msk 0x100000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_RESERVED_31_21_Pos 21UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_ST1_INT_ST1_RESERVED_31_21_Msk 0xFFE00000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.INT_MSK0 */
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_ACK_WITH_ERR_0_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_ACK_WITH_ERR_0_Msk 0x1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_ACK_WITH_ERR_1_Pos 1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_ACK_WITH_ERR_1_Msk 0x2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_ACK_WITH_ERR_2_Pos 2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_ACK_WITH_ERR_2_Msk 0x4UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_ACK_WITH_ERR_3_Pos 3UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_ACK_WITH_ERR_3_Msk 0x8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_ACK_WITH_ERR_4_Pos 4UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_ACK_WITH_ERR_4_Msk 0x10UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_ACK_WITH_ERR_5_Pos 5UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_ACK_WITH_ERR_5_Msk 0x20UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_ACK_WITH_ERR_6_Pos 6UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_ACK_WITH_ERR_6_Msk 0x40UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_ACK_WITH_ERR_7_Pos 7UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_ACK_WITH_ERR_7_Msk 0x80UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_ACK_WITH_ERR_8_Pos 8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_ACK_WITH_ERR_8_Msk 0x100UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_ACK_WITH_ERR_9_Pos 9UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_ACK_WITH_ERR_9_Msk 0x200UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_ACK_WITH_ERR_10_Pos 10UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_ACK_WITH_ERR_10_Msk 0x400UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_ACK_WITH_ERR_11_Pos 11UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_ACK_WITH_ERR_11_Msk 0x800UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_ACK_WITH_ERR_12_Pos 12UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_ACK_WITH_ERR_12_Msk 0x1000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_ACK_WITH_ERR_13_Pos 13UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_ACK_WITH_ERR_13_Msk 0x2000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_ACK_WITH_ERR_14_Pos 14UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_ACK_WITH_ERR_14_Msk 0x4000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_ACK_WITH_ERR_15_Pos 15UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_ACK_WITH_ERR_15_Msk 0x8000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_DPHY_ERRORS_0_Pos 16UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_DPHY_ERRORS_0_Msk 0x10000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_DPHY_ERRORS_1_Pos 17UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_DPHY_ERRORS_1_Msk 0x20000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_DPHY_ERRORS_2_Pos 18UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_DPHY_ERRORS_2_Msk 0x40000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_DPHY_ERRORS_3_Pos 19UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_DPHY_ERRORS_3_Msk 0x80000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_DPHY_ERRORS_4_Pos 20UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_MASK_DPHY_ERRORS_4_Msk 0x100000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_RESERVED_31_21_Pos 21UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK0_INT_MSK0_RESERVED_31_21_Msk 0xFFE00000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.INT_MSK1 */
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_TO_HS_TX_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_TO_HS_TX_Msk 0x1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_TO_LP_RX_Pos 1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_TO_LP_RX_Msk 0x2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_ECC_SINGLE_ERR_Pos 2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_ECC_SINGLE_ERR_Msk 0x4UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_ECC_MULTPL_ERR_Pos 3UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_ECC_MULTPL_ERR_Msk 0x8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_CRC_ERR_Pos 4UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_CRC_ERR_Msk 0x10UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_PKT_SIZE_ERR_Pos 5UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_PKT_SIZE_ERR_Msk 0x20UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_EOPT_ERR_Pos 6UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_EOPT_ERR_Msk 0x40UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_DPI_PLD_WR_ERR_Pos 7UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_DPI_PLD_WR_ERR_Msk 0x80UL
