PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_gfxss.h
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_GEN_CMD_WR_ERR_Pos 8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_GEN_CMD_WR_ERR_Msk 0x100UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_GEN_PLD_WR_ERR_Pos 9UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_GEN_PLD_WR_ERR_Msk 0x200UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_GEN_PLD_SEND_ERR_Pos 10UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_GEN_PLD_SEND_ERR_Msk 0x400UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_GEN_PLD_RD_ERR_Pos 11UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_GEN_PLD_RD_ERR_Msk 0x800UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_GEN_PLD_RECEV_ERR_Pos 12UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_GEN_PLD_RECEV_ERR_Msk 0x1000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_DBI_CMD_WR_ERR_Pos 13UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_DBI_CMD_WR_ERR_Msk 0x2000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_DBI_PLD_WR_ERR_Pos 14UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_DBI_PLD_WR_ERR_Msk 0x4000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_DBI_PLD_RD_ERR_Pos 15UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_DBI_PLD_RD_ERR_Msk 0x8000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_DBI_PLD_RECV_ERR_Pos 16UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_DBI_PLD_RECV_ERR_Msk 0x10000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_DBI_ILEGAL_COMM_ERR_Pos 17UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_DBI_ILEGAL_COMM_ERR_Msk 0x20000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_RESERVED_18_Pos 18UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_RESERVED_18_Msk 0x40000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_DPI_BUFF_PLD_UNDER_Pos 19UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_MASK_DPI_BUFF_PLD_UNDER_Msk 0x80000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_RESERVED_20_Pos 20UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_RESERVED_20_Msk 0x100000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_RESERVED_31_21_Pos 21UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_MSK1_INT_MSK1_RESERVED_31_21_Msk 0xFFE00000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.PHY_CAL */
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_CAL_PHY_CAL_TXSKEWCALHS_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_CAL_PHY_CAL_TXSKEWCALHS_Msk 0x1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_CAL_PHY_CAL_RESERVED_31_1_Pos 1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_CAL_PHY_CAL_RESERVED_31_1_Msk 0xFFFFFFFEUL
/* GFXSS_MIPIDSI_DWCMIPIDSI.INT_FORCE0 */
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_ACK_WITH_ERR_0_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_ACK_WITH_ERR_0_Msk 0x1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_ACK_WITH_ERR_1_Pos 1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_ACK_WITH_ERR_1_Msk 0x2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_ACK_WITH_ERR_2_Pos 2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_ACK_WITH_ERR_2_Msk 0x4UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_ACK_WITH_ERR_3_Pos 3UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_ACK_WITH_ERR_3_Msk 0x8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_ACK_WITH_ERR_4_Pos 4UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_ACK_WITH_ERR_4_Msk 0x10UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_ACK_WITH_ERR_5_Pos 5UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_ACK_WITH_ERR_5_Msk 0x20UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_ACK_WITH_ERR_6_Pos 6UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_ACK_WITH_ERR_6_Msk 0x40UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_ACK_WITH_ERR_7_Pos 7UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_ACK_WITH_ERR_7_Msk 0x80UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_ACK_WITH_ERR_8_Pos 8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_ACK_WITH_ERR_8_Msk 0x100UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_ACK_WITH_ERR_9_Pos 9UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_ACK_WITH_ERR_9_Msk 0x200UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_ACK_WITH_ERR_10_Pos 10UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_ACK_WITH_ERR_10_Msk 0x400UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_ACK_WITH_ERR_11_Pos 11UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_ACK_WITH_ERR_11_Msk 0x800UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_ACK_WITH_ERR_12_Pos 12UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_ACK_WITH_ERR_12_Msk 0x1000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_ACK_WITH_ERR_13_Pos 13UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_ACK_WITH_ERR_13_Msk 0x2000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_ACK_WITH_ERR_14_Pos 14UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_ACK_WITH_ERR_14_Msk 0x4000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_ACK_WITH_ERR_15_Pos 15UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_ACK_WITH_ERR_15_Msk 0x8000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_DPHY_ERRORS_0_Pos 16UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_DPHY_ERRORS_0_Msk 0x10000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_DPHY_ERRORS_1_Pos 17UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_DPHY_ERRORS_1_Msk 0x20000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_DPHY_ERRORS_2_Pos 18UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_DPHY_ERRORS_2_Msk 0x40000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_DPHY_ERRORS_3_Pos 19UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_DPHY_ERRORS_3_Msk 0x80000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_DPHY_ERRORS_4_Pos 20UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_FORCE_DPHY_ERRORS_4_Msk 0x100000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_RESERVED_31_21_Pos 21UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE0_INT_FORCE0_RESERVED_31_21_Msk 0xFFE00000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.INT_FORCE1 */
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_TO_HS_TX_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_TO_HS_TX_Msk 0x1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_TO_LP_RX_Pos 1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_TO_LP_RX_Msk 0x2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_ECC_SINGLE_ERR_Pos 2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_ECC_SINGLE_ERR_Msk 0x4UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_ECC_MULTPL_ERR_Pos 3UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_ECC_MULTPL_ERR_Msk 0x8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_CRC_ERR_Pos 4UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_CRC_ERR_Msk 0x10UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_PKT_SIZE_ERR_Pos 5UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_PKT_SIZE_ERR_Msk 0x20UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_EOPT_ERR_Pos 6UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_EOPT_ERR_Msk 0x40UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_DPI_PLD_WR_ERR_Pos 7UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_DPI_PLD_WR_ERR_Msk 0x80UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_GEN_CMD_WR_ERR_Pos 8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_GEN_CMD_WR_ERR_Msk 0x100UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_GEN_PLD_WR_ERR_Pos 9UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_GEN_PLD_WR_ERR_Msk 0x200UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_GEN_PLD_SEND_ERR_Pos 10UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_GEN_PLD_SEND_ERR_Msk 0x400UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_GEN_PLD_RD_ERR_Pos 11UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_GEN_PLD_RD_ERR_Msk 0x800UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_GEN_PLD_RECEV_ERR_Pos 12UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_GEN_PLD_RECEV_ERR_Msk 0x1000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_DBI_CMD_WR_ERR_Pos 13UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_DBI_CMD_WR_ERR_Msk 0x2000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_DBI_PLD_WR_ERR_Pos 14UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_DBI_PLD_WR_ERR_Msk 0x4000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_DBI_PLD_RD_ERR_Pos 15UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_DBI_PLD_RD_ERR_Msk 0x8000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_DBI_PLD_RECV_ERR_Pos 16UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_DBI_PLD_RECV_ERR_Msk 0x10000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_DBI_ILEGAL_COMM_ERR_Pos 17UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_DBI_ILEGAL_COMM_ERR_Msk 0x20000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_RESERVED_18_Pos 18UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_RESERVED_18_Msk 0x40000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_DPI_BUFF_PLD_UNDER_Pos 19UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_FORCE_DPI_BUFF_PLD_UNDER_Msk 0x80000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_RESERVED_20_Pos 20UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_RESERVED_20_Msk 0x100000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_RESERVED_31_21_Pos 21UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_INT_FORCE1_INT_FORCE1_RESERVED_31_21_Msk 0xFFE00000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.DSC_PARAMETER */
#define GFXSS_MIPIDSI_DWCMIPIDSI_DSC_PARAMETER_DSC_PARAMETER_COMPRESSION_MODE_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DSC_PARAMETER_DSC_PARAMETER_COMPRESSION_MODE_Msk 0x1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DSC_PARAMETER_DSC_PARAMETER_RESERVED_7_1_Pos 1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DSC_PARAMETER_DSC_PARAMETER_RESERVED_7_1_Msk 0xFEUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DSC_PARAMETER_DSC_PARAMETER_COMPRESS_ALGO_Pos 8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DSC_PARAMETER_DSC_PARAMETER_COMPRESS_ALGO_Msk 0x300UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DSC_PARAMETER_DSC_PARAMETER_RESERVED_15_10_Pos 10UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DSC_PARAMETER_DSC_PARAMETER_RESERVED_15_10_Msk 0xFC00UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DSC_PARAMETER_DSC_PARAMETER_PPS_SEL_Pos 16UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DSC_PARAMETER_DSC_PARAMETER_PPS_SEL_Msk 0x30000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DSC_PARAMETER_DSC_PARAMETER_RESERVED_31_18_Pos 18UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DSC_PARAMETER_DSC_PARAMETER_RESERVED_31_18_Msk 0xFFFC0000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.PHY_TMR_RD_CFG */
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TMR_RD_CFG_PHY_TMR_RD_CFG_MAX_RD_TIME_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TMR_RD_CFG_PHY_TMR_RD_CFG_MAX_RD_TIME_Msk 0x7FFFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TMR_RD_CFG_PHY_TMR_RD_CFG_RESERVED_31_15_Pos 15UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_PHY_TMR_RD_CFG_PHY_TMR_RD_CFG_RESERVED_31_15_Msk 0xFFFF8000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.VID_SHADOW_CTRL */
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_SHADOW_CTRL_VID_SHADOW_CTRL_VID_SHADOW_EN_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_SHADOW_CTRL_VID_SHADOW_CTRL_VID_SHADOW_EN_Msk 0x1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_SHADOW_CTRL_VID_SHADOW_CTRL_RESERVED_7_1_Pos 1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_SHADOW_CTRL_VID_SHADOW_CTRL_RESERVED_7_1_Msk 0xFEUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_SHADOW_CTRL_VID_SHADOW_CTRL_VID_SHADOW_REQ_Pos 8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_SHADOW_CTRL_VID_SHADOW_CTRL_VID_SHADOW_REQ_Msk 0x100UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_SHADOW_CTRL_VID_SHADOW_CTRL_RESERVED_15_9_Pos 9UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_SHADOW_CTRL_VID_SHADOW_CTRL_RESERVED_15_9_Msk 0xFE00UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_SHADOW_CTRL_VID_SHADOW_CTRL_VID_SHADOW_PIN_REQ_Pos 16UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_SHADOW_CTRL_VID_SHADOW_CTRL_VID_SHADOW_PIN_REQ_Msk 0x10000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_SHADOW_CTRL_VID_SHADOW_CTRL_RESERVED_31_17_Pos 17UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_SHADOW_CTRL_VID_SHADOW_CTRL_RESERVED_31_17_Msk 0xFFFE0000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.DPI_VCID_ACT */
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_VCID_ACT_DPI_VCID_ACT_DPI_VCID_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_VCID_ACT_DPI_VCID_ACT_DPI_VCID_Msk 0x3UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_VCID_ACT_DPI_VCID_ACT_RESERVED_31_2_Pos 2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_VCID_ACT_DPI_VCID_ACT_RESERVED_31_2_Msk 0xFFFFFFFCUL
/* GFXSS_MIPIDSI_DWCMIPIDSI.DPI_COLOR_CODING_ACT */
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_COLOR_CODING_ACT_DPI_COLOR_CODING_ACT_DPI_COLOR_CODING_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_COLOR_CODING_ACT_DPI_COLOR_CODING_ACT_DPI_COLOR_CODING_Msk 0xFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_COLOR_CODING_ACT_DPI_COLOR_CODING_ACT_RESERVED_7_4_Pos 4UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_COLOR_CODING_ACT_DPI_COLOR_CODING_ACT_RESERVED_7_4_Msk 0xF0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_COLOR_CODING_ACT_DPI_COLOR_CODING_ACT_LOOSELY18_EN_Pos 8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_COLOR_CODING_ACT_DPI_COLOR_CODING_ACT_LOOSELY18_EN_Msk 0x100UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_COLOR_CODING_ACT_DPI_COLOR_CODING_ACT_RESERVED_31_9_Pos 9UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_COLOR_CODING_ACT_DPI_COLOR_CODING_ACT_RESERVED_31_9_Msk 0xFFFFFE00UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.DPI_LP_CMD_TIM_ACT */
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_LP_CMD_TIM_ACT_DPI_LP_CMD_TIM_ACT_INVACT_LPCMD_TIME_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_LP_CMD_TIM_ACT_DPI_LP_CMD_TIM_ACT_INVACT_LPCMD_TIME_Msk 0xFFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_LP_CMD_TIM_ACT_DPI_LP_CMD_TIM_ACT_RESERVED_15_8_Pos 8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_LP_CMD_TIM_ACT_DPI_LP_CMD_TIM_ACT_RESERVED_15_8_Msk 0xFF00UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_LP_CMD_TIM_ACT_DPI_LP_CMD_TIM_ACT_OUTVACT_LPCMD_TIME_Pos 16UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_LP_CMD_TIM_ACT_DPI_LP_CMD_TIM_ACT_OUTVACT_LPCMD_TIME_Msk 0xFF0000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_LP_CMD_TIM_ACT_DPI_LP_CMD_TIM_ACT_RESERVED_31_24_Pos 24UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_DPI_LP_CMD_TIM_ACT_DPI_LP_CMD_TIM_ACT_RESERVED_31_24_Msk 0xFF000000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.VID_MODE_CFG_ACT */
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_ACT_VID_MODE_CFG_ACT_VID_MODE_TYPE_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_ACT_VID_MODE_CFG_ACT_VID_MODE_TYPE_Msk 0x3UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_ACT_VID_MODE_CFG_ACT_LP_VSA_EN_Pos 2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_ACT_VID_MODE_CFG_ACT_LP_VSA_EN_Msk 0x4UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_ACT_VID_MODE_CFG_ACT_LP_VBP_EN_Pos 3UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_ACT_VID_MODE_CFG_ACT_LP_VBP_EN_Msk 0x8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_ACT_VID_MODE_CFG_ACT_LP_VFP_EN_Pos 4UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_ACT_VID_MODE_CFG_ACT_LP_VFP_EN_Msk 0x10UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_ACT_VID_MODE_CFG_ACT_LP_VACT_EN_Pos 5UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_ACT_VID_MODE_CFG_ACT_LP_VACT_EN_Msk 0x20UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_ACT_VID_MODE_CFG_ACT_LP_HBP_EN_Pos 6UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_ACT_VID_MODE_CFG_ACT_LP_HBP_EN_Msk 0x40UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_ACT_VID_MODE_CFG_ACT_LP_HFP_EN_Pos 7UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_ACT_VID_MODE_CFG_ACT_LP_HFP_EN_Msk 0x80UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_ACT_VID_MODE_CFG_ACT_FRAME_BTA_ACK_EN_Pos 8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_ACT_VID_MODE_CFG_ACT_FRAME_BTA_ACK_EN_Msk 0x100UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_ACT_VID_MODE_CFG_ACT_LP_CMD_EN_Pos 9UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_ACT_VID_MODE_CFG_ACT_LP_CMD_EN_Msk 0x200UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_ACT_VID_MODE_CFG_ACT_RESERVED_31_10_Pos 10UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_MODE_CFG_ACT_VID_MODE_CFG_ACT_RESERVED_31_10_Msk 0xFFFFFC00UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.VID_PKT_SIZE_ACT */
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_SIZE_ACT_VID_PKT_SIZE_ACT_VID_PKT_SIZE_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_SIZE_ACT_VID_PKT_SIZE_ACT_VID_PKT_SIZE_Msk 0x3FFFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_SIZE_ACT_VID_PKT_SIZE_ACT_RESERVED_31_14_Pos 14UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_SIZE_ACT_VID_PKT_SIZE_ACT_RESERVED_31_14_Msk 0xFFFFC000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.VID_NUM_CHUNKS_ACT */
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_NUM_CHUNKS_ACT_VID_NUM_CHUNKS_ACT_VID_NUM_CHUNKS_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_NUM_CHUNKS_ACT_VID_NUM_CHUNKS_ACT_VID_NUM_CHUNKS_Msk 0x1FFFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_NUM_CHUNKS_ACT_VID_NUM_CHUNKS_ACT_RESERVED_31_13_Pos 13UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_NUM_CHUNKS_ACT_VID_NUM_CHUNKS_ACT_RESERVED_31_13_Msk 0xFFFFE000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.VID_NULL_SIZE_ACT */
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_NULL_SIZE_ACT_VID_NULL_SIZE_ACT_VID_NULL_SIZE_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_NULL_SIZE_ACT_VID_NULL_SIZE_ACT_VID_NULL_SIZE_Msk 0x1FFFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_NULL_SIZE_ACT_VID_NULL_SIZE_ACT_RESERVED_31_13_Pos 13UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_NULL_SIZE_ACT_VID_NULL_SIZE_ACT_RESERVED_31_13_Msk 0xFFFFE000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.VID_HSA_TIME_ACT */
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_HSA_TIME_ACT_VID_HSA_TIME_ACT_VID_HSA_TIME_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_HSA_TIME_ACT_VID_HSA_TIME_ACT_VID_HSA_TIME_Msk 0xFFFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_HSA_TIME_ACT_VID_HSA_TIME_ACT_RESERVED_31_12_Pos 12UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_HSA_TIME_ACT_VID_HSA_TIME_ACT_RESERVED_31_12_Msk 0xFFFFF000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.VID_HBP_TIME_ACT */
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_HBP_TIME_ACT_VID_HBP_TIME_ACT_VID_HBP_TIME_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_HBP_TIME_ACT_VID_HBP_TIME_ACT_VID_HBP_TIME_Msk 0xFFFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_HBP_TIME_ACT_VID_HBP_TIME_ACT_RESERVED_31_12_Pos 12UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_HBP_TIME_ACT_VID_HBP_TIME_ACT_RESERVED_31_12_Msk 0xFFFFF000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.VID_HLINE_TIME_ACT */
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_HLINE_TIME_ACT_VID_HLINE_TIME_ACT_VID_HLINE_TIME_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_HLINE_TIME_ACT_VID_HLINE_TIME_ACT_VID_HLINE_TIME_Msk 0x7FFFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_HLINE_TIME_ACT_VID_HLINE_TIME_ACT_RESERVED_31_15_Pos 15UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_HLINE_TIME_ACT_VID_HLINE_TIME_ACT_RESERVED_31_15_Msk 0xFFFF8000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.VID_VSA_LINES_ACT */
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_VSA_LINES_ACT_VID_VSA_LINES_ACT_VSA_LINES_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_VSA_LINES_ACT_VID_VSA_LINES_ACT_VSA_LINES_Msk 0x3FFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_VSA_LINES_ACT_VID_VSA_LINES_ACT_RESERVED_31_10_Pos 10UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_VSA_LINES_ACT_VID_VSA_LINES_ACT_RESERVED_31_10_Msk 0xFFFFFC00UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.VID_VBP_LINES_ACT */
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_VBP_LINES_ACT_VID_VBP_LINES_ACT_VBP_LINES_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_VBP_LINES_ACT_VID_VBP_LINES_ACT_VBP_LINES_Msk 0x3FFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_VBP_LINES_ACT_VID_VBP_LINES_ACT_RESERVED_31_10_Pos 10UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_VBP_LINES_ACT_VID_VBP_LINES_ACT_RESERVED_31_10_Msk 0xFFFFFC00UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.VID_VFP_LINES_ACT */
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_VFP_LINES_ACT_VID_VFP_LINES_ACT_VFP_LINES_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_VFP_LINES_ACT_VID_VFP_LINES_ACT_VFP_LINES_Msk 0x3FFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_VFP_LINES_ACT_VID_VFP_LINES_ACT_RESERVED_31_10_Pos 10UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_VFP_LINES_ACT_VID_VFP_LINES_ACT_RESERVED_31_10_Msk 0xFFFFFC00UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.VID_VACTIVE_LINES_ACT */
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_VACTIVE_LINES_ACT_VID_VACTIVE_LINES_ACT_V_ACTIVE_LINES_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_VACTIVE_LINES_ACT_VID_VACTIVE_LINES_ACT_V_ACTIVE_LINES_Msk 0x3FFFUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_VACTIVE_LINES_ACT_VID_VACTIVE_LINES_ACT_RESERVED_31_14_Pos 14UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_VACTIVE_LINES_ACT_VID_VACTIVE_LINES_ACT_RESERVED_31_14_Msk 0xFFFFC000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.VID_PKT_STATUS */
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_STATUS_VID_PKT_STATUS_DPI_CMD_W_EMPTY_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_STATUS_VID_PKT_STATUS_DPI_CMD_W_EMPTY_Msk 0x1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_STATUS_VID_PKT_STATUS_DPI_CMD_W_FULL_Pos 1UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_STATUS_VID_PKT_STATUS_DPI_CMD_W_FULL_Msk 0x2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_STATUS_VID_PKT_STATUS_DPI_PLD_W_EMPTY_Pos 2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_STATUS_VID_PKT_STATUS_DPI_PLD_W_EMPTY_Msk 0x4UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_STATUS_VID_PKT_STATUS_DPI_PLD_W_FULL_Pos 3UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_STATUS_VID_PKT_STATUS_DPI_PLD_W_FULL_Msk 0x8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_STATUS_VID_PKT_STATUS_RESERVED_4_Pos 4UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_STATUS_VID_PKT_STATUS_RESERVED_4_Msk 0x10UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_STATUS_VID_PKT_STATUS_RESERVED_5_Pos 5UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_STATUS_VID_PKT_STATUS_RESERVED_5_Msk 0x20UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_STATUS_VID_PKT_STATUS_RESERVED_6_Pos 6UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_STATUS_VID_PKT_STATUS_RESERVED_6_Msk 0x40UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_STATUS_VID_PKT_STATUS_RESERVED_7_Pos 7UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_STATUS_VID_PKT_STATUS_RESERVED_7_Msk 0x80UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_STATUS_VID_PKT_STATUS_RESERVED_15_8_Pos 8UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_STATUS_VID_PKT_STATUS_RESERVED_15_8_Msk 0xFF00UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_STATUS_VID_PKT_STATUS_DPI_BUFF_PLD_EMPTY_Pos 16UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_STATUS_VID_PKT_STATUS_DPI_BUFF_PLD_EMPTY_Msk 0x10000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_STATUS_VID_PKT_STATUS_DPI_BUFF_PLD_FULL_Pos 17UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_STATUS_VID_PKT_STATUS_DPI_BUFF_PLD_FULL_Msk 0x20000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_STATUS_VID_PKT_STATUS_RESERVED_19_18_Pos 18UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_STATUS_VID_PKT_STATUS_RESERVED_19_18_Msk 0xC0000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_STATUS_VID_PKT_STATUS_RESERVED_20_Pos 20UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_STATUS_VID_PKT_STATUS_RESERVED_20_Msk 0x100000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_STATUS_VID_PKT_STATUS_RESERVED_21_Pos 21UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_STATUS_VID_PKT_STATUS_RESERVED_21_Msk 0x200000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_STATUS_VID_PKT_STATUS_RESERVED_22_Pos 22UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_STATUS_VID_PKT_STATUS_RESERVED_22_Msk 0x400000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_STATUS_VID_PKT_STATUS_RESERVED_23_Pos 23UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_STATUS_VID_PKT_STATUS_RESERVED_23_Msk 0x800000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_STATUS_VID_PKT_STATUS_RESERVED_31_24_Pos 24UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_VID_PKT_STATUS_VID_PKT_STATUS_RESERVED_31_24_Msk 0xFF000000UL
/* GFXSS_MIPIDSI_DWCMIPIDSI.SDF_3D_ACT */
#define GFXSS_MIPIDSI_DWCMIPIDSI_SDF_3D_ACT_SDF_3D_ACT_MODE_3D_Pos 0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_SDF_3D_ACT_SDF_3D_ACT_MODE_3D_Msk 0x3UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_SDF_3D_ACT_SDF_3D_ACT_FORMAT_3D_Pos 2UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_SDF_3D_ACT_SDF_3D_ACT_FORMAT_3D_Msk 0xCUL
#define GFXSS_MIPIDSI_DWCMIPIDSI_SDF_3D_ACT_SDF_3D_ACT_SECOND_VSYNC_Pos 4UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_SDF_3D_ACT_SDF_3D_ACT_SECOND_VSYNC_Msk 0x10UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_SDF_3D_ACT_SDF_3D_ACT_RIGHT_FIRST_Pos 5UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_SDF_3D_ACT_SDF_3D_ACT_RIGHT_FIRST_Msk 0x20UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_SDF_3D_ACT_SDF_3D_ACT_RESERVED_15_6_Pos 6UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_SDF_3D_ACT_SDF_3D_ACT_RESERVED_15_6_Msk 0xFFC0UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_SDF_3D_ACT_SDF_3D_ACT_SEND_3D_CFG_Pos 16UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_SDF_3D_ACT_SDF_3D_ACT_SEND_3D_CFG_Msk 0x10000UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_SDF_3D_ACT_SDF_3D_ACT_RESERVED_31_17_Pos 17UL
#define GFXSS_MIPIDSI_DWCMIPIDSI_SDF_3D_ACT_SDF_3D_ACT_RESERVED_31_17_Msk 0xFFFE0000UL


#endif /* _CYIP_GFXSS_H_ */


/* [] END OF FILE */
